{
    "id": "bundle--27b7ffe9-accd-40ab-a09a-3816656f43b5",
    "objects": [
        {
            "created": "2017-07-28T15:03:27.970Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "description": "The <code>HISTCONTROL</code> environment variable keeps track of what should be saved by the <code>history</code> command and eventually into the <code>~/.bash_history</code> file when a user logs out. This setting can be configured to ignore commands that start with a space by simply setting it to \"ignorespace\". <code>HISTCONTROL</code> can also be set to ignore duplicate commands by setting it to \"ignoredups\". In some Linux systems, this is set by default to \"ignoreboth\" which covers both of the previous examples. This means that “ ls” will not be saved, but “ls” would be saved by history. <code>HISTCONTROL</code> does not exist by default on macOS, but can be set by the user and will be respected. Adversaries can use this to operate without leaving traces by simply prepending a space to all of their terminal commands.\n\nDetection: Correlating a user session with a distinct lack of new commands in their <code>.bash_history</code> can be a clue to suspicious behavior. Additionally, users checking or changing their <code>HISTCONTROL</code> environment variable is also suspicious.\n\nPlatforms: Linux, MacOS, OS X\n\nData Sources: Process Monitoring, Authentication logs, File monitoring, Environment variable",
            "external_references": [
                {
                    "external_id": "T1148",
                    "source_name": "mitre-attack",
                    "url": "https://attack.mitre.org/wiki/Technique/T1148"
                }
            ],
            "id": "attack-pattern--b2a23bbd-1a12-4e1e-a985-b0cad55a5c91",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-attack",
                    "phase_name": "defense-evasion"
                }
            ],
            "modified": "2017-07-28T15:03:27.970Z",
            "name": "HISTCONTROL",
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "type": "attack-pattern",
            "x_mitre_data_sources": [
                "Process Monitoring",
                "Authentication logs",
                "File monitoring",
                "Environment variable"
            ],
            "x_mitre_platforms": [
                "Linux",
                "MacOS",
                "OS X"
            ]
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}