{
    "type": "bundle",
    "id": "bundle--6f365a92-456a-4f39-936d-5e7f0890558b",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "x-mitre-tactic",
            "name": "Lateral Movement",
            "description": "The adversary is trying to move through your ICS environment.\n\nLateral Movement consists of techniques that adversaries use to enter and control remote systems on a network. These techniques abuse default credentials, known accounts, and vulnerable services, and may also leverage dual-homed devices and systems that reside on both the IT and OT networks. The adversary uses these techniques to pivot to their next point in the environment, positioning themselves to where they want to be or think they should be. Following through on their primary objective often requires [Discovery](https://collaborate.mitre.org/attackics/index.php/Discovery) of the network and [Collection](https://collaborate.mitre.org/attackics/index.php/Collection) to develop awareness of unique ICS devices and processes, in order to find their target and subsequently gain access to it. Reaching this objective often involves pivoting through multiple systems, devices, and accounts. Adversaries may install their own remote tools to accomplish Lateral Movement or leverage default tools, programs, and manufacturer set or other legitimate credentials native to the network, which may be stealthier.",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "created": "2018-10-17T00:14:20.652Z",
            "id": "x-mitre-tactic--51c25a9e-8615-40c0-8afd-1da578847924",
            "x_mitre_shortname": "lateral-movement-ics",
            "modified": "2019-07-19T17:44:36.953Z",
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "external_references": [
                {
                    "source_name": "mitre-ics-attack",
                    "url": "https://collaborate.mitre.org/attackics/index.php/Lateral_Movement",
                    "external_id": "TA0109"
                }
            ]
        }
    ]
}