{
    "type": "bundle",
    "id": "bundle--1c855a0c-532e-4798-b384-efd92e15aa1f",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "course-of-action",
            "name": "Exfiltration Over Alternative Protocol Mitigation",
            "description": "Follow best practices for network firewall configurations to allow only necessary ports and traffic to enter and exit the network. For example, if services like FTP are not required for sending information outside of a network, then block FTP-related ports at the network perimeter. Enforce proxies and use dedicated servers for services such as DNS and only allow those systems to communicate over respective ports/protocols, instead of all systems within a network. (Citation: TechNet Firewall Design) These actions will help reduce command and control and exfiltration path opportunities.\n\nNetwork intrusion detection and prevention systems that use network signatures to identify traffic for specific adversary command and control infrastructure and malware can be used to mitigate activity at the network level. Signatures are often for unique indicators within protocols and may be based on the specific obfuscation technique used by a particular adversary or tool, and will likely be different across various malware families and versions. Adversaries will likely change tool command and control signatures over time or construct protocols in such a way to avoid detection by common defensive tools. (Citation: University of Birmingham C2)",
            "external_references": [
                {
                    "external_id": "T1048",
                    "source_name": "mitre-attack",
                    "url": "https://attack.mitre.org/mitigations/T1048"
                },
                {
                    "source_name": "TechNet Firewall Design",
                    "description": "Microsoft. (2004, February 6). Perimeter Firewall Design. Retrieved April 25, 2016.",
                    "url": "https://technet.microsoft.com/en-us/library/cc700828.aspx"
                },
                {
                    "description": "Gardiner, J.,  Cova, M., Nagaraja, S. (2014, February). Command & Control Understanding, Denying and Detecting. Retrieved April 20, 2016.",
                    "source_name": "University of Birmingham C2",
                    "url": "https://arxiv.org/ftp/arxiv/papers/1408/1408.1136.pdf"
                }
            ],
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "created": "2018-10-17T00:14:20.652Z",
            "id": "course-of-action--0e5bdf42-a7f7-4d16-a074-4915bd262f80",
            "modified": "2019-07-24T19:19:07.585Z",
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "x_mitre_version": "1.0",
            "x_mitre_deprecated": true
        }
    ]
}