{
    "type": "bundle",
    "id": "bundle--8f3d6bd9-15dc-4b02-b4b9-7912a2013525",
    "spec_version": "2.0",
    "objects": [
        {
            "modified": "2024-12-24T14:05:21.946Z",
            "name": "Threat Intelligence Program",
            "description": "A Threat Intelligence Program enables organizations to proactively identify, analyze, and act on cyber threats by leveraging internal and external data sources. The program supports decision-making processes, prioritizes defenses, and improves incident response by delivering actionable intelligence tailored to the organization's risk profile and operational environment. This mitigation can be implemented through the following measures:\n\nEstablish a Threat Intelligence Team:\n\n- Form a dedicated team or assign responsibility to existing security personnel to collect, analyze, and act on threat intelligence.\n\nDefine Intelligence Requirements:\n\n- Identify the organization’s critical assets and focus intelligence gathering efforts on threats targeting these assets.\n\nLeverage Internal and External Data Sources:\n\n- Collect intelligence from internal sources such as logs, incidents, and alerts.\nSubscribe to external threat intelligence feeds, participate in ISACs, and monitor open-source intelligence (OSINT).\n\nImplement Tools for Automation:\n\n- Use threat intelligence platforms (TIPs) to automate the collection, enrichment, and dissemination of threat data.\n- Integrate threat intelligence with SIEMs to correlate IOCs with internal events.\n\nAnalyze and Act on Intelligence:\n\n- Use frameworks like MITRE ATT&CK to map intelligence to adversary TTPs.\n- Prioritize defensive measures, such as patching vulnerabilities or deploying IOCs, based on analyzed threats.\n\nShare and Collaborate:\n\n- Share intelligence with industry peers through ISACs or threat-sharing platforms to enhance collective defense.\n\nEvaluate and Update the Program:\n\n- Regularly assess the effectiveness of the threat intelligence program.\n- Update intelligence priorities and capabilities as new threats emerge.\n\n*Tools for Implementation*\n\nThreat Intelligence Platforms (TIPs):\n\n- OpenCTI: An open-source platform for structuring and sharing threat intelligence.\n- MISP: A threat intelligence sharing platform for sharing structured threat data.\n\nThreat Intelligence Feeds:\n\n- Open Threat Exchange (OTX): Provides free access to a large repository of threat intelligence.\n- CIRCL OSINT Feed: A free source for IOCs and threat information.\n\nAutomation and Enrichment Tools:\n\n- TheHive: An open-source incident response platform with threat intelligence integration.\n- Yeti: A platform for managing and structuring knowledge about threats.\n\nAnalysis Frameworks:\n\n- MITRE ATT&CK Navigator: A tool for mapping threat intelligence to adversary behaviors.\n- Cuckoo Sandbox: Analyzes malware to extract behavioral indicators.\n\nCommunity and Collaboration Tools:\n\n- ISAC Memberships: Join industry-specific ISACs for intelligence sharing.\n- Slack/Discord Channels: Participate in threat intelligence communities for real-time collaboration.",
            "x_mitre_deprecated": false,
            "x_mitre_domains": [
                "enterprise-attack"
            ],
            "x_mitre_version": "1.1",
            "type": "course-of-action",
            "id": "course-of-action--874c0166-e407-45c2-a1d9-e4e3a6570fd8",
            "created": "2019-06-06T19:55:50.927Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "external_references": [
                {
                    "source_name": "mitre-attack",
                    "url": "https://attack.mitre.org/mitigations/M1019",
                    "external_id": "M1019"
                }
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "x_mitre_attack_spec_version": "3.2.0",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5"
        }
    ]
}