{
    "type": "bundle",
    "id": "bundle--8223a712-0d41-45e3-bb41-0c1e7e058700",
    "spec_version": "2.0",
    "objects": [
        {
            "modified": "2024-12-24T14:26:43.340Z",
            "name": "User Account Control",
            "description": "User Account Control (UAC) is a security feature in Microsoft Windows that prevents unauthorized changes to the operating system. UAC prompts users to confirm or provide administrator credentials when an action requires elevated privileges. Proper configuration of UAC reduces the risk of privilege escalation attacks. This mitigation can be implemented through the following measures:\n\nEnable UAC Globally:\n\n- Ensure UAC is enabled through Group Policy by setting `User Account Control: Run all administrators in Admin Approval Mode` to `Enabled`.\n\nRequire Credential Prompt:\n\n- Use Group Policy to configure UAC to prompt for administrative credentials instead of just confirmation (`User Account Control: Behavior of the elevation prompt`).\n\nRestrict Built-in Administrator Account:\n\nSet `Admin Approval Mode` for the built-in Administrator account to `Enabled` in Group Policy.\n\nSecure the UAC Prompt:\n\n- Configure UAC prompts to display on the secure desktop (`User Account Control: Switch to the secure desktop when prompting for elevation`).\n\nPrevent UAC Bypass:\n\n- Block untrusted applications from triggering UAC prompts by configuring `User Account Control: Only elevate executables that are signed and validated`.\n- Use EDR tools to detect and block known UAC bypass techniques.\n\nMonitor UAC-Related Events:\n\n- Use Windows Event Viewer to monitor for event ID 4688 (process creation) and look for suspicious processes attempting to invoke UAC elevation.\n\n*Tools for Implementation*\n\nBuilt-in Windows Tools:\n\n- Group Policy Editor: Configure UAC settings centrally for enterprise environments.\n- Registry Editor: Modify UAC-related settings directly, such as `EnableLUA` and `ConsentPromptBehaviorAdmin`.\n\nEndpoint Security Solutions:\n\n- Microsoft Defender for Endpoint: Detects and blocks UAC bypass techniques.\n- Sysmon: Logs process creations and monitors UAC elevation attempts for suspicious activity.\n\nThird-Party Security Tools:\n\n- Process Monitor (Sysinternals): Tracks real-time processes interacting with UAC.\n- EventSentry: Monitors Windows Event Logs for UAC-related alerts.",
            "x_mitre_deprecated": false,
            "x_mitre_domains": [
                "enterprise-attack"
            ],
            "x_mitre_version": "1.2",
            "type": "course-of-action",
            "id": "course-of-action--2c2ad92a-d710-41ab-a996-1db143bb4808",
            "created": "2019-06-11T17:14:35.170Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "external_references": [
                {
                    "source_name": "mitre-attack",
                    "url": "https://attack.mitre.org/mitigations/M1052",
                    "external_id": "M1052"
                }
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "x_mitre_attack_spec_version": "3.2.0",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5"
        }
    ]
}