{
    "type": "bundle",
    "id": "bundle--29121904-f5c7-4bb5-b49b-8f93be862ec0",
    "spec_version": "2.0",
    "objects": [
        {
            "modified": "2024-12-18T15:50:51.212Z",
            "name": "Limit Access to Resource Over Network",
            "description": "Restrict access to network resources, such as file shares, remote systems, and services, to only those users, accounts, or systems with a legitimate business requirement. This can include employing technologies like network concentrators, RDP gateways, and zero-trust network access (ZTNA) models, alongside hardening services and protocols. This mitigation can be implemented through the following measures:\n\nAudit and Restrict Access:\n\n- Regularly audit permissions for file shares, network services, and remote access tools.\n- Remove unnecessary access and enforce least privilege principles for users and services.\n- Use Active Directory and IAM tools to restrict access based on roles and attributes.\n\nDeploy Secure Remote Access Solutions:\n\n- Use RDP gateways, VPN concentrators, and ZTNA solutions to aggregate and secure remote access connections.\n- Configure access controls to restrict connections based on time, device, and user identity.\n- Enforce MFA for all remote access mechanisms.\n\nDisable Unnecessary Services:\n\n- Identify running services using tools like netstat (Windows/Linux) or Nmap.\n- Disable unused services, such as Telnet, FTP, and legacy SMB, to reduce the attack surface.\n- Use firewall rules to block traffic on unused ports and protocols.\n\nNetwork Segmentation and Isolation:\n\n- Use VLANs, firewalls, or micro-segmentation to isolate critical network resources from general access.\n- Restrict communication between subnets to prevent lateral movement.\n\nMonitor and Log Access:\n\n- Monitor access attempts to file shares, RDP, and remote network resources using SIEM tools.\n- Enable auditing and logging for successful and failed attempts to access restricted resources.\n\n*Tools for Implementation*\n\nFile Share Management:\n\n- Microsoft Active Directory Group Policies\n- Samba (Linux/Unix file share management)\n- AccessEnum (Windows access auditing tool)\n\nSecure Remote Access:\n\n- Microsoft Remote Desktop Gateway\n- Apache Guacamole (open-source RDP/VNC gateway)\n- Zero Trust solutions: Tailscale, Cloudflare Zero Trust\n\nService and Protocol Hardening:\n\n- Nmap or Nessus for network service discovery\n- Windows Group Policy Editor for disabling SMBv1, Telnet, and legacy protocols\n- iptables or firewalld (Linux) for blocking unnecessary traffic\n\nNetwork Segmentation:\n\n- pfSense for open-source network isolation",
            "x_mitre_deprecated": false,
            "x_mitre_domains": [
                "enterprise-attack"
            ],
            "x_mitre_version": "1.1",
            "type": "course-of-action",
            "id": "course-of-action--1dcaeb21-9348-42ea-950a-f842aaf1ae1f",
            "created": "2019-06-11T16:30:16.672Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "external_references": [
                {
                    "source_name": "mitre-attack",
                    "url": "https://attack.mitre.org/mitigations/M1035",
                    "external_id": "M1035"
                }
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "x_mitre_attack_spec_version": "3.2.0",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5"
        }
    ]
}