{
    "type": "bundle",
    "id": "bundle--cbd060c2-db40-4c10-be0b-e11ecb224d7d",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "x-mitre-data-component",
            "id": "x-mitre-data-component--1dad5aa4-4bb5-45e4-9e42-55d40003cfa6",
            "created": "2021-10-20T15:05:19.275Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "modified": "2025-04-18T15:14:58.597Z",
            "name": "Certificate Registration",
            "description": "Certificate Registration refers to the collection and analysis of information about digital certificates, including current, revoked, and expired certificates. Sources such as Certificate Transparency logs and other public resources provide visibility into certificates issued for specific domains or organizations. Monitoring certificate registrations can help identify potential misuse, such as unauthorized certificates or signs of adversary reconnaissance. Examples: \n\n- Certificate Transparency Logs: These logs record the issuance of SSL/TLS certificates by trusted Certificate Authorities (CAs).\n- Revoked Certificates: Information about certificates that have been invalidated before their expiration date.\n- Expired Certificates: Reports of expired certificates for a domain, which may indicate lax security practices or opportunities for adversaries to exploit expired credentials.\n- Domain Monitoring for Certificates: Maps SSL/TLS certificates to domains and subdomains, helping to identify any rogue certificates.\n- Public Certificate Directories: Services providing APIs to query issued certificates for analysis.\n\nThis data component can be collected through the following measures:\n\nUse Certificate Transparency Monitors\n\n- Tools like crt.sh, CertStream, or APIs provided by certificate authorities (CAs) allow you to monitor issued certificates in real-time.\n- Example: Use CertStream to stream certificate issuance logs and filter for domains of interest.\n\nAnalyze Certificate Revocation Sources\n\n- Monitor CRLs or query OCSP responders to detect revoked certificates.\n- Configure tools like OpenSSL or browsers to validate certificate revocation status automatically.\n\nLeverage Public Scanning Tools\n\n- Use tools such as SSL Labs, Censys, or Shodan to scan for certificate details related to your domain or network.\n\nAutomate Certificate Monitoring\n\n- Set up automated scripts or services to parse Certificate Transparency logs for anomalies.\n- Example: Automate searches on crt.sh to identify certificates issued for typo-squatted domains.\n\nIntegrate with Threat Intelligence\n\n- Enrich certificate data with threat intelligence feeds to detect connections to known adversary-controlled infrastructure.\n- Tools like VirusTotal can identify malicious certificates based on associated indicators.",
            "x_mitre_data_source_ref": "x-mitre-data-source--29aa4e0e-4a26-4f79-a9bc-1ae66df1c923",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_deprecated": false,
            "x_mitre_domains": [
                "enterprise-attack"
            ],
            "x_mitre_version": "1.1",
            "x_mitre_attack_spec_version": "3.2.0"
        }
    ]
}