{
    "type": "bundle",
    "id": "bundle--0a92d9ba-97d2-4405-a486-1757c1275619",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "x-mitre-data-component",
            "id": "x-mitre-data-component--b008766d-f34f-4ded-b712-659f59aaed6e",
            "created": "2021-10-20T15:05:19.271Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "modified": "2025-04-18T15:15:53.193Z",
            "name": "Image Creation",
            "description": "Initial construction of a virtual machine image within a cloud environment. Virtual machine images are templates containing an operating system and installed applications, which can be deployed to create new virtual machines. Monitoring the creation of these images is important because adversaries may create custom images to include malicious software or misconfigurations for later exploitation. Examples: \n\n- Azure Compute Service Image Creation\n    - Example: Creating a virtual machine image in Azure using Azure CLI: `az image create --resource-group MyResourceGroup --name MyImage --source MyVM`\n- AWS EC2 AMI (Amazon Machine Image) Creation\n    - Example: Creating an AMI from an EC2 instance: `aws ec2 create-image --instance-id i-1234567890abcdef0 --name \"MyAMI\" --description \"An AMI for my app\"`\n- Google Cloud Compute Engine Image Creation\n    - Example: Creating a custom image using gcloud: `gcloud compute images create my-custom-image --source-disk my-disk --source-disk-zone us-central1-a`\n- VMware vSphere\n    - Example: Exporting a VM to create an OVF (Open Virtualization Format) template: This could later be imported into other environments with potential tampering.\n\nThis data component can be collected through the following measures:\n\nEnable Cloud Platform Logging\n\n- Azure: Enable \"Activity Logs\" to capture image-related events such as PUT requests to `Microsoft.Compute/images`.\n- AWS: Use AWS CloudTrail to monitor `CreateImage` API calls.\n- Google Cloud: Enable \"Cloud Audit Logs\" to track custom image creation events under `compute.googleapis.com/images`.\n\nAPI Monitoring\n\n- Monitor API activity to track the creation of new images using:\n    - AWS SDK/CLI `CreateImage`.\n    - Azure REST API for image creation.\n    - Google Cloud Compute Engine APIs.\n\nCloud SIEM Integration\n\n- Ingest cloud platform logs into a centralized SIEM for real-time monitoring and alerting.\n",
            "x_mitre_data_source_ref": "x-mitre-data-source--1ac0ca69-e07e-4b34-9061-e4588e146c52",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_deprecated": false,
            "x_mitre_domains": [
                "enterprise-attack"
            ],
            "x_mitre_version": "1.1",
            "x_mitre_attack_spec_version": "3.2.0"
        }
    ]
}