{
    "type": "bundle",
    "id": "bundle--2c90b13c-a16e-4afc-9df3-18b1295d9fe4",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "x-mitre-data-component",
            "id": "x-mitre-data-component--45977f14-1bcc-4ec4-ac14-a30fd3a11f44",
            "created": "2021-10-20T15:05:19.272Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "modified": "2025-04-18T15:13:45.928Z",
            "name": "Cloud Storage Modification",
            "description": "Cloud Storage Modification involves tracking changes made to cloud storage infrastructure, including updates to settings, permissions, or stored data. Examples include modifying object access control lists (ACLs), uploading new objects, or updating bucket policies. Examples: \n\nAWS S3: An object is uploaded or its ACL is modified.\n- Azure Blob Storage: A blob's metadata or permissions are updated.\n- Google Cloud Storage: An object's lifecycle policy is updated, or a bucket policy is changed.\n- OpenStack Swift: Modifications to container settings or uploading of new objects.\n\nThis data component can be collected through the following measures:\n\nEnable Logging\n\n- AWS S3: Enable AWS CloudTrail to log API events like PutObject, PutObjectAcl, and PutBucketPolicy.\n- Azure Blob Storage: Use Azure Monitor to log write and update operations.\n- Google Cloud Storage: Enable Google Cloud Audit Logs to track storage.objects.update and storage.buckets.update.\n- OpenStack Swift: Enable logging for PUT and POST requests to track object uploads and container metadata updates.\n\nUse Cloud Monitoring Tools\n\n- Integrate with tools like AWS Config, Azure Security Center, or Google Cloud Monitoring to detect configuration drift or unauthorized changes.\n\nCentralized Log Aggregation\n\n- Use a SIEM (e.g., Splunk) to aggregate logs across multiple cloud providers for unified monitoring and analysis.\n\nPeriodic API Queries\n\n- AWS CLI Example: Query recent modifications to bucket policies: `aws s3api get-bucket-policy --bucket sensitive-data`\n- Azure CLI Example: List changes to a blob container: `az storage blob show --container-name private-docs`\n- Google Cloud CLI Example: Check metadata updates: `gcloud storage objects describe gs://user-uploads/document.txt`",
            "x_mitre_data_source_ref": "x-mitre-data-source--2ce537a2-3b30-4374-9397-31d6460ec0bc",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_deprecated": false,
            "x_mitre_domains": [
                "enterprise-attack"
            ],
            "x_mitre_version": "1.1",
            "x_mitre_attack_spec_version": "3.2.0"
        }
    ]
}