{
    "type": "bundle",
    "id": "bundle--fb9feec5-1dc7-4917-a4c4-9737c696fc18",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "x-mitre-data-component",
            "id": "x-mitre-data-component--e52d89f9-1710-4708-88a5-cbef77c4cd5e",
            "created": "2021-10-20T15:05:19.274Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "modified": "2025-04-18T15:15:24.409Z",
            "name": "Cloud Service Modification",
            "description": "Cloud service modification refers to changes made to the configuration, settings, or data of a cloud service. These modifications can include administrative changes such as enabling or disabling features, altering permissions, or deleting critical components. Monitoring these changes is critical to detect potential misconfigurations or malicious activity. Examples: \n\n- AWS Cloud Service Modifications: A user disables AWS CloudTrail logging (StopLogging) or deletes a CloudWatch configuration rule (DeleteConfigRule).\n- Azure Cloud Service Modifications: Changes to Azure Role-Based Access Control (RBAC) roles, such as adding a new Contributor role to a sensitive resource.\n- Google Cloud Service Modifications: Deletion of a Google Cloud Storage bucket or disabling a Google Cloud Function.\n- Office 365 Cloud Service Modifications: Altering mailbox permissions or disabling auditing in Microsoft 365.\n\nThis data component can be collected through the following measures:\n\nEnable Cloud Audit Logging\n\n- AWS: Enable AWS CloudTrail for logging management events such as StopLogging or DeleteTrail.\n- Azure: Use Azure Activity Logs to monitor resource changes and access actions.\n- Google Cloud: Enable Google Cloud Audit Logs to track API calls, resource modifications, and policy changes.\n- Office 365: Use Unified Audit Logs in Microsoft Purview to track administrative actions.\n\nCentralize Log Storage\n\n- Consolidate logs from all cloud providers into a SIEM or CSPM (Cloud Security Posture Management) tool.\n- Example: Use Splunk or Elastic Stack to ingest and analyze logs from AWS, Azure, and Google Cloud.\n\nAutomate Alerts for Sensitive Changes\n\n- Configure alerts for high-risk actions, such as disabling logging or modifying IAM roles.\n- AWS Example: Use AWS Config rules to detect and notify changes to critical services.\n- Azure Example: Set up Azure Monitor alerts for write actions on sensitive resources.\n\nEnable Continuous Monitoring\n\n- Use tools like AWS Security Hub, Azure Defender, or Google Chronicle to continuously monitor cloud service modifications for anomalies.",
            "x_mitre_data_source_ref": "x-mitre-data-source--b1ddede4-cafe-4955-ac4c-14b33ac3f647",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_deprecated": false,
            "x_mitre_domains": [
                "enterprise-attack"
            ],
            "x_mitre_version": "1.1",
            "x_mitre_attack_spec_version": "3.2.0"
        }
    ]
}