{
    "type": "bundle",
    "id": "bundle--5b6c80ae-b7d9-4728-a169-4a63b06f924b",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "x-mitre-data-component",
            "id": "x-mitre-data-component--b33d36e3-d7ea-4895-8eed-19a08a8f7c4f",
            "created": "2021-10-20T15:05:19.274Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "modified": "2025-04-18T15:15:27.794Z",
            "name": "Cloud Service Metadata",
            "description": "Cloud service metadata refers to the contextual and descriptive information about cloud services, including their name, type, purpose, configuration, and activity around them. This metadata is essential for understanding the roles and functions of cloud services, their operational status, and their potential misuse. Examples: \n\n- Azure Service Metadata: Metadata describing a resource in Azure, such as an Azure Storage Account or a Virtual Machine.\n- AWS Cloud Service Metadata: Metadata for an AWS EC2 instance collected using the `DescribeInstances` API call.\n- Google Cloud Service Metadata: Metadata for a Google Compute Engine instance collected using `gcloud compute instances describe`.\n- Office 365 Metadata: Metadata about an Office 365 SharePoint site.\n\nThis data component can be collected through the following measures:\n\nEnable Cloud Metadata APIs\n\n- Leverage APIs provided by cloud providers to query metadata about services.\n    - AWS: Use AWS CLI or SDKs for `DescribeInstances`, `DescribeBuckets`, etc.\n    - Azure: Use `az resource list` or SDKs.\n    - Google Cloud: Use `gcloud compute instances describe` or related commands.\n    - Office 365: Use Microsoft Graph API.\n\nCentralize Metadata in a Security Platform\n\n- Aggregate metadata from multiple clouds into a SIEM or CSPM (Cloud Security Posture Management) tool.\n- Example: Integrate AWS CloudTrail with Splunk or Azure Monitor with Sentinel.\n\nEnable Continuous Monitoring\n\n- Set up automated jobs or workflows to regularly query and update metadata.\n- Example: Use AWS Config to track resource configurations and changes over time.\n\nConfigure Access and Logging\n\n- Enable logging for API queries to ensure access and usage of metadata are monitored.\n- Example: Use AWS CloudTrail to log API activity for metadata queries.\n\nUse Cloud Security Tools\n\n- Employ CSPM tools like Prisma Cloud, Wiz, or Dome9 to gather metadata and identify misconfigurations.\n- Example: Prisma Cloud provides consolidated views of metadata for resources across AWS, Azure, and GCP.",
            "x_mitre_data_source_ref": "x-mitre-data-source--b1ddede4-cafe-4955-ac4c-14b33ac3f647",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_deprecated": false,
            "x_mitre_domains": [
                "enterprise-attack"
            ],
            "x_mitre_version": "1.1",
            "x_mitre_attack_spec_version": "3.2.0"
        }
    ]
}