{
    "type": "bundle",
    "id": "bundle--4883cb58-94e1-47ae-8554-052ea3f63ff4",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "x-mitre-data-component",
            "id": "x-mitre-data-component--fcc4811f-9cc8-4db5-8097-4d8242a380de",
            "created": "2021-10-20T15:05:19.272Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "modified": "2025-04-18T15:13:55.587Z",
            "name": "Cloud Storage Enumeration",
            "description": "Cloud Storage Enumeration involves retrieving a list of available cloud storage infrastructure, such as buckets, containers, or objects, within a cloud environment. This activity may be performed for legitimate administrative purposes or malicious reconnaissance by adversaries seeking to identify accessible storage resources.Examples:\n\n- AWS S3 Bucket Enumeration: An AWS user lists all buckets using the `ListBuckets` API call.\n- Azure Blob Storage Container Enumeration: A user retrieves a list of all containers within a storage account using the Azure Storage SDK or API.\n- Google Cloud Storage Bucket Enumeration: A Google Cloud user lists all buckets within a project using the `storage.buckets.list` API.\n- OpenStack Swift Container Enumeration: A user retrieves a list of containers in OpenStack Swift using the `GET` method on the storage endpoint.\n\nThis data component can be collected through the following measures:\n\nEnable Logging for Cloud Storage Enumeration\n\n- AWS S3: Enable AWS CloudTrail to capture ListBuckets and ListObjects API calls.\n- Azure Blob Storage: Enable Azure Monitor and Diagnostic Logs to capture enumeration operations like List Containers. Use Azure Event Grid to trigger alerts for container enumeration.\n- Google Cloud Storage: Enable Audit Logs in Google Cloud to track storage.buckets.list API activity.\n- OpenStack Swift: Configure Swift logging to capture GET requests for container enumeration.\n\nCentralized Log Aggregation\n\n- Use platforms like Splunk or native SIEM solutions to collect and analyze enumeration logs.\n",
            "x_mitre_data_source_ref": "x-mitre-data-source--2ce537a2-3b30-4374-9397-31d6460ec0bc",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_deprecated": false,
            "x_mitre_domains": [
                "enterprise-attack"
            ],
            "x_mitre_version": "1.1",
            "x_mitre_attack_spec_version": "3.2.0"
        }
    ]
}