{
    "type": "bundle",
    "id": "bundle--540a5a97-39aa-416d-a449-402d60c002bc",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "x-mitre-data-component",
            "id": "x-mitre-data-component--2e521444-7295-4dec-96c1-7595b2df7811",
            "created": "2021-10-20T15:05:19.275Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "modified": "2025-04-18T15:16:37.830Z",
            "name": "Active DNS",
            "description": "\"Domain Name: Active DNS\" data component captures queried DNS registry data that highlights current domain-to-IP address resolutions. This data includes both direct queries to DNS servers and records that provide mappings between domain names and associated IP addresses. It serves as a critical resource for tracking active infrastructure and understanding the network footprint of an organization or adversary. Examples: \n\n- DNS Query Example: `nslookup example.com`, `dig example.com A`\n- PTR Record Example: `dig -x 192.168.1.1`\n- Tracking Malicious Domains: DNS logs reveal repeated queries to suspicious domains like malicious-site.com. The IPs resolved by these domains may be indicators of compromise (IOCs).\n- DNS Record Types\n    - A/AAAA Record: Maps domain names to IP addresses (IPv4/IPv6).\n    - CNAME Record: Canonical name records, often used for redirects.\n    - MX Record: Mail exchange records, used to route emails.\n    - TXT Record: Can include security information like SPF or DKIM policies.\n    - SOA Record: Start of authority record for domain management.\n    - NS Record: Lists authoritative name servers for the domain.\n\nThis data component can be collected through the following measures:\n\n- System Utilities: Use built-in tools like `nslookup`, `dig`, or host on Linux, macOS, and Windows to perform active DNS queries.\n- DNS Logging\n    - Windows DNS Server: Enable DNS Analytical Logging to capture DNS queries and responses.\n    - Bind DNS: Enable query logging in the named.conf file.\n- Cloud Provider DNS Logging\n    - AWS Route 53: Enable query logging through CloudWatch or S3:\n    - Google Cloud DNS: Enable logging for Cloud DNS queries through Google Cloud Logging.\n- Network Traffic Monitoring: Use tools like Wireshark or Zeek to analyze DNS queries within network traffic.\n- Security Information and Event Management (SIEM) Integration: Aggregate DNS logs in a SIEM like Splunk to create alerts and monitor patterns.\n- Public OSINT Tools: Use OSINT platforms like VirusTotal, or PassiveTotal to collect information on domains and their associated IP addresses.",
            "x_mitre_data_source_ref": "x-mitre-data-source--dd75f457-8dc0-4a24-9ae5-4b61c33af866",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_deprecated": false,
            "x_mitre_domains": [
                "enterprise-attack"
            ],
            "x_mitre_version": "1.1",
            "x_mitre_attack_spec_version": "3.2.0"
        }
    ]
}