{
    "type": "bundle",
    "id": "bundle--102dca03-eb81-45d1-a6c6-c35bb8017210",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "x-mitre-data-component",
            "id": "x-mitre-data-component--ec0612c5-2644-4c50-bcac-82586974fedd",
            "created": "2021-10-20T15:05:19.274Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "modified": "2025-04-18T15:15:30.989Z",
            "name": "Cloud Service Disable",
            "description": "This data component refers to monitoring actions that deactivate or stop a cloud service in a cloud control plane. Examples include disabling essential logging services like AWS CloudTrail (`StopLogging` API call), Microsoft Azure Monitor Logs, or Google Cloud's Operations Suite (formerly Stackdriver). Disabling such services can hinder visibility into adversary activities within the cloud environment. Examples: \n\n- AWS CloudTrail StopLogging: This action stops logging of API activity for a particular trail, effectively reducing the monitoring and visibility of AWS resources and activities.\n- Microsoft Azure Monitor Logs: Disabling these logs hinders the organization’s ability to detect anomalous activities and trace malicious actions.\n- Google Cloud Logging: Disabling cloud logging removes visibility into resource activity, preventing monitoring of service access or configuration changes.\n- SaaS Applications: Stopping logging removes visibility into user activities, such as email access or file downloads, enabling undetected malicious behavior.\n\nThis data component can be collected through the following measures:\n\nEnable and Monitor Cloud Service Logging\n\n- Ensure logging is enabled for all cloud services, including administrative actions like StopLogging.\n- Example: Use AWS Config to verify that CloudTrail is enabled and enforce logging as a compliance rule.\n\nAPI Monitoring\n\n- Use API monitoring tools to detect calls like StopLogging or equivalent service-stopping actions in other platforms.\n- Example: Monitor AWS CloudWatch for specific API events such as StopLogging and flag unauthorized users.\n\nSIEM Integration\n\n- Collect logs and events from the cloud control plane into a centralized SIEM for real-time analysis and correlation.\n- Example: Ingest AWS CloudTrail logs into Splunk or Azure Monitor logs into Sentinel.\n\nCloud Security Posture Management (CSPM) Tools\n\n- Leverage CSPM tools like Prisma Cloud, Dome9, or AWS Security Hub to detect misconfigurations or suspicious activity, such as disabled logging.\n- Example: Set alerts for changes to logging configurations in CSPM dashboards.\n\nConfigure Alerts in Cloud Platforms\n\n- Create native alerts in cloud platforms to detect service stoppages.\n- Example: Configure an AWS CloudWatch alarm to trigger when StopLogging is invoked.",
            "x_mitre_data_source_ref": "x-mitre-data-source--b1ddede4-cafe-4955-ac4c-14b33ac3f647",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_deprecated": false,
            "x_mitre_domains": [
                "enterprise-attack"
            ],
            "x_mitre_version": "1.1",
            "x_mitre_attack_spec_version": "3.2.0"
        }
    ]
}