{
    "type": "bundle",
    "id": "bundle--425b28ea-3e59-49b0-be68-e6f3c58a7881",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "x-mitre-data-component",
            "id": "x-mitre-data-component--59ec10d9-546b-4b8e-bccb-fa85f71e5055",
            "created": "2021-10-20T15:05:19.272Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "modified": "2025-04-18T15:14:01.974Z",
            "name": "Cloud Storage Creation",
            "description": "Cloud Storage Creation refers to the initial creation of a new cloud storage resource, such as buckets, containers, or directories, within a cloud environment. This action is critical to track as it might indicate the legitimate provisioning of resources or unauthorized actions taken by adversaries to stage, store, or exfiltrate data. Examples: \n\n- AWS S3 Bucket Creation: An AWS user creates a new S3 bucket using the `CreateBucket` API call.\n- Azure Blob Storage Container Creation: A user creates a new container in Azure Blob Storage using the `Create Container` operation.\n- Google Cloud Storage Bucket Creation: A Google Cloud user creates a new bucket using `storage.buckets.create`.\n- OpenStack Swift Container Creation: A user creates a new container in OpenStack Swift using the `PUT` method.\n\nThis data component can be collected through the following measures:\n\nEnable Logging for Cloud Storage Services\n\n- AWS S3: Enable AWS CloudTrail to log CreateBucket API actions.\n- Azure Blob Storage: Enable Azure Monitor and Diagnostic Logs for storage account activity. Use Azure Event Grid to capture Create Container operations.\n- Google Cloud Storage: Enable Data Access logs in Cloud Audit Logs to monitor storage.buckets.create API calls.\n- OpenStack Swift: Configure Swift logging to capture PUT requests to new containers.\n\nCentralized Logging and Analysis\n\n- Forward logs to centralized platforms like Splunk or cloud-native SIEM solutions for correlation and analysis.",
            "x_mitre_data_source_ref": "x-mitre-data-source--2ce537a2-3b30-4374-9397-31d6460ec0bc",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_deprecated": false,
            "x_mitre_domains": [
                "enterprise-attack"
            ],
            "x_mitre_version": "1.1",
            "x_mitre_attack_spec_version": "3.2.0"
        }
    ]
}