{
    "type": "bundle",
    "id": "bundle--4e06246d-ed8c-49ec-8061-479afd5eb30b",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "x-mitre-data-component",
            "id": "x-mitre-data-component--ff9b665a-598b-4bcb-8b2a-a87566aa1256",
            "created": "2021-10-20T15:05:19.275Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "modified": "2025-04-18T15:16:34.616Z",
            "name": "Domain Registration",
            "description": "\"Domain Name: Domain Registration\" data component captures information about the assignment, ownership, and metadata of domain names. This information is often sourced from registries like WHOIS and includes details such as registrant names, contact information, registration dates, expiration dates, and registrar details. This data is invaluable for tracking domain ownership, detecting malicious domain registrations, and identifying trends in adversary behavior. Examples: \n\n- Registrant Information: WHOIS lookup of example.com \n- Registration and Expiration Dates: A domain registered a week before being used in phishing attacks.\n- Domain Status: Status codes like clientTransferProhibited or serverHold indicate domain restrictions or potential hijacking activity.\n- Name Server Information: Name servers point to a public DNS provider often associated with malicious campaigns.\n- Privacy Protection: A domain uses WHOIS privacy protection to hide registrant details.\n\nThis data component can be collected through the following measures:\n\n- WHOIS Services: Use tools or services to perform WHOIS lookups:\n- WHOIS APIs: Automate domain registration lookups with APIs:\n- Registrar Platforms: Directly query domain registrars (e.g., GoDaddy, Namecheap) for detailed registration data.\n- Threat Intelligence Platforms: Integrate domain registration data from services like Recorded Future, RiskIQ, or PassiveTotal for enriched analysis.",
            "x_mitre_data_source_ref": "x-mitre-data-source--dd75f457-8dc0-4a24-9ae5-4b61c33af866",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_deprecated": false,
            "x_mitre_domains": [
                "enterprise-attack"
            ],
            "x_mitre_version": "1.1",
            "x_mitre_attack_spec_version": "3.2.0"
        }
    ]
}