{
    "type": "bundle",
    "id": "bundle--00f7d06a-3eb0-45ac-8f74-8b3b1eb37519",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "x-mitre-data-component",
            "id": "x-mitre-data-component--1067aa74-5796-4d9b-b4f1-a4c9eb6fd9da",
            "created": "2021-10-20T15:05:19.275Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "modified": "2025-04-18T15:13:39.602Z",
            "name": "Response Metadata",
            "description": "Contextual information about an Internet-facing resource collected during a scan, including details such as open ports, running services, protocols, and versions. This metadata is typically derived from interpreting scan results and helps build a profile of the targeted system. Examples: \n\n- Port and Service Details:\n    - Open ports (e.g., 22, 80, 443).\n    - Identified services running on those ports (e.g., SSH, HTTP, HTTPS).\n- Service Versions: Detected software version information (e.g., Apache 2.4.41, OpenSSH 8.2).\n- Operating System Information: OS fingerprinting data (e.g., Linux Kernel 5.4.0).\n- TLS/SSL Certificate Data: Information about the TLS/SSL certificate, such as the expiration date, issuer, and cipher suites.\n\n*Data Collection Measures:*\n\n- Scanning Tools:\n    - Nmap: Collects port, service, and version information using commands like nmap -sV <IP>.\n    - Masscan: High-speed scanning tool for discovering open ports and active services.\n    - Zmap: Focused on large-scale Internet scanning, collecting metadata about discovered services.\n    - Shodan API: Retrieves scan metadata for publicly exposed devices and services.\n- Network Logs:\n    - Use logs from firewalls, intrusion detection systems (IDS), or intrusion prevention systems (IPS) to gather metadata from scan attempts. Example: Zeek or Suricata logs for incoming scan traffic.\n- OSINT Platforms: Platforms like Censys, GreyNoise, or Shodan provide aggregated metadata about Internet-facing resources.\n- Cloud Metadata Services: AWS Security Hub, Azure Monitor, or GCP Security Command Center can collect and centralize scan-related metadata for Internet-facing resources in cloud environments.",
            "x_mitre_data_source_ref": "x-mitre-data-source--38fe306c-bdec-4f3d-8521-b72dd32dbd17",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_deprecated": false,
            "x_mitre_domains": [
                "enterprise-attack"
            ],
            "x_mitre_version": "1.1",
            "x_mitre_attack_spec_version": "3.2.0"
        }
    ]
}