{
    "type": "bundle",
    "id": "bundle--9a6e665e-686d-481f-b178-de8f4b17bb38",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "x-mitre-data-component",
            "id": "x-mitre-data-component--9c2fa0ae-7abc-485a-97f6-699e3b6cf9fa",
            "created": "2021-10-20T15:05:19.272Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "modified": "2025-04-18T15:09:35.474Z",
            "name": "Application Log Content",
            "description": "Application Log Content refers to logs generated by applications or services, providing a record of their activity. These logs may include metrics, errors, performance data, and operational alerts from web, mail, or other applications. These logs are vital for monitoring application behavior and detecting malicious activities or anomalies. Examples: \n\n- Web Application Logs: These logs include information about requests, responses, errors, and security events (e.g., unauthorized access attempts).\n- Email Application Logs: Logs contain metadata about emails sent, received, or blocked (e.g., sender/receiver addresses, message IDs).\n- SaaS Application Logs: Activity logs include user logins, configuration changes, and access to sensitive resources.\n- Cloud Application Logs: Logs detail control plane activities, including API calls, instance modifications, and network changes.\n- System/Application Monitoring Logs: Logs provide insights into application performance, errors, and anomalies.\n\nThis data component can be collected through the following measures:\n\nConfigure Application Logging\n\n- Enable logging within the application or service.\n- Examples:\n    - Web Servers: Enable access and error logs in NGINX or Apache.\n    - Email Systems: Enable audit logging in Microsoft Exchange or Gmail.\n\nCentralized Log Management\n\n- Use log management solutions like Splunk, or a cloud-native logging solution.\n- Configure the application to send logs to a centralized system for analysis.\n\nCloud-Specific Collection\n\n- Use services like AWS CloudWatch, Azure Monitor, or Google Cloud Operations Suite for cloud-based applications.\n- Ensure logging is enabled for all critical resources (e.g., API calls, IAM changes).\n\nSIEM Integration\n\n- Integrate application logs with a SIEM platform (e.g., Splunk, QRadar) for real-time correlation and analysis.\n- Use parsers to standardize log formats and extract key fields like timestamps, user IDs, and error codes.",
            "x_mitre_data_source_ref": "x-mitre-data-source--40269753-26bd-437b-986e-159c66dec5e4",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_deprecated": false,
            "x_mitre_domains": [
                "ics-attack",
                "enterprise-attack"
            ],
            "x_mitre_version": "1.1",
            "x_mitre_attack_spec_version": "3.2.0"
        }
    ]
}