{
    "type": "bundle",
    "id": "bundle--bfcc13dd-4fd6-4f44-a3ac-9d082c449494",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "x-mitre-data-component",
            "id": "x-mitre-data-component--0dcbbf4f-929c-489a-b66b-9b820d3f7f0e",
            "created": "2021-10-20T15:05:19.275Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "modified": "2025-04-18T15:13:36.394Z",
            "name": "Response Content",
            "description": "Captured network traffic that provides details about responses received during an internet scan. This data includes both protocol header values (e.g., HTTP status codes, IP headers, or DNS response codes) and response body content (e.g., HTML, JSON, or raw data). Examples:\n\n- HTTP Scan: A web server responds to a probe with an HTTP 200 status code and an HTML body indicating the default page is accessible.\n- DNS Scan: A DNS server replies to a query with a resolved IP address for a domain, along with details like Time-To-Live (TTL) and authoritative information.\n- TCP Banner Grab: A service listening on a port (e.g., SSH or FTP) responds with a banner containing service name, version, or other metadata.\n\n*Data Collection Measures:*\n\n- Network Traffic Monitoring:\n    - Deploy packet capture tools like Wireshark, tcpdump, or Suricata to log both headers and body content of response traffic.\n    - Use network appliances like firewalls, intrusion detection systems (IDS), or intrusion prevention systems (IPS) with logging enabled to capture scan responses.\n- Cloud Logging Services:\n    - AWS VPC Flow Logs: Capture metadata about network flows, including source and destination, protocol, and response codes.\n    - GCP Packet Mirroring: Use mirrored packets to analyze responses.\n    - Azure NSG Flow Logs: Record network traffic flow information for analysis.\n- Specific Tools:\n    - Zmap or Masscan: Can perform internet-wide scans and collect response content for analysis.\n    - Nmap: Use custom scripts to capture and log detailed response data during scans.",
            "x_mitre_data_source_ref": "x-mitre-data-source--38fe306c-bdec-4f3d-8521-b72dd32dbd17",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_deprecated": false,
            "x_mitre_domains": [
                "enterprise-attack"
            ],
            "x_mitre_version": "1.1",
            "x_mitre_attack_spec_version": "3.2.0"
        }
    ]
}