{
    "id": "bundle--1d50b243-f0fe-4255-bf83-9daa3d22b048",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary tricks a victim into unknowingly initiating some action in one system while interacting with the UI from a seemingly completely different, usually an adversary controlled or intended, system.",
            "external_references": [
                {
                    "external_id": "CAPEC-103",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/103.html"
                },
                {
                    "external_id": "CWE-1021",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/1021.html"
                },
                {
                    "description": "Clickjacking",
                    "source_name": "OWASP Attacks",
                    "url": "https://owasp.org/www-community/attacks/Clickjacking"
                },
                {
                    "description": "OWASP Web Security Testing Guide, The Open Web Application Security Project (OWASP)",
                    "external_id": "REF-619",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://owasp.org/www-project-web-security-testing-guide/latest/4-Web_Application_Security_Testing/11-Client-side_Testing/09-Testing_for_Clickjacking.html"
                }
            ],
            "id": "attack-pattern--ec41b2b3-a3b6-4af0-be65-69e82907dfef",
            "modified": "2022-09-29T00:00:00.000Z",
            "name": "Clickjacking",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Standard",
            "x_capec_child_of_refs": [
                "attack-pattern--fc3a9a6f-66c9-4363-8ebd-9bd18725fff8"
            ],
            "x_capec_consequences": {
                "Access_Control": [
                    "Gain Privileges"
                ],
                "Authorization": [
                    "Gain Privileges"
                ],
                "Availability": [
                    "Unreliable Execution"
                ],
                "Confidentiality": [
                    "Gain Privileges",
                    "Read Data"
                ],
                "Integrity": [
                    "Modify Data"
                ]
            },
            "x_capec_domains": [
                "Social Engineering",
                "Software"
            ],
            "x_capec_example_instances": [
                "\n               <xhtml:p>A victim has an authenticated session with a site that provides an electronic payment service to transfer funds between subscribing members. At the same time, the victim receives an e-mail that appears to come from an online publication to which they subscribe with links to today's news articles. The victim clicks on one of these links and is taken to a page with the news story. There is a screen with an advertisement that appears on top of the news article with the 'skip this ad' button. Eager to read the news article, the user clicks on this button. Nothing happens. The user clicks on the button one more time and still nothing happens.</xhtml:p>\n               <xhtml:p>In reality, the victim activated a hidden action control located in a transparent layer above the 'skip this ad' button. The ad screen blocking the news article made it likely that the victim would click on the 'skip this ad' button. Clicking on the button, actually initiated the transfer of $1000 from the victim's account with an electronic payment service to an adversary's account. Clicking on the 'skip this ad' button the second time (after nothing seemingly happened the first time) confirmed the transfer of funds to the electronic payment service.</xhtml:p>\n            "
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Experiment</h3><ol><li> <p> <b>Craft a clickjacking page: </b>The adversary utilizes web page layering techniques to try to craft a malicious clickjacking page</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>The adversary leveraged iframe overlay capabilities to craft a malicious clickjacking page</td></tr><tr><td>The adversary leveraged Flash file overlay capabilities to craft a malicious clickjacking page</td></tr><tr><td>The adversary leveraged Silverlight overlay capabilities to craft a malicious clickjacking page</td></tr><tr><td>The adversary leveraged cross-frame scripting to craft a malicious clickjacking page</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Adversary lures victim to clickjacking page: </b>Adversary utilizes some form of temptation, misdirection or coercion to lure the victim to loading and interacting with the clickjacking page in a way that increases the chances that the victim will click in the right areas.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Lure the victim to the malicious site by sending the victim an e-mail with a URL to the site.</td></tr><tr><td>Lure the victim to the malicious site by manipulating URLs on a site trusted by the victim.</td></tr><tr><td>Lure the victim to the malicious site through a cross-site scripting attack.</td></tr></tbody></table><li> <p> <b>Trick victim into interacting with the clickjacking page in the desired manner: </b>The adversary tricks the victim into clicking on the areas of the UI which contain the hidden action controls and thereby interacts with the target system maliciously with the victim's level of privilege.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Hide action controls over very commonly used functionality.</td></tr><tr><td>Hide action controls over very psychologically tempting content.</td></tr></tbody></table></ol></div>",
            "x_capec_extended_description": "\n            <xhtml:p>While being logged in to some target system, the victim visits the adversary's malicious site which displays a UI that the victim wishes to interact with. In reality, the clickjacked page has a transparent layer above the visible UI with action controls that the adversary wishes the victim to execute. The victim clicks on buttons or other UI elements they see on the page which actually triggers the action controls in the transparent overlaying layer. Depending on what that action control is, the adversary may have just tricked the victim into executing some potentially privileged (and most certainly undesired) functionality in the target system to which the victim is authenticated. The basic problem here is that there is a dichotomy between what the victim thinks they are clicking on versus what they are actually clicking on.</xhtml:p>\n         ",
            "x_capec_likelihood_of_attack": "Medium",
            "x_capec_parent_of_refs": [
                "attack-pattern--1ff813eb-5def-43a0-a4b2-ea00aede114a",
                "attack-pattern--b9593e93-5589-4ae9-b0e7-09fa5c3136e5",
                "attack-pattern--0184fd4d-9134-42c0-b073-5e614773d408"
            ],
            "x_capec_prerequisites": [
                "The victim is communicating with the target application via a web based UI and not a thick client",
                "The victim's browser security policies allow at least one of the following JavaScript, Flash, iFrames, ActiveX, or CSS.",
                "The victim uses a modern browser that supports UI elements like clickable buttons (i.e. not using an old text only browser)",
                "The victim has an active session with the target system.",
                "The target system's interaction window is open in the victim's browser and supports the ability for initiating sensitive actions on behalf of the user in the target system"
            ],
            "x_capec_resources_required": [
                "None: No specialized resources are required to execute this type of attack."
            ],
            "x_capec_skills_required": {
                "High": "Crafting the proper malicious site and luring the victim to this site are not trivial tasks."
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}