{
    "id": "bundle--fab6fa4f-6c5e-4e4a-ad4b-d3c31a9390a9",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An attacker implants malicious software into the system in the supply chain distribution channel, with purpose of causing malicious disruption or allowing for additional compromise when the system is deployed.",
            "external_references": [
                {
                    "external_id": "CAPEC-523",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/523.html"
                },
                {
                    "description": "Supply Chain Compromise: Compromise Software Supply Chain",
                    "external_id": "T1195.002",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1195/002"
                },
                {
                    "description": "John F. Miller, Supply Chain Attack Framework and Attack Patterns, 2013, The MITRE Corporation",
                    "external_id": "REF-439",
                    "source_name": "reference_from_CAPEC",
                    "url": "http://www.mitre.org/sites/default/files/publications/supply-chain-attack-framework-14-0228.pdf"
                },
                {
                    "description": "Daniel Simpson, Dani Halfin, Andrews Mariano Gorzelany, Beth Woodbury, Supply chain attacks, 2021--10---28, Microsoft",
                    "external_id": "REF-716",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://docs.microsoft.com/en-us/windows/security/threat-protection/intelligence/supply-chain-malware"
                }
            ],
            "id": "attack-pattern--02570621-96aa-4525-b782-8e3939affac3",
            "modified": "2022-09-29T00:00:00.000Z",
            "name": "Malicious Software Implanted",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Standard",
            "x_capec_child_of_refs": [
                "attack-pattern--59ba3504-6764-48b4-980a-40e4adff2030"
            ],
            "x_capec_domains": [
                "Supply Chain"
            ],
            "x_capec_example_instances": [
                "An attacker has created a piece of malicious software designed to function as a backdoor in a system that is to be deployed at the victim location. During shipment of the system, the attacker has physical access to the system at a loading dock of an integrator for a short time. The attacker unpacks and powers up the system and installs the malicious piece of software, and configures it to run upon system boot. The system is repackaged and returned to its place on the loading dock, and is shipped and installed at the victim location with the malicious software in place, allowing the attacker to bypass firewalls and remotely gain access to the victim's network for further malicious activities."
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Determine Entry Point: </b>The adversary must first identify a system that they wish to target and search for an entry point they can use to install the malicious software. This could be a system which they have prior knowledge of, giving them insight into the software and environment.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Use a JTAGulator to identify exposed JTAG and UART interfaces in smaller embedded systems.</td></tr><tr><td>Identify exposed USB connectors that could be used to load software.</td></tr></tbody></table><li> <p> <b>Discover Vulnerability in Supply Chain: </b>The adversary maps out the supply chain for the targeted system. They look for ooportunities to gain physical access to the system after it has left the manufacturer, but before it is deployed to the victim.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Procure a system and observe the steps it takes in the shipment process.</td></tr><tr><td>Identify possible warehouses that systems are stored after manufacturing.</td></tr></tbody></table></ol></div><div><h3>Experiment</h3><ol><li> <p> <b>Test Malicious Software: </b>Before performing the attack in the wild, an adversary will test the attack on a system they have procured to ensure that the desired outcome will be achieved.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Design malicious software that will give an adversary a backdoor into the system once it is deployed to the victim.</td></tr><tr><td>Obtain already designed malicious software that just need to be placed into the system.</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Implant Software in the Supply Chain: </b>Using the vulnerability in the supply chain of the system discovered in the explore phase, the adversary implants the malicious software into the system. This results in the adversary gaining unintended access to systems once they reach the victim and can lead to a variety of follow up attacks.</p></li></ol></div>",
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_prerequisites": [
                "Physical access to the system after it has left the manufacturer but before it is deployed at the victim location."
            ],
            "x_capec_skills_required": {
                "High": "Malicious software creation."
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}