{
    "id": "bundle--9a27bede-c3d1-4764-8460-95121283f222",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "This OS fingerprinting probe examines the remote server's implementation of TCP timestamps. Not all operating systems implement timestamps within the TCP header, but when timestamps are used then this provides the attacker with a means to guess the operating system of the target. The attacker begins by probing any active TCP service in order to get response which contains a TCP timestamp. Different Operating systems update the timestamp value using different intervals. This type of analysis is most accurate when multiple timestamp responses are received and then analyzed. TCP timestamps can be found in the TCP Options field of the TCP header.",
            "external_references": [
                {
                    "external_id": "CAPEC-320",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/320.html"
                },
                {
                    "external_id": "CWE-200",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/200.html"
                },
                {
                    "description": "Stuart McClure, Joel Scambray, George Kurtz, Hacking Exposed: Network Security Secrets & Solutions (6th Edition), 2009, McGraw Hill",
                    "external_id": "REF-33",
                    "source_name": "reference_from_CAPEC"
                },
                {
                    "description": "Defense Advanced Research Projects Agency Information Processing Techniques Office, Information Sciences Institute University of Southern California, RFC793 - Transmission Control Protocol, 1981--09, Defense Advanced Research Projects Agency (DARPA)",
                    "external_id": "REF-128",
                    "source_name": "reference_from_CAPEC",
                    "url": "http://www.faqs.org/rfcs/rfc793.html"
                },
                {
                    "description": "Gordon \"Fyodor\" Lyon, Nmap Network Scanning: The Official Nmap Project Guide to Network Discovery and Security Scanning (3rd \"Zero Day\" Edition,), 2008, Insecure.com LLC",
                    "external_id": "REF-212",
                    "source_name": "reference_from_CAPEC"
                }
            ],
            "id": "attack-pattern--a15fddec-fd55-4c0b-8681-4e57ba5bc20d",
            "modified": "2018-07-31T00:00:00.000Z",
            "name": "TCP Timestamp Probe",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_child_of_refs": [
                "attack-pattern--6227a1fc-7504-4a5f-b5b2-4c4f1fe38617"
            ],
            "x_capec_consequences": {
                "Access_Control": [
                    "Bypass Protection Mechanism"
                ],
                "Authorization": [
                    "Bypass Protection Mechanism"
                ],
                "Confidentiality": [
                    "Read Data",
                    "Bypass Protection Mechanism"
                ]
            },
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Determine if timestamps are present.: </b>The adversary sends a probe packet to the remote host to identify if timestamps are present.</p></li></ol></div><div><h3>Experiment</h3><ol><li> <p> <b>Record and analyze timestamp values.: </b>If the remote host is using timestamp, obtain several timestamps, analyze them and compare them to known values.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>The adversary sends several requests and records the timestamp values.</td></tr><tr><td>The adversary analyzes the timestamp values and determines an average increments per second in the timestamps for the target.</td></tr><tr><td>The adversary compares this result to a database of known TCP timestamp increments for a possible match.</td></tr></tbody></table></ol></div>",
            "x_capec_likelihood_of_attack": "Medium",
            "x_capec_prerequisites": [
                "The ability to monitor and interact with network communications.Access to at least one host, and the privileges to interface with the network interface card.The target OS must support the TCP timestamp option in order to obtain a fingerprint."
            ],
            "x_capec_resources_required": [
                "\n               <xhtml:p>Any type of active probing that involves non-standard packet headers requires the use of raw sockets, which is not available on particular operating systems (Microsoft Windows XP SP 2, for example). Raw socket manipulation on Unix/Linux requires root privileges.</xhtml:p>\n               <xhtml:p>A tool capable of sending and receiving packets from a remote system.</xhtml:p>\n            "
            ],
            "x_capec_status": "Stable",
            "x_capec_typical_severity": "Low",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}