{
    "id": "bundle--a0b64aa8-c300-49f9-9ad2-ad63d9544e5b",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "This describes an attack where an application is forced to use a file that an attacker has corrupted. The result is often a denial of service caused by the application being unable to process the corrupted file, but other results, including the disabling of filters or access controls (if the application fails in an unsafe way rather than failing by locking down) or buffer overflows are possible.",
            "external_references": [
                {
                    "external_id": "CAPEC-263",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/263.html"
                },
                {
                    "external_id": "CWE-829",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/829.html"
                }
            ],
            "id": "attack-pattern--bc6411c8-18eb-4aa4-8643-a87a42813996",
            "modified": "2019-04-04T00:00:00.000Z",
            "name": "Force Use of Corrupted Files",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_child_of_refs": [
                "attack-pattern--9ad2c2eb-9939-4590-9683-2e789692d262"
            ],
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_prerequisites": [
                "The targeted application must utilize a configuration file that an attacker is able to corrupt. In some cases, the attacker must be able to force the (re-)reading of the corrupted file if the file is normally only consulted at startup.",
                "The severity of the attack hinges on how the application responds to the corrupted file. If the application detects the corruption and locks down, this may result in the denial of services provided by the application. If the application fails to detect the corruption, the result could be a more severe denial of service (crash or hang) or even an exploitable buffer overflow. If the application detects the corruption but fails in an unsafe way, this attack could result in the continuation of services but without certain security structures, such as filters or access controls. For example, if the corrupted file configures filters, an unsafe response from an application could result in simply disabling the filtering mechanisms due to the lack of usable configuration data."
            ],
            "x_capec_resources_required": [
                "This varies depending on the resources necessary to corrupt the configuration file and the resources needed to force the application to re-read it (if any)."
            ],
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Medium",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}