{
    "id": "bundle--183a7be5-bae0-4d0a-bac2-4503ce85a4d8",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary examines screenshot images created by iOS in an attempt to obtain sensitive information. This attack targets temporary screenshots created by the underlying OS while the application remains open in the background.",
            "external_references": [
                {
                    "external_id": "CAPEC-498",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/498.html"
                },
                {
                    "external_id": "CWE-359",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/359.html"
                },
                {
                    "description": "Jonathan Zdziarksi, Hacking and Securing iOS Applications (First Edition), 2012, O'Reilly Media, Inc.",
                    "external_id": "REF-426",
                    "source_name": "reference_from_CAPEC"
                }
            ],
            "id": "attack-pattern--1b75b059-c9ee-4c4d-b016-bafb20cce96b",
            "modified": "2023-01-24T00:00:00.000Z",
            "name": "Probe iOS Screenshots",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_child_of_refs": [
                "attack-pattern--191fbdab-d3b3-4ffd-8829-51331c20eaa7"
            ],
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_extended_description": "These images are used by iOS to aid in the visual transition between open applications and improve the user's experience with a device. An application can be at risk even if it properly protects sensitive information when at rest. If the application displays sensitive information on the screen, then the potential exists for iOS to unintentionally record that information in an image file. An adversary can retrieve these images either by gaining access to the image files, or by physically obtaining the device and leveraging the multitasking switcher interface. This attack differs from CAPEC-648, which targets intentional screenshots initiated by an end-user that are stored in the device's storage.",
            "x_capec_prerequisites": [
                "This type of an attack requires physical access to a device to either excavate the image files (potentially by leveraging a Jailbreak) or view the screenshots through the multitasking switcher (by double tapping the home button on the device)."
            ],
            "x_capec_status": "Draft",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}