{
    "id": "bundle--4d49e0a0-ed12-4417-b59a-359a51f910dd",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary manipulates the use or processing of an interface (e.g. Application Programming Interface (API) or System-on-Chip (SoC)) resulting in an adverse impact upon the security of the system implementing the interface. This can allow the adversary to bypass access control and/or execute functionality not intended by the interface implementation, possibly compromising the system which integrates the interface. Interface manipulation can take on a number of forms including forcing the unexpected use of an interface or the use of an interface in an unintended way.",
            "external_references": [
                {
                    "external_id": "CAPEC-113",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/113.html"
                },
                {
                    "external_id": "CWE-1192",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/1192.html"
                }
            ],
            "id": "attack-pattern--f4186110-0c20-42fa-bc6f-d0ff9f700f91",
            "modified": "2021-06-24T00:00:00.000Z",
            "name": "Interface Manipulation",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Meta",
            "x_capec_domains": [
                "Software",
                "Hardware"
            ],
            "x_capec_example_instances": [
                "An adversary may make a request to an application that leverages a non-standard API that is known to incorrectly validate its data and thus it may be manipulated by supplying metacharacters or alternate encodings as input, resulting in any number of injection flaws, including SQL injection, cross-site scripting, or command execution.",
                "API methods not intended for production, such as debugging or testing APIs, may not be disabled when deploying in a production environment. As a result, dangerous functionality can be exposed within the production environment, which an adversary can leverage to execute additional attacks.",
                "SoC components contain insufficient identifiers, which allows an adversary to reset the device at will or read sensitive data from the device."
            ],
            "x_capec_likelihood_of_attack": "Medium",
            "x_capec_parent_of_refs": [
                "attack-pattern--b289975f-c5e0-4d27-bf50-5937bfd02cfd",
                "attack-pattern--a0fc32ad-ef32-44d5-9937-5968f5e7b78c",
                "attack-pattern--f90601a6-9e18-4e96-804d-01a4f4ea30f2",
                "attack-pattern--d0db3641-ee0d-4897-89aa-3c85c69377a5"
            ],
            "x_capec_prerequisites": [
                "The target system must expose interface functionality in a manner that can be discovered and manipulated by an adversary. This may require reverse engineering the interface or decrypting/de-obfuscating client-server exchanges."
            ],
            "x_capec_resources_required": [
                "The requirements vary depending upon the nature of the interface. For example, application-layer APIs related to the processing of the HTTP protocol may require one or more of the following: an Adversary-In-The-Middle (CAPEC-94) proxy, a web browser, or a programming/scripting language."
            ],
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Medium",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}