{
    "id": "bundle--1e3a85aa-746f-489c-9e49-596aa28abb35",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An attacker with access to data files and processes on a victim's system injects malicious data into critical operational data during configuration or recalibration, causing the victim's system to perform in a suboptimal manner that benefits the adversary.",
            "external_references": [
                {
                    "external_id": "CAPEC-536",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/536.html"
                },
                {
                    "external_id": "CWE-284",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/284.html"
                },
                {
                    "description": "John F. Miller, Supply Chain Attack Framework and Attack Patterns, 2013, The MITRE Corporation",
                    "external_id": "REF-439",
                    "source_name": "reference_from_CAPEC",
                    "url": "http://www.mitre.org/sites/default/files/publications/supply-chain-attack-framework-14-0228.pdf"
                }
            ],
            "id": "attack-pattern--be032a5f-7575-4e82-86d8-6c5cabb3d9dd",
            "modified": "2021-10-21T00:00:00.000Z",
            "name": "Data Injected During Configuration",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Standard",
            "x_capec_child_of_refs": [
                "attack-pattern--f9f65fdd-5857-4a57-a725-066465397601"
            ],
            "x_capec_domains": [
                "Supply Chain",
                "Software"
            ],
            "x_capec_example_instances": [
                "An adversary wishes to bypass a security system to access an additional network segment where critical data is kept. The adversary knows that some configurations of the security system will allow for remote bypass under certain conditions, such as switching a specific parameter to a different value. The adversary knows the bypass will work but also will be detected within the logging data of the security system. The adversary waits until an upgrade is performed to the security system by the victim's system administrators, and the adversary has access to an external logging system. The adversary injects false log entries that cause the administrators to think there are two different error states within the security system - one involving the specific parameter and the other involving the logging entries. The specific parameter is adjusted to a different value, and the logging level is reduced to a lower level that will not cause an adversary bypass to be detected. The adversary stops injecting false log data, and the administrators of the security system believe the issues were caused by the upgrade and are now resolved. The adversary is then able to bypass the security system."
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Determine configuration process: </b>The adversary, through a previously compromised system, either remotely or physically, determines what the configuration process is. They look at configuration files, data files, and running processes on the system to identify areas where they could inject malicious data.</p></li><li> <p> <b>Determine when configuration occurs: </b>The adversary needs to then determine when configuration or recalibration of a system occurs so they know when to inject malicious data.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Look for a weekly update cycle or repeated update schedule.</td></tr><tr><td>Insert a malicious process into the target system that notifies the adversary when configuration is occurring.</td></tr></tbody></table></ol></div><div><h3>Experiment</h3><ol><li> <p> <b>Determine malicious data to inject: </b>By looking at the configuration process, the adversary needs to determine what malicious data they want to insert and where to insert it.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Add false log data</td></tr><tr><td>Change configuration files</td></tr><tr><td>Change data files</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Inject malicious data: </b>Right before, or during system configuration, the adversary injects the malicious data. This leads to the system behaving in a way that is beneficial to the adversary and is often followed by other attacks.</p></li></ol></div>",
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_prerequisites": [
                "The attacker must have previously compromised the victim's systems or have physical access to the victim's systems.",
                "Advanced knowledge of software and hardware capabilities of a manufacturer's product."
            ],
            "x_capec_skills_required": {
                "High": "Ability to generate and inject false data into operational data into a system with the intent of causing the victim to alter the configuration of the system."
            },
            "x_capec_status": "Stable",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}