{
    "id": "bundle--7694bd8f-9445-4e21-9c99-8284d2b2565f",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "Cryptanalysis is a process of finding weaknesses in cryptographic algorithms and using these weaknesses to decipher the ciphertext without knowing the secret key (instance deduction). Sometimes the weakness is not in the cryptographic algorithm itself, but rather in how it is applied that makes cryptanalysis successful. An attacker may have other goals as well, such as: Total Break (finding the secret key), Global Deduction (finding a functionally equivalent algorithm for encryption and decryption that does not require knowledge of the secret key), Information Deduction (gaining some information about plaintexts or ciphertexts that was not previously known) and Distinguishing Algorithm (the attacker has the ability to distinguish the output of the encryption (ciphertext) from a random permutation of bits).",
            "external_references": [
                {
                    "external_id": "CAPEC-97",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/97.html"
                },
                {
                    "external_id": "CWE-327",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/327.html"
                },
                {
                    "external_id": "CWE-1204",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/1204.html"
                },
                {
                    "external_id": "CWE-1240",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/1240.html"
                },
                {
                    "external_id": "CWE-1241",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/1241.html"
                },
                {
                    "external_id": "CWE-1279",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/1279.html"
                },
                {
                    "description": "Cryptanalysis",
                    "source_name": "OWASP Attacks",
                    "url": "https://owasp.org/www-community/attacks/Cryptanalysis"
                },
                {
                    "description": "Wikipedia, The Wikimedia Foundation, Inc",
                    "external_id": "REF-556",
                    "source_name": "reference_from_CAPEC",
                    "url": "http://en.wikipedia.org/wiki/Cryptanalysis"
                }
            ],
            "id": "attack-pattern--f1336271-5f27-40de-a61b-aba6572d120f",
            "modified": "2022-09-29T00:00:00.000Z",
            "name": "Cryptanalysis",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Standard",
            "x_capec_can_precede_refs": [
                "attack-pattern--86a5e931-7f53-46fe-b6f0-c88498f6557f"
            ],
            "x_capec_child_of_refs": [
                "attack-pattern--30b081a0-bf20-432b-8211-a340bbd04731"
            ],
            "x_capec_consequences": {
                "Confidentiality": [
                    "Read Data (In most cases, if cryptanalysis is successful at all, an adversary will not be able to decrypt the entire message, but instead will only be able to deduce some information about the plaintext. However, that may be sufficient for an adversary, depending on the context of the attack.)"
                ]
            },
            "x_capec_domains": [
                "Communications",
                "Hardware"
            ],
            "x_capec_example_instances": [
                "A very easy to understand example is a cryptanalysis technique called frequency analysis that can be successfully applied to the very basic classic encryption algorithms that performed mono-alphabetic substitution replacing each letter in the plaintext with its predetermined mapping letter from the same alphabet. This was considered an improvement over a more basic technique that would simply shift all of the letters of the plaintext by some constant number of positions and replace the original letters with the new letter with the resultant alphabet position. While mono-alphabetic substitution ciphers are resilient to blind brute force, they can be broken easily with nothing more than a pen and paper. Frequency analysis uses the fact that natural language is not random and mono-alphabetic substitution does not hide the statistical properties of the natural language. So if the letter \"E\" in an English language occurs with a certain known frequency (about 12.7%), whatever \"E\" was substituted with to get to the ciphertext, will occur with the similar frequency. Having this frequency information allows the cryptanalyst to quickly determine the substitutions and decipher the ciphertext. Frequency analysis techniques are not applicable to modern ciphers as they are all resilient to it (unless this is a very bad case of a homegrown encryption algorithm). This example is inapplicable to modern cryptographic ciphers but is here to illustrate a rudimentary example of cryptanalysis."
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p>An attacker discovers a weakness in the cryptographic algorithm or a weakness in how it was applied to a particular chunk of plaintext.</p></li></ol></div><div><h3>Exploit</h3><ol><li> <p>An attacker leverages the discovered weakness to decrypt, partially decrypt or infer some information about the contents of the encrypted message. All of that is done without knowing the secret key.</p></li></ol></div>",
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_parent_of_refs": [
                "attack-pattern--63048cb5-6d42-4fa2-a0e1-eeff2ef2a34d",
                "attack-pattern--9dded599-dd66-4a4c-8f17-6afb81c234f8"
            ],
            "x_capec_prerequisites": [
                "The target software utilizes some sort of cryptographic algorithm.",
                "An underlying weaknesses exists either in the cryptographic algorithm used or in the way that it was applied to a particular chunk of plaintext.",
                "The encryption algorithm is known to the attacker.",
                "An attacker has access to the ciphertext."
            ],
            "x_capec_resources_required": [
                "Computing resource requirements will vary based on the complexity of a given cryptanalysis technique. Access to the encryption/decryption routines of the algorithm is also required."
            ],
            "x_capec_skills_required": {
                "High": "Cryptanalysis generally requires a very significant level of understanding of mathematics and computation."
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Very High",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}