{
    "id": "bundle--41c61492-899a-41f1-bda4-441b9c4df2e8",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary, through a previously installed malicious application, impersonates an expected or routine task in an attempt to steal sensitive information or leverage a user's privileges.",
            "external_references": [
                {
                    "external_id": "CAPEC-504",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/504.html"
                },
                {
                    "external_id": "CWE-1021",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/1021.html"
                },
                {
                    "description": "Masquerading: Masquerade Task or Service",
                    "external_id": "T1036.004",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1036/004"
                },
                {
                    "description": "Adrienne Porter Felt, David Wagner, Phishing on Mobile Devices, 2011, University of California, Berkeley",
                    "external_id": "REF-434",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://people.eecs.berkeley.edu/~daw/papers/mobphish-w2sp11.pdf"
                }
            ],
            "id": "attack-pattern--1995c522-a25d-46e4-b024-65172771a692",
            "modified": "2022-09-29T00:00:00.000Z",
            "name": "Task Impersonation",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Standard",
            "x_capec_child_of_refs": [
                "attack-pattern--fc3a9a6f-66c9-4363-8ebd-9bd18725fff8"
            ],
            "x_capec_consequences": {
                "Access_Control": [
                    "Gain Privileges"
                ],
                "Authentication": [
                    "Gain Privileges"
                ]
            },
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_example_instances": [
                "An adversary monitors the system task list for Microsoft Outlook in an attempt to determine when the application may prompt the user to enter their credentials to view encrypted email. Once the task is executed, the adversary impersonates the credential prompt to obtain the user's Microsoft Outlook encryption credentials. These credentials can then be leveraged by the adversary to read a user's encrypted email.",
                "An adversary prompts a user to authorize an elevation of privileges, implying that a background task needs additional permissions to execute. The user accepts the privilege elevation, allowing the adversary to execute additional malware or tasks with the user's privileges."
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Determine suitable tasks to exploit: </b>Determine what tasks exist on the target system that may result in a user providing sensitive information.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Determine what tasks prompt a user for their credentials.</td></tr><tr><td>Determine what tasks may prompt a user to authorize a process to execute with elevated privileges.</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Impersonate Task: </b>Impersonate a legitimate task, either expected or unexpected, in an attempt to gain user credentials or to ride the user's privileges.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Prompt a user for their credentials, while making the user believe the credential request is legitimate.</td></tr><tr><td>Prompt a user to authorize a task to run with elevated privileges, while making the user believe the request is legitimate.</td></tr></tbody></table></ol></div>",
            "x_capec_extended_description": "\n            <xhtml:p>When impersonating an expected task, the adversary monitors the task list maintained by the operating system and waits for a specific legitimate task to become active. Once the task is detected, the malicious application launches a new task in the foreground that mimics the user interface of the legitimate task. At this point, the user thinks that they are interacting with the legitimate task that they started, but instead they are interacting with the malicious application. Once the adversary's goal is reached, the malicious application can exit, leaving the original trusted application visible and the appearance that nothing out of the ordinary has occurred.</xhtml:p>\n            <xhtml:p>A second approach entails the adversary impersonating an unexpected task, but one that may often be spawned by legitimate background processes. For example, an adversary may randomly impersonate a system credential prompt, implying that a background process requires authentication for some purpose. The user, believing they are interacting with a legitimate task, enters their credentials or authorizes the use of their stored credentials, which the adversary then leverages for nefarious purposes. This type of attack is most often used to obtain sensitive information (e.g., credentials) from the user, but may also be used to ride the user's privileges.</xhtml:p>\n         ",
            "x_capec_likelihood_of_attack": "Medium",
            "x_capec_parent_of_refs": [
                "attack-pattern--f7a0e7bd-d24a-4390-b365-9e71f22e4e06"
            ],
            "x_capec_prerequisites": [
                "The adversary must already have access to the target system via some means.",
                "A legitimate task must exist that an adversary can impersonate to glean credentials.",
                "The user's privileges allow them to execute certain tasks with elevated privileges."
            ],
            "x_capec_resources_required": [
                "Malware or some other means to initially comprise the target system.",
                "Additional malware to impersonate a legitimate task."
            ],
            "x_capec_skills_required": {
                "Low": "Once an adversary has gained access to the target system, impersonating a task is trivial."
            },
            "x_capec_status": "Stable",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}