{
    "id": "bundle--12480f5b-3562-4daf-a9ae-691deecdf27c",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary exploits a resource shared between multiple applications, an application pool or hardware pin multiplexing to affect behavior. Resources may be shared between multiple applications or between multiple threads of a single application. Resource sharing is usually accomplished through mutual access to a single memory location or multiplexed hardware pins. If an adversary can manipulate this shared resource (usually by co-opting one of the applications or threads) the other applications or threads using the shared resource will often continue to trust the validity of the compromised shared resource and use it in their calculations. This can result in invalid trust assumptions, corruption of additional data through the normal operations of the other users of the shared resource, or even cause a crash or compromise of the sharing applications.",
            "external_references": [
                {
                    "external_id": "CAPEC-124",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/124.html"
                },
                {
                    "external_id": "CWE-1189",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/1189.html"
                },
                {
                    "external_id": "CWE-1331",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/1331.html"
                }
            ],
            "id": "attack-pattern--d5e0c12f-6086-491d-86e5-e10a14d1f947",
            "modified": "2020-12-17T00:00:00.000Z",
            "name": "Shared Resource Manipulation",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Meta",
            "x_capec_domains": [
                "Software",
                "Hardware"
            ],
            "x_capec_prerequisites": [
                "The target applications, threads or functions must share resources between themselves.",
                "The adversary must be able to manipulate some piece of the shared resource either directly or indirectly and the other users of the data must accept the changed data as valid. Usually this requires that the adversary be able to compromise one of the sharing applications or threads in order to manipulate the shared data."
            ],
            "x_capec_resources_required": [
                "None: The attacker does not need any specialized resources to execute this type of attack."
            ],
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Medium",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}