{
    "id": "bundle--33dd4423-4fb8-469b-b8bf-e2d8a073fdd3",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An attacker removes or disables filtering mechanisms on the target application. Input filters prevent invalid data from being sent to an application (for example, overly large inputs that might cause a buffer overflow or other malformed inputs that may not be correctly handled by an application). Input filters might also be designed to constrained executable content.",
            "external_references": [
                {
                    "external_id": "CAPEC-200",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/200.html"
                }
            ],
            "id": "attack-pattern--5c201b0f-aa6f-4220-a544-1e1e7ca8ecf7",
            "modified": "2022-02-22T00:00:00.000Z",
            "name": "Removal of filters: Input filters, output filters, data masking",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_child_of_refs": [
                "attack-pattern--3c404955-b160-423f-b148-d4fa4727e3a9"
            ],
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_extended_description": "\n            <xhtml:p>For example, if an application accepts scripting languages as input, an input filter could constrain the commands received and block those that the application's administrator deems to be overly powerful. An output filter screens responses from an application or person in order to prevent disclosure of sensitive information.</xhtml:p>\n            <xhtml:p>For example, an application's output filter might block output that is sourced to sensitive folders or which contains certain keywords. A data mask is similar to an output filter, but usually applies to structured data, such as found in databases. Data masks elide or replace portions of the information returned from a query in order to protect against the disclosure of sensitive information. If an input filter is removed the attacker will be able to send content to the target and have the target utilize it without it being sanitized. If the content sent by the attacker is executable, the attacker may be able to execute arbitrary commands on the target. If an output filter or data masking mechanism is disabled, the target may send out sensitive information that would otherwise be elided by the filters. If the data mask is disabled, sensitive information stored in a database would be returned unaltered. This could result in the disclosure of sensitive information, such as social security numbers of payment records.</xhtml:p>\n            <xhtml:p>This attack is usually executed as part of a larger attack series. The attacker would disable filters and would then mount additional attacks to either insert commands or data or query the target application in ways that would otherwise be prevented by the filters.</xhtml:p>\n         ",
            "x_capec_prerequisites": [
                "The target application must utilize some sort of filtering mechanism (input, output, or data masking)."
            ],
            "x_capec_resources_required": [
                "None: No specialized resources are required to execute this type of attack."
            ],
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Medium",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}