{
    "id": "bundle--775582fa-dc39-4e05-9e6f-33ed027b43c8",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "Phishing is a social engineering technique where an attacker masquerades as a legitimate entity with which the victim might do business in order to prompt the user to reveal some confidential information (very frequently authentication credentials) that can later be used by an attacker. Phishing is essentially a form of information gathering or \"fishing\" for information.",
            "external_references": [
                {
                    "external_id": "CAPEC-98",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/98.html"
                },
                {
                    "external_id": "CWE-451",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/451.html"
                },
                {
                    "description": "Phishing",
                    "external_id": "T1566",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1566"
                },
                {
                    "description": "Phishing for Information",
                    "external_id": "T1598",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1598"
                },
                {
                    "description": "Wireless Security - Bluejack a Victim, TutorialsPoint",
                    "external_id": "REF-656",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://www.tutorialspoint.com/wireless_security/wireless_security_bluejack_a_victim.htm"
                }
            ],
            "id": "attack-pattern--a00c2cc2-bd4f-4594-9ec1-b021b62ac896",
            "modified": "2023-01-24T00:00:00.000Z",
            "name": "Phishing",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Standard",
            "x_capec_can_precede_refs": [
                "attack-pattern--5dec633b-7b10-4bfe-9270-e68b98112285",
                "attack-pattern--0d249bf9-13b3-4c13-9423-bcb1ea73c067",
                "attack-pattern--a69b641a-dff7-4dad-b9b1-e00f80b083a2",
                "attack-pattern--b6f0fd7e-6068-4557-976c-fd34914b11bf",
                "attack-pattern--a2cad567-3a04-4ef3-8b62-25924c93b53f",
                "attack-pattern--c4e18b3f-0445-49e8-9bf1-d47a23082501"
            ],
            "x_capec_child_of_refs": [
                "attack-pattern--22802ed6-ddc6-4da7-b6be-60b10d26198b"
            ],
            "x_capec_consequences": {
                "Access_Control": [
                    "Gain Privileges"
                ],
                "Authorization": [
                    "Gain Privileges"
                ],
                "Confidentiality": [
                    "Gain Privileges",
                    "Read Data"
                ],
                "Integrity": [
                    "Modify Data"
                ]
            },
            "x_capec_domains": [
                "Social Engineering"
            ],
            "x_capec_example_instances": [
                "The target gets an official looking e-mail from their bank stating that their account has been temporarily locked due to suspected unauthorized activity and that they need to click on the link included in the e-mail to log in to their bank account in order to unlock it. The link in the e-mail looks very similar to that of their bank and once the link is clicked, the log in page is the exact replica. The target supplies their login credentials after which they are notified that their account has now been unlocked and that everything is fine. An attacker has just collected the target's online banking information which can now be used by the attacker to log into the target's bank account and transfer money to a bank account of the attackers' choice.",
                "An adversary may use BlueJacking, or Bluetooth Phishing to send unsolicited contact cards, messages, or pictures to nearby devices that are listening via Bluetooth. These messages may contain phishing content."
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Obtain domain name and certificate to spoof legitimate site: </b>This optional step can be used to help the attacker impersonate the legitimate site more convincingly. The attacker can use homograph attacks to convince users that they are using the legitimate website. Note that this step is not required for phishing attacks, and many phishing attacks simply supply URLs containing an IP address and no SSL certificate.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Optionally obtain a domain name that visually looks similar to the legitimate site's domain name. An example is www.paypaI.com vs. www.paypal.com (the first one contains a capital i, instead of a lower case L)</td></tr><tr><td>Optionally obtain a legitimate SSL certificate for the new domain name.</td></tr></tbody></table><li> <p> <b>Explore legitimate website and create duplicate: </b>An attacker creates a website (optionally at a URL that looks similar to the original URL) that closely resembles the website that they are trying to impersonate. That website will typically have a login form for the victim to put in their authentication credentials. There can be different variations on a theme here.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Use spidering software to get copy of web pages on legitimate site.</td></tr><tr><td>Manually save copies of required web pages from legitimate site.</td></tr><tr><td>Create new web pages that have the legitimate site's look and feel, but contain completely new content.</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Convince user to enter sensitive information on attacker's site.: </b>An attacker sends an e-mail to the victim that has some sort of a call to action to get the user to click on the link included in the e-mail (which takes the victim to attacker's website) and log in. The key is to get the victim to believe that the e-mail is coming from a legitimate entity with which the victim does business and that the website pointed to by the URL in the e-mail is the legitimate website. A call to action will usually need to sound legitimate and urgent enough to prompt action from the user.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Send the user a message from a spoofed legitimate-looking e-mail address that asks the user to click on the included link.</td></tr><tr><td>Place phishing link in post to online forum.</td></tr></tbody></table><li> <p> <b>Use stolen credentials to log into legitimate site: </b>Once the attacker captures some sensitive information through phishing (login credentials, credit card information, etc.) the attacker can leverage this information. For instance, the attacker can use the victim's login credentials to log into their bank account and transfer money to an account of their choice.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Log in to the legitimate site using another user's supplied credentials</td></tr></tbody></table></ol></div>",
            "x_capec_likelihood_of_attack": "High",
            "x_capec_parent_of_refs": [
                "attack-pattern--ff3cf9fc-c308-4571-8a01-ecae629a49c1",
                "attack-pattern--614cd894-0aa6-4031-88e1-89bd7b6118bb",
                "attack-pattern--ec0a802f-1d0a-4360-a4d8-3fb9f48715d0"
            ],
            "x_capec_prerequisites": [
                "An attacker needs to have a way to initiate contact with the victim. Typically that will happen through e-mail.",
                "An attacker needs to correctly guess the entity with which the victim does business and impersonate it. Most of the time phishers just use the most popular banks/services and send out their \"hooks\" to many potential victims.",
                "An attacker needs to have a sufficiently compelling call to action to prompt the user to take action.",
                "The replicated website needs to look extremely similar to the original website and the URL used to get to that website needs to look like the real URL of the said business entity."
            ],
            "x_capec_resources_required": [
                "Some web development tools to put up a fake website."
            ],
            "x_capec_skills_required": {
                "Medium": "Basic knowledge about websites: obtaining them, designing and implementing them, etc."
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Very High",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}