{
    "id": "bundle--2c5af81a-95c4-4cff-97a1-58ac2c1f202f",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary attacks a target by providing input that causes an application to read beyond the boundary of a defined buffer. This typically occurs when a value influencing where to start or stop reading is set to reflect positions outside of the valid memory location of the buffer. This type of attack may result in exposure of sensitive information, a system crash, or arbitrary code execution.",
            "external_references": [
                {
                    "external_id": "CAPEC-540",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/540.html"
                },
                {
                    "external_id": "CWE-125",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/125.html"
                }
            ],
            "id": "attack-pattern--40eddae8-4d7d-4fc3-b220-1c9706f01a96",
            "modified": "2021-10-21T00:00:00.000Z",
            "name": "Overread Buffers",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Standard",
            "x_capec_child_of_refs": [
                "attack-pattern--476ca631-2695-43f8-82f6-83c06a07ae36"
            ],
            "x_capec_consequences": {
                "Availability": [
                    "Unreliable Execution (Depending on the use of the target buffer, an application or system crash can be achieved.)"
                ],
                "Confidentiality": [
                    "Read Data (By reading outside the boundary of the intended buffer, the adversary is potentially able to see any data that is stored on the disk. This could include secret keys, personal information, and sensitive files.)"
                ]
            },
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Identify target application: </b>The adversary identifies a target application or program to perform the buffer overread on. Adversaries often look for applications that accept user input and that perform manual memory management.</p></li></ol></div><div><h3>Experiment</h3><ol><li> <p> <b>Find attack vector: </b>The adversary identifies an attack vector by looking for areas in the application where they can specify to read more data than is required.</p></li></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Overread the buffer: </b>The adversary provides input to the application that gets it to read past the bounds of a buffer, possibly revealing sensitive information that was not intended to be given to the adversary.</p></li></ol></div>",
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_prerequisites": [
                "For this type of attack to be successful, a few prerequisites must be met. First, the targeted software must be written in a language that enables fine grained buffer control. (e.g., c, c++) Second, the targeted software must actually perform buffer operations and inadequately perform bounds-checking on those buffer operations. Finally, the adversary must have the capability to influence the input that guides these buffer operations."
            ],
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}