{
    "id": "bundle--826d911a-9d23-4ec6-b726-e76b1ee608b9",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An attacker modifies the parameters of the SOAP message that is sent from the service consumer to the service provider to initiate a SQL injection attack. On the service provider side, the SOAP message is parsed and parameters are not properly validated before being used to access a database in a way that does not use parameter binding, thus enabling the attacker to control the structure of the executed SQL query. This pattern describes a SQL injection attack with the delivery mechanism being a SOAP message.",
            "external_references": [
                {
                    "external_id": "CAPEC-110",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/110.html"
                },
                {
                    "external_id": "CWE-89",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/89.html"
                },
                {
                    "external_id": "CWE-20",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/20.html"
                }
            ],
            "id": "attack-pattern--7c90bef7-530c-427b-8fb7-f9d3eda9c26a",
            "modified": "2021-06-24T00:00:00.000Z",
            "name": "SQL Injection through SOAP Parameter Tampering",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_can_follow_refs": [
                "attack-pattern--8e3a14fd-870a-4286-866d-805107c7d922"
            ],
            "x_capec_can_precede_refs": [
                "attack-pattern--89acf77d-723b-43b4-b66d-6eaafed52369"
            ],
            "x_capec_child_of_refs": [
                "attack-pattern--42acc604-a86c-46f7-bd03-6e532c02d85e"
            ],
            "x_capec_consequences": {
                "Access_Control": [
                    "Gain Privileges"
                ],
                "Authorization": [
                    "Gain Privileges"
                ],
                "Availability": [
                    "Unreliable Execution",
                    "Execute Unauthorized Commands (Run Arbitrary Code)"
                ],
                "Confidentiality": [
                    "Read Data",
                    "Gain Privileges",
                    "Execute Unauthorized Commands (Run Arbitrary Code)"
                ],
                "Integrity": [
                    "Modify Data",
                    "Execute Unauthorized Commands (Run Arbitrary Code)"
                ]
            },
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_example_instances": [
                "An attacker uses a travel booking system that leverages SOAP communication between the client and the travel booking service. An attacker begins to tamper with the outgoing SOAP messages by modifying their parameters to include characters that would break a dynamically constructed SQL query. They notice that the system fails to respond when these malicious inputs are injected in certain parameters transferred in a SOAP message. The attacker crafts a SQL query that modifies their payment amount in the travel system's database and passes it as one of the parameters . A backend batch payment system later fetches the payment amount from the database (the modified payment amount) and sends to the credit card processor, enabling the attacker to purchase the airfare at a lower price. An attacker needs to have some knowledge of the system's database, perhaps by exploiting another weakness that results in information disclosure."
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Detect Incorrect SOAP Parameter Handling: </b>The attacker tampers with the SOAP message parameters and looks for indications that the tampering caused a change in behavior of the targeted application.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>The attacker tampers with the SOAP message parameters by injecting some special characters such as single quotes, double quotes, semi columns, etc. The attacker observes system behavior.</td></tr></tbody></table></ol></div><div><h3>Experiment</h3><ol><li> <p> <b>Probe for SQL Injection vulnerability: </b>The attacker injects SQL syntax into vulnerable SOAP parameters identified during the Explore phase to search for unfiltered execution of the SQL syntax in a query.</p></li></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Inject SQL via SOAP Parameters: </b>The attacker injects SQL via SOAP parameters identified as vulnerable during Explore phase to launch a first or second order SQL injection attack.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>An attacker performs a SQL injection attack via the usual methods leveraging SOAP parameters as the injection vector. An attacker has to be careful not to break the XML parser at the service provider which may prevent the payload getting through to the SQL query. The attacker may also look at the WSDL for the web service (if available) to better understand what is expected by the service provider.</td></tr></tbody></table></ol></div>",
            "x_capec_likelihood_of_attack": "High",
            "x_capec_prerequisites": [
                "SOAP messages are used as a communication mechanism in the system",
                "SOAP parameters are not properly validated at the service provider",
                "The service provider does not properly utilize parameter binding when building SQL queries"
            ],
            "x_capec_resources_required": [
                "None: No specialized resources are required to execute this type of attack."
            ],
            "x_capec_skills_required": {
                "High": "If the attacker has to perform Blind SQL Injection",
                "Medium": "If the attacker is able to gain good understanding of the system's database schema"
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Very High",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}