{
    "id": "bundle--c1b522cc-4e68-4d20-9c76-066f821820be",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary targets mobile phone users with a phishing attack for the purpose of soliciting account passwords or sensitive information from the user. Mobile Phishing is a variation of the Phishing social engineering technique where the attack is initiated via a text or SMS message, rather than email. The user is enticed to provide information or visit a compromised web site via this message. Apart from the manner in which the attack is initiated, the attack proceeds as a standard Phishing attack.",
            "external_references": [
                {
                    "external_id": "CAPEC-164",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/164.html"
                },
                {
                    "external_id": "CWE-451",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/451.html"
                },
                {
                    "description": "What is smishing?, 2018--01---18, NortonLifeLock Inc.",
                    "external_id": "REF-590",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://us.norton.com/internetsecurity-emerging-threats-what-is-smishing.html"
                },
                {
                    "description": "What is Smishing and How to Defend Against it?, AO Kaspersky Lab",
                    "external_id": "REF-591",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://usa.kaspersky.com/resource-center/threats/what-is-smishing-and-how-to-defend-against-it"
                },
                {
                    "description": "Jovi Umawing, Something else is phishy: How to detect phishing attempts on mobile phones , 2018--12---10, Malwarebytes",
                    "external_id": "REF-592",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://blog.malwarebytes.com/101/2018/12/something-else-phishy-detect-phishing-attempts-mobile/"
                },
                {
                    "description": "Aaron Cockerill, 5 most common mobile phishing tactics, 2020--04---17, AT&T Cybersecurity",
                    "external_id": "REF-593",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://cybersecurity.att.com/blogs/security-essentials/mobile-phishing"
                },
                {
                    "description": "Ben Martens, 11 Facts + Stats on Smishing (SMS Phishing) in 2021, 2021, SafetyDetectives",
                    "external_id": "REF-696",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://www.safetydetectives.com/blog/what-is-smishing-sms-phishing-facts/"
                }
            ],
            "id": "attack-pattern--614cd894-0aa6-4031-88e1-89bd7b6118bb",
            "modified": "2023-01-24T00:00:00.000Z",
            "name": "Mobile Phishing",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_alternate_terms": [
                "Smishing",
                "MobPhishing"
            ],
            "x_capec_child_of_refs": [
                "attack-pattern--a00c2cc2-bd4f-4594-9ec1-b021b62ac896"
            ],
            "x_capec_consequences": {
                "Access_Control": [
                    "Gain Privileges"
                ],
                "Authorization": [
                    "Gain Privileges"
                ],
                "Confidentiality": [
                    "Gain Privileges",
                    "Read Data"
                ],
                "Integrity": [
                    "Modify Data"
                ]
            },
            "x_capec_domains": [
                "Social Engineering"
            ],
            "x_capec_example_instances": [
                "The target receives a text message stating that their Apple ID has been disabled due to suspicious activity and that they need to click on the link included in the message to log into their Apple account in order to enable it. The link in the text message looks legitimate and once the link is clicked, the login page is an exact replica of Apple's standard login page. The target supplies their login credentials and are then notified that their account has now been unlocked. However, the adversary has just collected the target's Apple account information, which can now be used by the adversary for a variety of purposes."
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Obtain domain name and certificate to spoof legitimate site: </b>This optional step can be used to help the adversary impersonate the legitimate site more convincingly. The adversary can use homograph or similar attacks to convince users that they are using the legitimate website. Note that this step is not required for phishing attacks, and many phishing attacks simply supply URLs containing an IP address and no SSL certificate.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Optionally obtain a domain name that visually looks similar to the legitimate site's domain name. An example is www.paypaI.com vs. www.paypal.com (the first one contains a capital i, instead of a lower case L)</td></tr><tr><td>Optionally obtain a legitimate SSL certificate for the new domain name.</td></tr></tbody></table><li> <p> <b>Explore legitimate website and create duplicate: </b>An adversary creates a website (optionally at a URL that looks similar to the original URL) that closely resembles the website that they are trying to impersonate. That website will typically have a login form for the victim to put in their authentication credentials. There can be different variations on a theme here.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Use spidering software to get copy of web pages on legitimate site.</td></tr><tr><td>Manually save copies of required web pages from legitimate site.</td></tr><tr><td>Create new web pages that have the legitimate site's look and feel, but contain completely new content.</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Convince user to enter sensitive information on adversary's site.: </b>An adversary sends a text message to the victim that has a call-to-action, in order to persuade the user into clicking the included link (which then takes the victim to the adversary's website) and logging in. The key is to get the victim to believe that the text message originates from a legitimate entity with which the victim does business and that the website pointed to by the URL in the text message is the legitimate website. A call-to-action will usually need to sound legitimate and urgent enough to prompt action from the user.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Send the user a message from a spoofed legitimate-looking mobile number that asks the user to click on the included link.</td></tr></tbody></table><li> <p> <b>Use stolen credentials to log into legitimate site: </b>Once the adversary captures some sensitive information through phishing (login credentials, credit card information, etc.) the adversary can leverage this information. For instance, the adversary can use the victim's login credentials to log into their bank account and transfer money to an account of their choice.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Log in to the legitimate site using another user's supplied credentials</td></tr></tbody></table></ol></div>",
            "x_capec_likelihood_of_attack": "High",
            "x_capec_prerequisites": [
                "An adversary needs mobile phone numbers to initiate contact with the victim.",
                "An adversary needs to correctly guess the entity with which the victim does business and impersonate it. Most of the time phishers just use the most popular banks/services and send out their \"hooks\" to many potential victims.",
                "An adversary needs to have a sufficiently compelling call to action to prompt the user to take action.",
                "The replicated website needs to look extremely similar to the original website and the URL used to get to that website needs to look like the real URL of the said business entity."
            ],
            "x_capec_resources_required": [
                "Either mobile phone or access to a web resource that allows text messages to be sent to mobile phones. Resources needed for regular Phishing attack."
            ],
            "x_capec_skills_required": {
                "Medium": "Basic knowledge about websites: obtaining them, designing and implementing them, etc."
            },
            "x_capec_status": "Stable",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}