{
    "id": "bundle--500c00ab-e512-4d07-91a5-eba9d9f97d4a",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary engages in probing and exploration activities to identify constituents and properties of the target.",
            "external_references": [
                {
                    "external_id": "CAPEC-169",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/169.html"
                },
                {
                    "external_id": "CWE-200",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/200.html"
                },
                {
                    "description": "Browser Bookmark Discovery",
                    "external_id": "T1217",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1217"
                },
                {
                    "description": "Gather Victim Host Information",
                    "external_id": "T1592",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1592"
                },
                {
                    "description": "Active Scanning",
                    "external_id": "T1595",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1595"
                },
                {
                    "description": "Manic Velocity, Footprinting And The Basics Of Hacking, Web Textfiles",
                    "external_id": "REF-31",
                    "source_name": "reference_from_CAPEC",
                    "url": "http://web.textfiles.com/hacking/footprinting.txt"
                },
                {
                    "description": "Eddie Sutton, Footprint: What Is And How Do You Erase Them",
                    "external_id": "REF-32",
                    "source_name": "reference_from_CAPEC",
                    "url": "http://www.infosecwriters.com/text_resources/pdf/Footprinting.pdf"
                },
                {
                    "description": "Stuart McClure, Joel Scambray, George Kurtz, Hacking Exposed: Network Security Secrets & Solutions (6th Edition), 2009, McGraw Hill",
                    "external_id": "REF-33",
                    "source_name": "reference_from_CAPEC"
                },
                {
                    "description": "Gordon \"Fyodor\" Lyon, Nmap Network Scanning: The Official Nmap Project Guide to Network Discovery and Security Scanning (3rd \"Zero Day\" Edition,), 2008, Insecure.com LLC, ISBN: 978-0-9799587-1-7",
                    "external_id": "REF-34",
                    "source_name": "reference_from_CAPEC"
                }
            ],
            "id": "attack-pattern--87b0d2df-b246-4bf9-aee8-4912e2fa1a30",
            "modified": "2022-09-29T00:00:00.000Z",
            "name": "Footprinting",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Meta",
            "x_capec_consequences": {
                "Confidentiality": [
                    "Read Data"
                ]
            },
            "x_capec_domains": [
                "Communications",
                "Software"
            ],
            "x_capec_example_instances": [
                "In this example let us look at the website http://www.example.com to get much information we can about Alice. From the website, we find that Alice also runs foobar.org. We type in www example.com into the prompt of the Name Lookup window in a tool, and our result is this IP address: 192.173.28.130 We type the domain into the Name Lookup prompt and we are given the same IP. We can safely say that example and foobar.org are hosted on the same box. But if we were to do a reverse name lookup on the IP, which domain will come up? www.example.com or foobar.org? Neither, the result is nijasvspirates.org. So nijasvspirates.org is the name of the box hosting 31337squirrel.org and foobar.org. So now that we have the IP, let's check to see if nijasvspirates is awake. We type the IP into the prompt in the Ping window. We'll set the interval between packets to 1 millisecond. We'll set the number of seconds to wait until a ping times out to 5. We'll set the ping size to 500 bytes and we'll send ten pings. Ten packets sent and ten packets received. nijasvspirates.org returned a message to my computer within an average of 0.35 seconds for every packet sent. nijasvspirates is alive. We open the Whois window and type nijasvspirates.org into the Query prompt, and whois.networksolutions.com into the Server prompt. This means we'll be asking Network Solutions to tell us everything they know about nijasvspirates.org. The result is this laundry list of info: Registrant: FooBar (nijasvspirates -DOM) p.o.box 11111 SLC, UT 84151 US Domain Name: nijasvspirates.ORG Administrative Contact, Billing Contact: Smith, John jsmith@anonymous.net FooBar p.o.box 11111 SLC, UT 84151 555-555-6103 Technical Contact: Johnson, Ken kj@fierymonkey.org fierymonkey p.o.box 11111 SLC, UT 84151 555-555-3849 Record last updated on 17-Aug-2001. Record expires on 11-Aug-2002. Record created on 11-Aug-2000. Database last updated on 12-Dec-2001 04:06:00 EST. Domain servers in listed order: NS1. fierymonkey.ORG 192.173.28.130 NS2. fierymonkey.ORG 64.192.168.80 A corner stone of footprinting is Port Scanning. Let's port scan nijasvspirates.org and see what kind of services are running on that box. We type in the nijasvspirates IP into the Host prompt of the Port Scan window. We'll start searching from port number 1, and we'll stop at the default Sub7 port, 27374. Our results are: 21 TCP ftp 22 TCP ssh SSH-1.99-OpenSSH_2.30 25 TCP smtp 53 TCP domain 80 TCP www 110 TCP pop3 111 TCP sunrpc 113 TCP ident Just by this we know that Alice is running a website and email, using POP3, SUNRPC (SUN Remote Procedure Call), and ident."
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Request Footprinting: </b>The attacker examines the website information and source code of the website and uses automated tools to get as much information as possible about the system and organization.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Open Source Footprinting: Examine the website about the organization and skim through the webpage's HTML source to look for comments.</td></tr><tr><td>Network Enumeration: Perform various queries (Registrar Query, Organizational Query, Domain Query, Network Query, POC Query) on the many whois databases found on the internet to identify domain names and associated networks.</td></tr><tr><td>DNS Interrogation: Once basic information is gathered the attack could begin to query DNS.</td></tr><tr><td>Other Techniques: Use ping sweep, TCP scan, UDP scan, OS Identification various techniques to gain more information about the system and network.</td></tr></tbody></table></ol></div>",
            "x_capec_extended_description": "\n            <xhtml:p>Footprinting is a general term to describe a variety of information gathering techniques, often used by attackers in preparation for some attack. It consists of using tools to learn as much as possible about the composition, configuration, and security mechanisms of the targeted application, system or network. Information that might be collected during a footprinting effort could include open ports, applications and their versions, network topology, and similar information. Although similar to fingerprinting, footprinting aims to get a more holistic view of a system or network, whereas fingerprinting is more targeted to a specific application or operating system. While footprinting is not intended to be damaging (although certain activities, such as network scans, can sometimes cause disruptions to vulnerable applications inadvertently) it may often pave the way for more damaging attacks.</xhtml:p>\n         ",
            "x_capec_likelihood_of_attack": "High",
            "x_capec_parent_of_refs": [
                "attack-pattern--d780db94-413f-402d-a4d9-cf179b316c8c",
                "attack-pattern--9ca34308-a8e4-40b6-becd-3ff95bac628a",
                "attack-pattern--fd114e53-fdc0-4eef-8254-40ef0d4ea482",
                "attack-pattern--323ed142-7793-413d-838f-72626caf58da",
                "attack-pattern--6f7f4589-3abb-4aa8-ac80-1a6715d75a8b",
                "attack-pattern--b5b3a4ff-afa0-4a3a-9537-88ac953a41f7",
                "attack-pattern--6cfc4047-a0fb-42ac-bf94-226a21c40c80",
                "attack-pattern--6de257d8-e3b6-4654-85a7-a6fb37a94ccb",
                "attack-pattern--f95027a2-27e7-431f-b5c7-da9c46b05f71",
                "attack-pattern--3dfa08af-9677-4a4d-a3f0-a1c5042c9497",
                "attack-pattern--22a65c6a-9498-4e7f-a03a-030ab1c907dc",
                "attack-pattern--658d6220-f15c-44fb-8690-1d14088ed637",
                "attack-pattern--83f12d51-7469-4f09-99cc-fa4a3ea8197d"
            ],
            "x_capec_prerequisites": [
                "An application must publicize identifiable information about the system or application through voluntary or involuntary means. Certain identification details of information systems are visible on communication networks (e.g., if an adversary uses a sniffer to inspect the traffic) due to their inherent structure and protocol standards. Any system or network that can be detected can be footprinted. However, some configuration choices may limit the useful information that can be collected during a footprinting attack."
            ],
            "x_capec_resources_required": [
                "The adversary requires a variety of tools to collect information about the target. These include port/network scanners and tools to analyze responses from applications to determine version and configuration information. Footprinting a system adequately may also take a few days if the attacker wishes the footprinting attempt to go undetected."
            ],
            "x_capec_skills_required": {
                "Low": "The adversary knows how to send HTTP request, run the scan tool."
            },
            "x_capec_status": "Stable",
            "x_capec_typical_severity": "Very Low",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}