{
    "id": "bundle--a0787187-ea44-4eab-b58e-ea3015272393",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary introduces malicious hardware during an update or replacement procedure, allowing for additional compromise or site disruption at the victim location. After deployment, it is not uncommon for upgrades and replacements to occur involving hardware and various replaceable parts. These upgrades and replacements are intended to correct defects, provide additional features, and to replace broken or worn-out parts. However, by forcing or tricking the replacement of a good component with a defective or corrupted component, an adversary can leverage known defects to obtain a desired malicious impact.",
            "external_references": [
                {
                    "external_id": "CAPEC-534",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/534.html"
                },
                {
                    "description": "John F. Miller, Supply Chain Attack Framework and Attack Patterns, 2013, The MITRE Corporation",
                    "external_id": "REF-439",
                    "source_name": "reference_from_CAPEC",
                    "url": "http://www.mitre.org/sites/default/files/publications/supply-chain-attack-framework-14-0228.pdf"
                },
                {
                    "description": "Omer Shwartz, Amir Cohen, Asaf Shabtai, Yossi Oren, Shattered Trust: When Replacement Smartphone Components Attack, 11th USENIX Workshop on Offensive Technologies, 2017, USENIX",
                    "external_id": "REF-711",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://www.usenix.org/system/files/conference/woot17/woot17-paper-shwartz.pdf"
                }
            ],
            "id": "attack-pattern--a79f5cc6-781c-4e49-a00e-7aae93718f9e",
            "modified": "2022-02-22T00:00:00.000Z",
            "name": "Malicious Hardware Update",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Standard",
            "x_capec_child_of_refs": [
                "attack-pattern--7fd3928c-accb-4a35-ba64-000339399ede"
            ],
            "x_capec_domains": [
                "Supply Chain",
                "Physical Security",
                "Hardware"
            ],
            "x_capec_example_instances": [
                "An adversary develops a malicious networking card that allows for normal function plus the addition of malicious functionality that is of benefit to the adversary. The adversary sends the victim an email stating that the existing networking card is faulty, and that the victim can order a replacement card free of charge. The victim orders the card, and the adversary sends the malicious networking card. The malicious networking card replaces the perfectly-functioning original networking card, and the adversary is able to take advantage of the additional malicious functionality to further compromise the victim's network."
            ],
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_parent_of_refs": [
                "attack-pattern--fda936c1-236d-4460-a5a9-4555d9583b2e",
                "attack-pattern--ea2e5cbd-8278-4f8a-b56b-3cfb955d2366"
            ],
            "x_capec_skills_required": {
                "High": "Able to develop and manufacture malicious hardware components that perform the same functions and processes as their non-malicious counterparts."
            },
            "x_capec_status": "Stable",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}