{
    "id": "bundle--cf1c31b7-ff0e-4994-9f5c-8b777571d933",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "A domain name server translates a domain name (such as www.example.com) into an IP address that Internet hosts use to contact Internet resources. An adversary modifies a public DNS cache to cause certain names to resolve to incorrect addresses that the adversary specifies. The result is that client applications that rely upon the targeted cache for domain name resolution will be directed not to the actual address of the specified domain name but to some other address. Adversaries can use this to herd clients to sites that install malware on the victim's computer or to masquerade as part of a Pharming attack.",
            "external_references": [
                {
                    "external_id": "CAPEC-142",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/142.html"
                },
                {
                    "external_id": "CWE-348",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/348.html"
                },
                {
                    "external_id": "CWE-345",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/345.html"
                },
                {
                    "external_id": "CWE-349",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/349.html"
                },
                {
                    "external_id": "CWE-346",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/346.html"
                },
                {
                    "external_id": "CWE-350",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/350.html"
                },
                {
                    "description": "Compromise Infrastructure: DNS Server",
                    "external_id": "T1584.002",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1584/002"
                },
                {
                    "description": "Wikipedia, The Wikimedia Foundation, Inc",
                    "external_id": "REF-22",
                    "source_name": "reference_from_CAPEC",
                    "url": "http://en.wikipedia.org/wiki/DNS_cache_poisoning"
                },
                {
                    "description": "DNS Threats and DNS Weaknesses, DNSSEC",
                    "external_id": "REF-23",
                    "source_name": "reference_from_CAPEC",
                    "url": "http://www.dnssec.net/dns-threats.php"
                },
                {
                    "description": "Vulnerability Note VU#800113, 2008--07---08, US CERT",
                    "external_id": "REF-27",
                    "source_name": "reference_from_CAPEC",
                    "url": "http://www.kb.cert.org/vuls/id/800113#pat"
                }
            ],
            "id": "attack-pattern--ee604341-eb03-4b00-8188-26d6e999d6dc",
            "modified": "2022-09-29T00:00:00.000Z",
            "name": "DNS Cache Poisoning",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_can_precede_refs": [
                "attack-pattern--5dec633b-7b10-4bfe-9270-e68b98112285"
            ],
            "x_capec_child_of_refs": [
                "attack-pattern--e244a53a-8c69-462c-8ff2-900a839d48cb"
            ],
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_example_instances": [
                "\n               <xhtml:p>In this example, an adversary sends request to a local DNS server to look up www.example .com. The associated IP address of www.example.com is 1.3.5.7.</xhtml:p>\n               <xhtml:p>Local DNS usually caches IP addresses and do not go to remote DNS every time. Since the local record is not found, DNS server tries to connect to remote DNS for queries. However, before the remote DNS returns the right IP address 1.3.5.7, the adversary floods local DNS with crafted responses with IP address 2.4.6.8. The result is that 2.4.6.8 is stored in DNS cache. Meanwhile, 2.4.6.8 is associated with a malicious website www.maliciousexampsle.com</xhtml:p>\n               <xhtml:p>When users connect to www.example.com, the local DNS will direct it to www.maliciousexample.com, this works as part of a Pharming attack.</xhtml:p>\n            "
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Explore resolver caches: </b>Check DNS caches on local DNS server and client's browser with DNS cache enabled.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Run tools that check the resolver cache in the memory to see if it contains a target DNS entry.</td></tr><tr><td>Figure out if the client's browser has DNS cache enabled.</td></tr></tbody></table></ol></div><div><h3>Experiment</h3><ol><li> <p> <b>Attempt sending crafted records to DNS cache: </b>A request is sent to the authoritative server for target website and wait for the iterative name resolver. An adversary sends bogus request to the DNS local server, and then floods responses that trick a DNS cache to remember malicious responses, which are wrong answers of DNS query.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Adversary must know the transaction ID by intercepting a DNS query, or sending a bogus query with known transaction ID.</td></tr><tr><td>If the transaction ID used to identify each query instance is randomized in some new DNS software, the attack must guess the transaction ID. Slow the response of the real DNS server by causing Denial-of-service. This gives adversaries enough time to guess transaction</td></tr><tr><td>Adversary crafts DNS response with the same transaction ID as in the request. The adversary sends out DNS responses before the authorized DNS server. This forces DNS local cache stores fake DNS response (wrong answer). The fake DNS responses usually include a malicious website's IP address.</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Redirect users to malicious website: </b>As the adversary succeeds in exploiting the vulnerability, the victim connects to a malicious site using a good web site's domain name.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Redirecting Web traffic to a site that looks enough like the original so as to not raise any suspicion.</td></tr><tr><td>Adversary-in-the-Middle (CAPEC-94) intercepts secure communication between two parties.</td></tr></tbody></table></ol></div>",
            "x_capec_likelihood_of_attack": "High",
            "x_capec_prerequisites": [
                "A DNS cache must be vulnerable to some attack that allows the adversary to replace addresses in its lookup table.Client applications must trust the corrupted cashed values and utilize them for their domain name resolutions."
            ],
            "x_capec_resources_required": [
                "The adversary must have the resources to modify the targeted cache. In addition, in most cases the adversary will wish to host the sites to which users will be redirected, although in some cases redirecting to a third party site will accomplish the adversary's goals."
            ],
            "x_capec_skills_required": {
                "Medium": "To overwrite/modify targeted DNS cache"
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}