{
    "id": "bundle--5b4ad572-cd01-410d-ba98-da23cde3e0bb",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An attacker forces the target into a previous state in order to leverage potential weaknesses in the target dependent upon a prior configuration or state-dependent factors. Even in cases where an attacker may not be able to directly control the configuration of the targeted application, they may be able to reset the configuration to a prior state since many applications implement reset functions.",
            "external_references": [
                {
                    "external_id": "CAPEC-166",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/166.html"
                },
                {
                    "external_id": "CWE-306",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/306.html"
                },
                {
                    "external_id": "CWE-1221",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/1221.html"
                },
                {
                    "external_id": "CWE-1232",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/1232.html"
                }
            ],
            "id": "attack-pattern--151ca16b-5acc-45db-bde8-19d204542a54",
            "modified": "2022-02-22T00:00:00.000Z",
            "name": "Force the System to Reset Values",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Standard",
            "x_capec_child_of_refs": [
                "attack-pattern--2a6131f7-30af-4529-be4e-bc3b7bf22009"
            ],
            "x_capec_domains": [
                "Software",
                "Hardware"
            ],
            "x_capec_extended_description": "\n            <xhtml:p>Since these functions are usually intended as emergency features to return an application to a stable configuration if the current configuration degrades functionality, they may not be as strongly secured as other configuration options. The resetting of values is dangerous as it may enable undesired functionality, disable services, or modify access controls. At the very least this is a nuisance attack since the administrator will need to re-apply their configuration. At worst, this attack can open avenues for powerful attacks against the application, and, if it isn't obvious that the configuration has been reset, these vulnerabilities may be present a long time before they are notices.</xhtml:p>\n         ",
            "x_capec_prerequisites": [
                "The targeted application must have a reset function that returns the configuration of the application to an earlier state.",
                "The reset functionality must be inadequately protected against use."
            ],
            "x_capec_resources_required": [
                "None: No specialized resources are required to execute this type of attack. In some cases, the attacker may need special client applications in order to execute the reset functionality."
            ],
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Medium",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}