{
    "id": "bundle--d838c518-b82f-404e-a39a-1bbf63e05d71",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An attacker attempts to invoke all common switches and options in the target application for the purpose of discovering weaknesses in the target. For example, in some applications, adding a --debug switch causes debugging information to be displayed, which can sometimes reveal sensitive processing or configuration information to an attacker. This attack differs from other forms of API abuse in that the attacker is indiscriminately attempting to invoke options in the hope that one of them will work rather than specifically targeting a known option. Nonetheless, even if the attacker is familiar with the published options of a targeted application this attack method may still be fruitful as it might discover unpublicized functionality.",
            "external_references": [
                {
                    "external_id": "CAPEC-133",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/133.html"
                },
                {
                    "external_id": "CWE-912",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/912.html"
                }
            ],
            "id": "attack-pattern--a0fc32ad-ef32-44d5-9937-5968f5e7b78c",
            "modified": "2021-10-21T00:00:00.000Z",
            "name": "Try All Common Switches",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Standard",
            "x_capec_child_of_refs": [
                "attack-pattern--f4186110-0c20-42fa-bc6f-d0ff9f700f91"
            ],
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Identify application: </b>Discover an application of interest by exploring service registry listings or by connecting on a known port or some similar means.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Search via internet for known, published applications that allow option switches.</td></tr><tr><td>Use automated tools to scan known ports to identify applications that might be accessible</td></tr></tbody></table><li> <p> <b>Authenticate to application: </b>Authenticate to the application, if required, in order to explore it.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Use published credentials to access system.</td></tr><tr><td>Find unpublished credentails to access service.</td></tr><tr><td>Use other attack pattern or weakness to bypass authentication.</td></tr></tbody></table></ol></div><div><h3>Experiment</h3><ol><li> <p> <b>Try all common switches: </b>Using manual or automated means, attempt to run the application with many different known common switches. Observe the output to see if any switches seemed to put the application in a non production mode that might give more information.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Manually execute the application with switches such as --debug, --test, --development, --verbose, etc.</td></tr><tr><td>Use automated tools to run the application with common switches and observe the output</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Use sensitive processing or configuration information: </b>Once extra information is observed from an application through the use of a common switch, this information is used to aid other attacks on the application</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Using application information, formulate an attack on the application</td></tr></tbody></table></ol></div>",
            "x_capec_prerequisites": [
                "The attacker must be able to control the options or switches sent to the target."
            ],
            "x_capec_resources_required": [
                "None: No specialized resources are required to execute this type of attack. The only requirement is the ability to send requests to the target."
            ],
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Medium",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}