{
    "id": "bundle--21910835-ca9c-4448-bb1e-954e351df0ad",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary, through a previously installed malicious application, intercepts messages from a trusted Android-based application in an attempt to achieve a variety of different objectives including denial of service, information disclosure, and data injection. An implicit intent sent from a trusted application can be received by any application that has declared an appropriate intent filter. If the intent is not protected by a permission that the malicious application lacks, then the attacker can gain access to the data contained within the intent. Further, the intent can be either blocked from reaching the intended destination, or modified and potentially forwarded along.",
            "external_references": [
                {
                    "external_id": "CAPEC-499",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/499.html"
                },
                {
                    "external_id": "CWE-925",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/925.html"
                },
                {
                    "description": "Erika Chin, Adrienne Porter Felt, Kate Greenwood, David Wagner, Analyzing Inter-Application Communication in Android, 2011, International Conference on Mobile Systems, Applications, and Services (MobiSys)",
                    "external_id": "REF-427",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://people.eecs.berkeley.edu/~daw/papers/intents-mobisys11.pdf"
                }
            ],
            "id": "attack-pattern--48f21dcd-2490-49c6-9690-1cb586b201f4",
            "modified": "2021-10-21T00:00:00.000Z",
            "name": "Android Intent Intercept",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Standard",
            "x_capec_child_of_refs": [
                "attack-pattern--bdc2219a-ebe0-4372-90b8-841dd7bd4c8e"
            ],
            "x_capec_consequences": {
                "Availability": [
                    "Resource Consumption"
                ],
                "Confidentiality": [
                    "Read Data"
                ],
                "Integrity": [
                    "Modify Data"
                ]
            },
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Find an android application that uses implicit intents: </b>Since this attack only works on android applications that use implicit intents, rather than explicit intents, an adversary must first identify an app that uses implicit intents. They must also determine what the contents of the intents being sent are such that a malicious application can get sent these intents.</p></li></ol></div><div><h3>Experiment</h3><ol><li> <p> <b>Create a malicious app: </b>The adversary must create a malicious android app meant to intercept implicit intents from a target application</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Specify the type of intent wished to be intercepted in the malicious app's manifest file using an intent filter</td></tr></tbody></table><li> <p> <b>Get user to download malicious app: </b>The adversary must get a user using the targeted app to download the malicious app by any means necessary</p></li></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Intercept Implicit Intents: </b>Once the malicious app is downloaded, the android device will forward any implicit intents from the target application to the malicious application, allowing the adversary to gaina access to the contents of the intent. The adversary can proceed with any attack using the contents of the intent.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Block the intent from reaching the desired location, causing a denial of service</td></tr><tr><td>Gather sensitive information from the intercepted intent</td></tr><tr><td>Modify the contents of the intent and forward along to another application</td></tr></tbody></table></ol></div>",
            "x_capec_parent_of_refs": [
                "attack-pattern--10ce28bf-9f93-4a45-a39e-6407141a34d4"
            ],
            "x_capec_prerequisites": [
                "An adversary must be able install a purpose built malicious application onto the Android device and convince the user to execute it. The malicious application is used to intercept implicit intents."
            ],
            "x_capec_status": "Draft",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}