{
    "id": "bundle--527c9bc4-2db9-463b-a73c-96a4ce2b9100",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary removes or disables functionality on the client that the server assumes to be present and trustworthy.",
            "external_references": [
                {
                    "external_id": "CAPEC-207",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/207.html"
                },
                {
                    "external_id": "CWE-602",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/602.html"
                },
                {
                    "description": "Wikipedia, The Wikimedia Foundation, Inc",
                    "external_id": "REF-75",
                    "source_name": "reference_from_CAPEC",
                    "url": "http://en.wikipedia.org/wiki/Greasemonkey"
                },
                {
                    "description": "Firebug",
                    "external_id": "REF-76",
                    "source_name": "reference_from_CAPEC",
                    "url": "http://getfirebug.com/"
                },
                {
                    "description": "Mozilla Firefox Add-ons",
                    "external_id": "REF-77",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://addons.mozilla.org/en-US/firefox/addon/greasemonkey/"
                }
            ],
            "id": "attack-pattern--3c404955-b160-423f-b148-d4fa4727e3a9",
            "modified": "2023-01-24T00:00:00.000Z",
            "name": "Removing Important Client Functionality",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Standard",
            "x_capec_child_of_refs": [
                "attack-pattern--1fa1539d-4a13-4453-bf43-ad0987b2fbf5"
            ],
            "x_capec_consequences": {
                "Access_Control": [
                    "Bypass Protection Mechanism"
                ],
                "Accountability": [
                    "Gain Privileges"
                ],
                "Authentication": [
                    "Gain Privileges"
                ],
                "Authorization": [
                    "Gain Privileges",
                    "Bypass Protection Mechanism"
                ],
                "Confidentiality": [
                    "Other (Information Leakage)",
                    "Read Data"
                ],
                "Integrity": [
                    "Modify Data"
                ],
                "Non-Repudiation": [
                    "Gain Privileges"
                ]
            },
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_example_instances": [
                "The adversary reverse engineers a Java binary (by decompiling it) and identifies where license management code exists. Noticing that the license manager returns TRUE or FALSE as to whether or not the user is licensed, the adversary simply overwrites both branch targets to return TRUE, recompiles, and finally redeploys the binary.",
                "The adversary uses click-through exploration of a Servlet-based website to map out its functionality, taking note of its URL-naming conventions and Servlet mappings. Using this knowledge and guessing the Servlet name of functionality they're not authorized to use, the adversary directly navigates to the privileged functionality around the authorizing single-front controller (implementing programmatic authorization checks)."
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Probing: </b>The adversary probes, through brute-forcing, reverse-engineering or other similar means, the functionality on the client that server assumes to be present and trustworthy.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>The adversary probes by exploring an application's functionality and its underlying mapping to server-side components.</td></tr><tr><td>The adversary reverse engineers client-side code to identify the functionality that the server relies on for the proper or secure operation.</td></tr></tbody></table></ol></div><div><h3>Experiment</h3><ol><li> <p> <b>Determine which functionality to disable or remove: </b>The adversary tries to determine which functionality to disable or remove through reverse-engineering from the list of functionality identified in the Explore phase.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>The adversary reverse engineers the client-side code to determine which functionality to disable or remove.</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Disable or remove the critical functionality from the client code: </b>Once the functionality has been determined, the adversary disables or removes the critical functionality from the client code to perform malicious actions that the server believes are prohibited.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>The adversary disables or removes the functionality from the client-side code to perform malicious actions, such as sending of dangerous content (such as scripts) to the server.</td></tr></tbody></table></ol></div>",
            "x_capec_extended_description": "\n            <xhtml:p>Adversaries can, in some cases, get around logic put in place to 'guard' sensitive functionality or data. Client applications may include functionality that a server relies on for correct and secure operation. This functionality can include, but is not limited to, filters to prevent the sending of dangerous content to the server, logical functionality such as price calculations, and authentication logic to ensure that only authorized users are utilizing the client. If an adversary can disable this functionality on the client, they can perform actions that the server believes are prohibited. This can result in client behavior that violates assumptions by the server leading to a variety of possible attacks. In the above examples, this could include the sending of dangerous content (such as scripts) to the server, incorrect price calculations, or unauthorized access to server resources.</xhtml:p>\n         ",
            "x_capec_likelihood_of_attack": "Medium",
            "x_capec_parent_of_refs": [
                "attack-pattern--5c201b0f-aa6f-4220-a544-1e1e7ca8ecf7",
                "attack-pattern--014e5fc2-7564-4775-94aa-220601522b05"
            ],
            "x_capec_prerequisites": [
                "The targeted server must assume the client performs important actions to protect the server or the server functionality. For example, the server may assume the client filters outbound traffic or that the client performs all price calculations correctly. Moreover, the server must fail to detect when these assumptions are violated by a client."
            ],
            "x_capec_resources_required": [
                "The adversary must have access to a client and be able to modify the client behavior, often through reverse engineering. If the server is assuming specific client functionality, this usually means the server only recognizes a specific client application, rather than a broad class of client applications. Reverse engineering tools would likely be necessary."
            ],
            "x_capec_skills_required": {
                "High": "To reverse engineer the client-side code to disable/remove the functionality on the client that the server relies on.",
                "Low": "The adversary installs a web tool that allows scripts or the DOM model of web-based applications to be modified before they are executed in a browser. GreaseMonkey and Firebug are two examples of such tools."
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}