{
    "id": "bundle--cbdfa238-38c2-450f-83a6-6e56fa2e3a0f",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "This attack exploits certain serialized data parsers (e.g., XML, YAML, etc.) which manage data in an inefficient manner. The attacker crafts an serialized data file with multiple configuration parameters in the same dataset. In a vulnerable parser, this results in a denial of service condition where CPU resources are exhausted because of the parsing algorithm. The weakness being exploited is tied to parser implementation and not language specific.",
            "external_references": [
                {
                    "external_id": "CAPEC-229",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/229.html"
                },
                {
                    "external_id": "CWE-770",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/770.html"
                },
                {
                    "description": "XML Attribute Blowup",
                    "external_id": "41",
                    "source_name": "WASC",
                    "url": "http://projects.webappsec.org/XML-Attribute-Blowup"
                }
            ],
            "id": "attack-pattern--da41d572-d779-44a8-b8bf-530f49c32861",
            "modified": "2022-09-29T00:00:00.000Z",
            "name": "Serialized Data Parameter Blowup",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_child_of_refs": [
                "attack-pattern--247019da-353e-4910-9d11-7dc6c0421a17"
            ],
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_example_instances": [
                "\n               <xhtml:p>In this example, assume that the victim is running a vulnerable parser such as .NET framework 1.0. This results in a quadratic runtime of O(n^2).</xhtml:p>\n               <xhtml:div style=\"margin-left:1em;\" class=\"informative\"><?xml version=\"1.0\"?><fooaaa=\"\"ZZZ=\"\"...999=\"\"/></xhtml:div>\n               <xhtml:p>A document with n attributes results in (n^2)/2 operations to be performed. If an operation takes 100 nanoseconds then a document with 100,000 operations would take 500s to process. In this fashion a small message of less than 1MB causes a denial of service condition on the CPU resources.</xhtml:p>\n            ",
                "\n               <xhtml:p>A YAML bomb leverages references within a YAML file to create exponential growth in memory requirements. By creating a chain of keys whose values are a list of multiple references to the next key in the chain, the amount of memory and processing required to handle the data grows exponentially. This may lead to denial of service or instability resulting from excessive resource consumption.</xhtml:p>\n            "
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Survey the target: </b>Using a browser or an automated tool, an attacker records all instances of web services to process requests using serialized data.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Use an automated tool to record all instances of URLs to process requests from serialized data.</td></tr><tr><td>Use a browser to manually explore the website and analyze how the application processes requests using serialized data.</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Launch a Blowup attack: </b>The attacker crafts malicious messages that contain multiple configuration parameters in the same dataset.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Send the malicious crafted message containing the multiple configuration parameters to the target URL, causing a denial of service.</td></tr></tbody></table></ol></div>",
            "x_capec_likelihood_of_attack": "High",
            "x_capec_prerequisites": [
                "The server accepts input in the form of serialized data and is using a parser with a runtime longer than O(n) for the insertion of a new configuration parameter in the data container.(examples are .NET framework 1.0 and 1.1)"
            ],
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}