{
    "id": "bundle--bc8f8b0f-db2d-4666-b7a9-0886e6d77a57",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "In circumstances where an application holds important data client-side in tokens (cookies, URLs, data files, and so forth) that data can be manipulated. If client or server-side application components reinterpret that data as authentication tokens or data (such as store item pricing or wallet information) then even opaquely manipulating that data may bear fruit for an Attacker. In this pattern an attacker undermines the assumption that client side tokens have been adequately protected from tampering through use of encryption or obfuscation.",
            "external_references": [
                {
                    "external_id": "CAPEC-39",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/39.html"
                },
                {
                    "external_id": "CWE-353",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/353.html"
                },
                {
                    "external_id": "CWE-285",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/285.html"
                },
                {
                    "external_id": "CWE-302",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/302.html"
                },
                {
                    "external_id": "CWE-472",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/472.html"
                },
                {
                    "external_id": "CWE-565",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/565.html"
                },
                {
                    "external_id": "CWE-315",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/315.html"
                },
                {
                    "external_id": "CWE-539",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/539.html"
                },
                {
                    "external_id": "CWE-384",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/384.html"
                },
                {
                    "external_id": "CWE-233",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/233.html"
                }
            ],
            "id": "attack-pattern--9afead03-280c-4f2c-82f6-b08b7a54a8e3",
            "modified": "2020-07-30T00:00:00.000Z",
            "name": "Manipulating Opaque Client-based Data Tokens",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Standard",
            "x_capec_child_of_refs": [
                "attack-pattern--1fa1539d-4a13-4453-bf43-ad0987b2fbf5"
            ],
            "x_capec_consequences": {
                "Access_Control": [
                    "Gain Privileges"
                ],
                "Authorization": [
                    "Gain Privileges"
                ],
                "Confidentiality": [
                    "Gain Privileges"
                ],
                "Integrity": [
                    "Modify Data"
                ]
            },
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_example_instances": [
                "With certain price watching websites, that aggregate products available prices, the user can buy items through whichever vendors has product availability, the best price, or other differentiator. Once a user selects an item, the site must broker the purchase of that item with the vendor. Because vendors sell the same product through different channel partners at different prices, token exchange between price watching sites and selling vendors will often contain pricing information. With some price watching sites, manipulating URL-data (which is encrypted) even opaquely yields different prices charged by the fulfilling vendor. If the manipulated price turns out higher, the Attacker can cancel purchase. If the Attacker succeeded in manipulating the token and creating a lower price, they proceed.",
                "Upon successful authentication user is granted an encrypted authentication cookie by the server and it is stored on the client. One piece of information stored in the authentication cookie reflects the access level of the user (e.g. \"u\" for user). The authentication cookie is encrypted using the Electronic Code Book (ECB) mode, that naively encrypts each of the plaintext blocks to each of the ciphertext blocks separately. An attacker knows the structure of the cookie and can figure out what bits (encrypted) store the information relating to the access level of the user. An attacker modifies the authentication cookie and effectively substitutes \"u\" for \"a\" by flipping some of the corresponding bits of ciphertext (trial and error). Once the correct \"flip\" is found, when the system is accessed, the attacker is granted administrative privileges in the system. Note that in this case an attacker did not have to figure out the exact encryption algorithm or find the secret key, but merely exploit the weakness inherent in using the ECB encryption mode.",
                "Archangel Weblog 0.90.02 allows remote attackers to bypass authentication by setting the ba_admin cookie to 1. See also: CVE-2006-0944"
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Enumerate information passed to client side: </b>The attacker identifies the parameters used as part of tokens to take business or security decisions</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Use WebScarab to reveal hidden fields while browsing.</td></tr><tr><td>Use a sniffer to capture packets</td></tr><tr><td>View source of web page to find hidden fields</td></tr><tr><td>Examine URL to see if any opaque tokens are in it</td></tr><tr><td>Disassemble or decompile client-side application</td></tr><tr><td>Use debugging tools such as File Monitor, Registry Monitor, Debuggers, etc.</td></tr></tbody></table><li> <p> <b>Determine protection mechanism for opaque token: </b>The attacker determines the protection mechanism used to protect the confidentiality and integrity of these data tokens. They may be obfuscated or a full blown encryption may be used.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Look for signs of well-known character encodings</td></tr><tr><td>Look for cryptographic signatures</td></tr><tr><td>Look for delimiters or other indicators of structure</td></tr></tbody></table></ol></div><div><h3>Experiment</h3><ol><li> <p> <b>Modify parameter/token values: </b>Trying each parameter in turn, the attacker modifies the values</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Modify tokens logically</td></tr><tr><td>Modify tokens arithmetically</td></tr><tr><td>Modify tokens bitwise</td></tr><tr><td>Modify structural components of tokens</td></tr><tr><td>Modify order of parameters/tokens</td></tr></tbody></table><li> <p> <b>Cycle through values for each parameter.: </b>Depending on the nature of the application, the attacker now cycles through values of each parameter and observes the effects of this modification in the data returned by the server</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Use network-level packet injection tools such as netcat</td></tr><tr><td>Use application-level data modification tools such as Tamper Data, WebScarab, TamperIE, etc.</td></tr><tr><td>Use modified client (modified by reverse engineering)</td></tr><tr><td>Use debugging tools to modify data in client</td></tr></tbody></table></ol></div>",
            "x_capec_likelihood_of_attack": "High",
            "x_capec_parent_of_refs": [
                "attack-pattern--cddb7bce-8d94-4eea-8e73-9f6ef66376c2"
            ],
            "x_capec_prerequisites": [
                "An attacker already has some access to the system or can steal the client based data tokens from another user who has access to the system.",
                "For an Attacker to viably execute this attack, some data (later interpreted by the application) must be held client-side in a way that can be manipulated without detection. This means that the data or tokens are not CRCd as part of their value or through a separate meta-data store elsewhere."
            ],
            "x_capec_resources_required": [
                "The Attacker needs no special hardware-based resources in order to conduct this attack. Software plugins, such as Tamper Data for Firefox, may help in manipulating URL- or cookie-based data."
            ],
            "x_capec_skills_required": {
                "High": "If the client site token is encrypted.",
                "Medium": "If the client site token is obfuscated."
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Medium",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}