{
    "id": "bundle--df8f7ad5-1c52-4bec-a294-3894f3a8f907",
    "objects": [
        {
            "created": "2022-09-29T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "\n            <xhtml:p>An adversary directly installs or tricks a user into installing a malicious extension into existing trusted software, with the goal of achieving a variety of negative technical impacts.</xhtml:p>\n         ",
            "external_references": [
                {
                    "external_id": "CAPEC-698",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/698.html"
                },
                {
                    "external_id": "CWE-507",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/507.html"
                },
                {
                    "external_id": "CWE-829",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/829.html"
                },
                {
                    "description": "Browser Extensions",
                    "external_id": "T1176",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1176"
                },
                {
                    "description": "Server Software Component: IIS Components",
                    "external_id": "T1505.004",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1505/004"
                },
                {
                    "description": "Robert Falcone, OilRig uses RGDoor IIS Backdoor on Targets in the Middle East, 2018--01---25, Palo Alto Networks",
                    "external_id": "REF-740",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://unit42.paloaltonetworks.com/unit42-oilrig-uses-rgdoor-iis-backdoor-targets-middle-east/"
                },
                {
                    "description": "ASERT Team, STOLEN PENCIL Campaign Targets Academia, 2018--12---05, NETSCOUT",
                    "external_id": "REF-741",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://www.netscout.com/blog/asert/stolen-pencil-campaign-targets-academia"
                }
            ],
            "id": "attack-pattern--c253fd5b-9ae6-4f42-868a-52b25b7dd1f4",
            "modified": "2022-09-29T00:00:00.000Z",
            "name": "Install Malicious Extension",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_child_of_refs": [
                "attack-pattern--482cb9fc-0122-49f0-b6df-6d2d42098b0a"
            ],
            "x_capec_consequences": {
                "Access_Control": [
                    "Execute Unauthorized Commands",
                    "Alter Execution Logic",
                    "Gain Privileges"
                ],
                "Authorization": [
                    "Execute Unauthorized Commands",
                    "Alter Execution Logic",
                    "Gain Privileges"
                ],
                "Confidentiality": [
                    "Read Data"
                ],
                "Integrity": [
                    "Modify Data"
                ]
            },
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_example_instances": [
                "\n               <xhtml:p>In January 2018, Palo Alto's Unit 42 reported that a malicious Internet Information Services (IIS) extension they named RGDoor was used to create a backdoor into several Middle Eastern government organizations, as well as a financial institution and an educational institution. This malware was used in conjunction with the TwoFace webshell and allowed the adversaries to upload/download files and execute unauthorized commands. [REF-740]</xhtml:p>\n            ",
                "\n               <xhtml:p>In December 2018, it was reported that North Korea-based APT Kimusky (also known as Velvet Chollima) infected numerous legitimate academic organizations within the U.S., many specializing in biomedical engineering, with a malicious Google Chrome extension. Dubbed \"Operation STOLEN PENCIL\", the attack entailed conducting spear-phishing attacks to trick victims into installing a malicious PDF reader named \"Auto Font Manager\". Once installed, the malware allowed adversaries to steal cookies and site passwords, as well as forward emails from some compromised accounts. [REF-741]</xhtml:p>\n            "
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Identify target(s): </b>The adversary must first identify target software that allows for extensions/plugins and which they wish to exploit, such as a web browser or desktop application. To increase the attack space, this will often be popular software with a large user-base.</p></li></ol></div><div><h3>Experiment</h3><ol><li> <p> <b>Create malicious extension: </b>Having identified a suitable target, the adversary crafts a malicious extension/plugin that can be installed by the underlying target software. This malware may be targeted to execute on specific operating systems or be operating system agnostic.</p></li></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Install malicious extension: </b>The malicious extension/plugin is installed by the underlying target software and executes the adversary-created malware, resulting in a variety of negative technical impacts.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Adversary-Installed: Having already compromised the target system, the adversary simply installs the malicious extension/plugin themself.</td></tr><tr><td>User-Installed: The adversary tricks the user into installing the malicious extension/plugin, via means such as social engineering, or may upload the malware on a reputable extension/plugin hosting site and wait for unknowing victims to install the malicious component.</td></tr></tbody></table></ol></div>",
            "x_capec_extended_description": "\n            <xhtml:p>Many software applications allow users to install third-party software extensions/plugins that provide additional features and functionality. Adversaries can take advantage of this behavior to install malware on a system with relative ease. This may require the adversary compromising a system and then installing the malicious extension themself. An alternate approach entails masquerading the malicious extension as a legitimate extension. The adversary then convinces users to install the malicious component, via means such as social engineering, or simply waits for victims to unknowingly install the malware on their systems. Once the malicious extension has been installed, the adversary can achieve a variety of negative technical impacts such as obtaining sensitive information, executing unauthorized commands, observing/modifying network traffic, and more.</xhtml:p>\n         ",
            "x_capec_likelihood_of_attack": "Medium",
            "x_capec_prerequisites": [
                "The adversary must craft malware based on the type of software and system(s) they intend to exploit.",
                "If the adversary intends to install the malicious extension themself, they must first compromise the target machine via some other means."
            ],
            "x_capec_skills_required": {
                "Medium": "Optional: Ability to exploit target system(s) via other means in order to gain entry."
            },
            "x_capec_status": "Stable",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}