{
    "id": "bundle--8e708db7-5fae-4437-a77d-553c22038e3f",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An attacker harvests identifying information about a victim via an active session that the victim's browser has with a social networking site. A victim may have the social networking site open in one tab or perhaps is simply using the \"remember me\" feature to keep their session with the social networking site active. An attacker induces a payload to execute in the victim's browser that transparently to the victim initiates a request to the social networking site (e.g., via available social network site APIs) to retrieve identifying information about a victim. While some of this information may be public, the attacker is able to harvest this information in context and may use it for further attacks on the user (e.g., spear phishing).",
            "external_references": [
                {
                    "external_id": "CAPEC-467",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/467.html"
                },
                {
                    "external_id": "CWE-352",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/352.html"
                },
                {
                    "external_id": "CWE-359",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/359.html"
                },
                {
                    "description": "Ronen, Cross Site Identification - or - How your social network might expose you when you least expect it, 2009--12---27",
                    "external_id": "REF-404",
                    "source_name": "reference_from_CAPEC",
                    "url": "http://blog.quaji.com/2009/12/out-of-context-information-disclosure.html"
                }
            ],
            "id": "attack-pattern--c50d5a35-0010-422d-b6f7-d4b963c9bad4",
            "modified": "2022-02-22T00:00:00.000Z",
            "name": "Cross Site Identification",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_child_of_refs": [
                "attack-pattern--0939f361-ea31-454b-ae3d-4af2411b756d"
            ],
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_example_instances": [
                "An attacker may post a malicious posting that contains an image with an embedded link. The link actually requests identifying information from the social networking site. A victim who views the malicious posting in their browser will have sent identifying information to the attacker, as long as the victim had an active session with the social networking site."
            ],
            "x_capec_extended_description": "\n            <xhtml:p>There are many other ways in which the attacker may get the payload to execute in the victim's browser mainly by finding a way to hide it in some reputable site that the victim visits. The attacker could also send the link to the victim in an e-mail and trick the victim into clicking on the link. This attack is basically a cross site request forgery attack with two main differences. First, there is no action that is performed on behalf of the user aside from harvesting information. So standard CSRF protection may not work in this situation. Second, what is important in this attack pattern is the nature of the data being harvested, which is identifying information that can be obtained and used in context. This real time harvesting of identifying information can be used as a prelude for launching real time targeted social engineering attacks on the victim.</xhtml:p>\n         ",
            "x_capec_prerequisites": [
                "The victim has an active session with the social networking site."
            ],
            "x_capec_skills_required": {
                "High": "An attacker should be able to create a payload and deliver it to the victim's browser.",
                "Medium": "An attacker needs to know how to interact with various social networking sites (e.g., via available APIs) to request information and how to send the harvested data back to the attacker."
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Low",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}