{
    "id": "bundle--a48ef11c-e5a4-47c1-a10f-ec909efbc56b",
    "objects": [
        {
            "created": "2022-09-29T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary may exploit vulnerable code (i.e., firmware or ROM) that is unpatchable. Unpatchable devices exist due to manufacturers intentionally or inadvertently designing devices incapable of updating their software. Additionally, with updatable devices, the manufacturer may decide not to support the device and stop making updates to their software.",
            "external_references": [
                {
                    "external_id": "CAPEC-682",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/682.html"
                },
                {
                    "external_id": "CWE-1277",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/1277.html"
                },
                {
                    "external_id": "CWE-1310",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/1310.html"
                },
                {
                    "description": "Alex Scroxton, Alarm bells ring, the IoT is listening, 2019--12---13, TechTarget",
                    "external_id": "REF-723",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://www.computerweekly.com/news/252475324/Alarm-bells-ring-the-IoT-is-listening"
                },
                {
                    "description": "Matthew Hughes, Bad news: KeyWe Smart Lock is easily bypassed and can't be fixed, 2019--12---11, Situation Publishing",
                    "external_id": "REF-724",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://www.theregister.com/2019/12/11/f_secure_keywe/"
                },
                {
                    "description": "Brian Krebs, Zyxel Flaw Powers New Mirai IoT Botnet Strain, 2020--03---20, Krebs on Security",
                    "external_id": "REF-725",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://krebsonsecurity.com/2020/03/zxyel-flaw-powers-new-mirai-iot-botnet-strain/"
                },
                {
                    "description": "Colin Schulz, Stefan Raff, Sebastian Kortmann, Nikolaus Obwegeser, Digital Age Organizations: Uncovering Over-the-Air Updates in the Smart Product Realm, 2021--12, International Conference on Information Systems (ICIS) 2021",
                    "external_id": "REF-726",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://www.researchgate.net/publication/356065917_Digital_Age_Organizations_Uncovering_Over-the-Air_Updates_in_the_Smart_Product_Realm"
                }
            ],
            "id": "attack-pattern--01a08342-5c58-4f61-b8e1-997e444b3a59",
            "modified": "2022-09-29T00:00:00.000Z",
            "name": "Exploitation of Firmware or ROM Code with Unpatchable Vulnerabilities",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Standard",
            "x_capec_child_of_refs": [
                "attack-pattern--c727c058-2c9d-4021-a1ec-81dd030dea59"
            ],
            "x_capec_consequences": {
                "Access_Control": [
                    "Gain Privileges"
                ],
                "Authorization": [
                    "Gain Privileges"
                ],
                "Confidentiality": [
                    "Read Data"
                ],
                "Integrity": [
                    "Modify Data"
                ]
            },
            "x_capec_domains": [
                "Software",
                "Hardware"
            ],
            "x_capec_example_instances": [
                "\n               <xhtml:p>An IoT company comes out with a line of smart products for home use such as home cameras, vacuums, and smart bulbs. The products become popular, and millions of consumers install these devices in their homes. All the devices use a custom module for encryption that is stored on a ROM chip, which is immutable memory and can't be changed. An adversary discovers that there is a vulnerability in the encryption module code that allows authentication bypass, gaining access to any device. The adversary then develops botnet code that is remotely downloaded onto the infected devices. This code scans the internet for nearby devices from the same product line and exploits the vulnerability, loading the botnet code onto these new devices. Over time, the adversary now has a botnet of devices that can carry out malicious activity such as a DDoS attacks. Once the vulnerability is found, it is impossible to remediate because the vulnerable code is unable to be updated.</xhtml:p>\n            ",
                "\n               <xhtml:p>Older smartphones can become out of date and manufacturers may stop putting out security updates as they focus on newer models. If an adversary discovers a vulnerability in an old smartphone there is a chance that a security update will not be made to mitigate it. This leaves anyone using the old smartphone vulnerable.</xhtml:p>\n            "
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Determine vulnerable firmware or ROM code: </b>An adversary will attempt to find device models that are known to have unpatchable firmware or ROM code, or are deemed “end-of-support” where a patch will not be made. The adversary looks for vulnerabilities in firmware or ROM code for the identified devices, or looks for devices which have known vulnerabilities</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Many botnets use wireless scanning to discover nearby devices that might have default credentials or commonly used passwords. Once these devices are infected, they can search for other nearby devices and so on.</td></tr></tbody></table></ol></div><div><h3>Experiment</h3><ol><li> <p> <b>Determine plan of attack: </b>An adversary identifies a specific device/model that they wish to attack. They will also investigate similar devices to determine if the vulnerable firmware or ROM code is also present.</p></li></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Carry out attack: </b>An adversary exploits the vulnerable firmware or ROM code on the identified device(s) to achieve their desired goal.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Install malware on a device to recruit it for a botnet.</td></tr><tr><td>Install malware on the device and use it for a ransomware attack.</td></tr><tr><td>Gain root access and steal information stored on the device.</td></tr><tr><td>Manipulate the device to behave in unexpected ways which would benefit the adversary.</td></tr></tbody></table></ol></div>",
            "x_capec_extended_description": "When a vulnerability is found in a device that has no means of patching, the attack may be used against an entire class of devices. Devices from the same manufacturer often use similar or identical firmware, which could lead to widespread attacks. Devices of this nature are prime targets for botnet attacks. Consumer devices are frequently targeted for this attack due to the complexities of updating firmware once manufacturers no longer have physical access to a device. When exploiting a found vulnerability, adversaries often try to gain root access on a device. This allows them to use the device for any malicious purpose. Some example exploits are stealing device data, using the device for a ransomware attack, or recruiting the device for a botnet.",
            "x_capec_likelihood_of_attack": "Medium",
            "x_capec_prerequisites": [
                "Awareness of the hardware being leveraged.",
                "Access to the hardware being leveraged, either physically or remotely."
            ],
            "x_capec_skills_required": {
                "High": "Ability to identify physical entry points such as debug interfaces if the device is not being accessed remotely",
                "Medium": "Knowledge of various wireless protocols to enable remote access to vulnerable devices"
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}