{
    "id": "bundle--f748b83a-ea5d-4385-a6ce-359237c3e881",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary discovers the structure, function, and composition of an object, resource, or system by using a variety of analysis techniques to effectively determine how the analyzed entity was constructed or operates. The goal of reverse engineering is often to duplicate the function, or a part of the function, of an object in order to duplicate or \"back engineer\" some aspect of its functioning. Reverse engineering techniques can be applied to mechanical objects, electronic devices, or software, although the methodology and techniques involved in each type of analysis differ widely.",
            "external_references": [
                {
                    "external_id": "CAPEC-188",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/188.html"
                },
                {
                    "external_id": "CWE-1278",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/1278.html"
                },
                {
                    "description": "Wikipedia, The Wikimedia Foundation, Inc",
                    "external_id": "REF-50",
                    "source_name": "reference_from_CAPEC",
                    "url": "http://en.wikipedia.org/wiki/Reverse_engineering"
                }
            ],
            "id": "attack-pattern--25946b99-9827-40a6-99a4-ca15eea08e5d",
            "modified": "2023-01-24T00:00:00.000Z",
            "name": "Reverse Engineering",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Meta",
            "x_capec_domains": [
                "Software",
                "Physical Security",
                "Hardware"
            ],
            "x_capec_example_instances": [
                "When adversaries are reverse engineering software, methodologies fall into two broad categories, 'white box' and 'black box.' White box techniques involve methods which can be applied to a piece of software when an executable or some other compiled object can be directly subjected to analysis, revealing at least a portion of its machine instructions that can be observed upon execution. 'Black Box' methods involve interacting with the software indirectly, in the absence of the ability to measure, instrument, or analyze an executable object directly. Such analysis typically involves interacting with the software at the boundaries of where the software interfaces with a larger execution environment, such as input-output vectors, libraries, or APIs."
            ],
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_parent_of_refs": [
                "attack-pattern--d17eb5a5-1361-4e13-a969-e4d587d13b3d",
                "attack-pattern--4ba540ef-b8ad-4bf7-acac-d8855661c4a2"
            ],
            "x_capec_prerequisites": [
                "Access to targeted system, resources, and information."
            ],
            "x_capec_resources_required": [
                "The technical resources necessary to engage in reverse engineering differ in accordance with the type of object, resource, or system being analyzed."
            ],
            "x_capec_skills_required": {
                "High": "Understanding of low level programming languages or technologies can be very helpful. For example, when reverse engineering a binary file, an understanding of assembly languages can help to determine the purpose and inner-workings of the code. Another example is reverse engineering an application that relies on networking. Here, an understanding networking protocols can provide insight into application details."
            },
            "x_capec_status": "Stable",
            "x_capec_typical_severity": "Low",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}