{
    "id": "bundle--5f9208d1-6c65-4733-b1f5-dbc4e01fbed2",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An attacker exploits file location algorithms in an operating system or application by creating a file with the same name as a protected or privileged file. The attacker could manipulate the system if the attacker-created file is trusted by the operating system or an application component that attempts to load the original file. Applications often load or include external files, such as libraries or configuration files. These files should be protected against malicious manipulation. However, if the application only uses the name of the file when locating it, an attacker may be able to create a file with the same name and place it in a directory that the application will search before the directory with the legitimate file is searched. Because the attackers' file is discovered first, it would be used by the target application. This attack can be extremely destructive if the referenced file is executable and/or is granted special privileges based solely on having a particular name.",
            "external_references": [
                {
                    "external_id": "CAPEC-177",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/177.html"
                },
                {
                    "external_id": "CWE-706",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/706.html"
                },
                {
                    "description": "Masquerading",
                    "external_id": "T1036",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1036"
                }
            ],
            "id": "attack-pattern--64d83978-33f0-48c7-a375-b58fcb0556cd",
            "modified": "2018-07-31T00:00:00.000Z",
            "name": "Create files with the same name as files protected with a higher classification",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_child_of_refs": [
                "attack-pattern--9ad2c2eb-9939-4590-9683-2e789692d262"
            ],
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_prerequisites": [
                "The target application must include external files. Most non-trivial applications meet this criterion.",
                "The target application does not verify that a located file is the one it was looking for through means other than the name. Many applications fail to perform checks of this type.",
                "The directories the target application searches to find the included file include directories writable by the attacker which are searched before the protected directory containing the actual files. It is much less common for applications to meet this criterion, but if an attacker can manipulate the application's search path (possibly by controlling environmental variables) then they can force this criterion to be met."
            ],
            "x_capec_resources_required": [
                "The attacker must have sufficient access to place an arbitrarily named file somewhere early in the application's search path."
            ],
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Very High",
            "x_capec_version": "3.9"
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}