{
    "id": "bundle--4b92b3a2-9908-4da4-9982-a9655db84128",
    "objects": [
        {
            "created": "2017-05-31T21:30:34.928619Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "description": "Windows service configuration information, including the file path to the service's executable, is stored in the Registry. Service configurations can be modified using utilities such as sc.exe and Reg.\n\nAdversaries can modify an existing service to persist malware on a system by using system utilities or by using custom tools to interact with the Windows API. Use of existing services is a type of Masquerading that may make detection analysis more challenging. Modifying existing services may interrupt their functionality or may enable services that are disabled or otherwise not commonly used.\n\nDetection: Look for changes to service Registry entries that do not correlate with known software, patch cycles, etc. Changes to the binary path and the service startup type changed from manual or disabled to automatic, if it does not typically do so, may be suspicious. Tools such as Sysinternals Autoruns may also be used to detect system service changes that could be attempts at persistence.cmd commands or scripts.\n\nLook for abnormal process call trees from known services and for execution of other commands that could relate to Windows Management Instrumentation and PowerShell, so additional logging may need to be configured to gather the appropriate data.\n\nPlatforms: Windows Server 2003, Windows Server 2008, Windows Server 2012, Windows XP, Windows 7, Windows 8, Windows Server 2003 R2, Windows Server 2008 R2, Windows Server 2012 R2, Windows Vista, Windows 8.1\n\nData Sources: Windows Registry, File monitoring, Process command-line parameters, Process monitoring",
            "external_references": [
                {
                    "external_id": "T1031",
                    "source_name": "mitre-attack",
                    "url": "https://attack.mitre.org/wiki/Technique/T1031"
                },
                {
                    "description": "Russinovich, M. (2016, January 4). Autoruns for Windows v13.51. Retrieved June 6, 2016.",
                    "source_name": "TechNet Autoruns",
                    "url": "https://technet.microsoft.com/en-us/sysinternals/bb963902"
                }
            ],
            "id": "attack-pattern--62dfd1ca-52d5-483c-a84b-d6e80bf94b7b",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-attack",
                    "phase_name": "persistence"
                }
            ],
            "modified": "2017-05-31T21:30:34.928619Z",
            "name": "Modify Existing Service",
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "type": "attack-pattern",
            "x_mitre_data_sources": [
                "Windows Registry",
                "File monitoring",
                "Process command-line parameters",
                "Process monitoring"
            ],
            "x_mitre_platforms": [
                "Windows Server 2003",
                "Windows Server 2008",
                "Windows Server 2012",
                "Windows XP",
                "Windows 7",
                "Windows 8",
                "Windows Server 2003 R2",
                "Windows Server 2008 R2",
                "Windows Server 2012 R2",
                "Windows Vista",
                "Windows 8.1"
            ]
        }
    ],
    "spec_version": "2.0",
    "type": "bundle"
}