{
    "type": "bundle",
    "id": "bundle--a888d2d7-3194-4ad8-bbd8-2a875d515efe",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--0dd9c44c-0fb7-41b6-94bc-6d0e2f855d43",
            "created_by_ref": "identity--31f421d4-bb36-4dbf-9dfc-c116a91de14b",
            "created": "2018-03-06T17:19:01.939Z",
            "modified": "2018-03-06T17:19:01.939Z",
            "name": "Active OS Fingerprinting",
            "description": "An adversary engages in activity to detect the operating system or firmware version of a remote target by interrogating a device, server, or platform with a probe designed to solicit behavior that will reveal information about the operating systems or firmware in the environment. Operating System detection is possible because implementations of common protocols (Such as IP or TCP) differ in distinct ways. While the implementation differences are not sufficient to 'break' compatibility with the protocol the differences are detectable because the target will respond in unique ways to specific probing activity that breaks the semantic or logical rules of packet construction for a protocol. Different operating systems will have a unique response to the anomalous input, providing the basis to fingerprint the OS behavior. This type of OS fingerprinting can distinguish between operating system types and versions.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/312.html",
                    "external_id": "CAPEC-312"
                }
            ],
            "object_marking_refs": [
                "marking-definition--b345b2a9-b539-4d88-8a9a-1ebcc9f77507"
            ],
            "x_capec_abstraction": "Standard",
            "x_capec_likelihood_of_attack": "Medium",
            "x_capec_prerequisites": [
                "The ability to monitor and interact with network communications.\nAccess to at least one host, and the privileges to interface with the network interface card."
            ],
            "x_capec_typical_severity": "Low",
            "x_resources_required": "Any type of active probing that involves non-standard packet headers requires the use of raw sockets, which is not available on particular operating systems (Microsoft Windows XP SP 2, for example). Raw socket manipulation on Unix/Linux requires root privileges.\nA tool capable of sending and receiving packets from a remote system."
        }
    ]
}