{
    "type": "bundle",
    "id": "bundle--4489f81f-c8f3-4af1-9765-cec288558ae2",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--174bc145-37b2-4533-bf43-4bd24b641632",
            "created_by_ref": "identity--a310da54-cad2-443b-8371-36e2df91ab5d",
            "created": "2014-06-23T00:00:00.000Z",
            "modified": "2017-05-01T00:00:00.000Z",
            "name": "Flooding",
            "description": "An adversary consumes the resources of a target by rapidly engaging in a large number of interactions with the target. This type of attack generally exposes a weakness in rate limiting or flow. When successful this attack prevents legitimate users from accessing the service and can cause the target to crash. This attack differs from resource depletion through leaks or allocations in that the latter attacks do not rely on the volume of requests made to the target but instead focus on manipulation of the target's operations. The key factor in a flooding attack is the number of requests the adversary can make in a given period of time. The greater this number, the more likely an attack is to succeed against a given target.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/125.html",
                    "external_id": "CAPEC-125"
                },
                {
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/404.html",
                    "external_id": "CWE-404"
                },
                {
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/770.html",
                    "external_id": "CWE-770"
                }
            ],
            "object_marking_refs": [
                "marking-definition--db13c800-5b49-4c0f-b51b-7f0ec4309951"
            ],
            "x_capec_abstraction": "Meta",
            "x_capec_consequences": {
                "Availability": [
                    "Unreliable Execution (A successful flooding attack compromises the availability of the target system's service by exhausting its available resources.)",
                    "Resource Consumption (A successful flooding attack compromises the availability of the target system's service by exhausting its available resources.)"
                ]
            },
            "x_capec_likelihood_of_attack": "High",
            "x_capec_prerequisites": [
                "Any target that services requests is vulnerable to this attack on some level of scale."
            ],
            "x_capec_resources_required": [
                "A script or program capable of generating more requests than the target can handle, or a network or cluster of objects all capable of making simultaneous requests."
            ],
            "x_capec_status": "Stable",
            "x_capec_typical_severity": "Medium"
        }
    ]
}