{
    "type": "attack-pattern",
    "id": "attack-pattern--91ec68a7-17d8-4f7c-b0f0-ab0be41b23b4",
    "created_by_ref": "identity--8641df51-0f59-4a4d-a300-7f11ca320ba2",
    "created": "2018-03-05T19:11:06.613Z",
    "modified": "2018-03-05T19:11:06.613Z",
    "name": "Overflow Binary Resource File",
    "description": "An attack of this type exploits a buffer overflow vulnerability in the handling of binary resources. Binary resources may include music files like MP3, image files like JPEG files, and any other binary file. These attacks may pass unnoticed to the client machine through normal usage of files, such as a browser loading a seemingly innocent JPEG file. This can allow the attacker access to the execution stack and execute arbitrary code in the target process. This attack pattern is a variant of standard buffer overflow attacks using an unexpected vector (binary files) to wrap its attack and open up a new attack vector. The attacker is required to either directly serve the binary content to the victim, or place it in a locale like a MP3 sharing application, for the victim to download. The attacker then is notified upon the download or otherwise locates the vulnerability opened up by the buffer overflow.",
    "external_references": [
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/44.html",
            "external_id": "CAPEC-44"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/120.html",
            "external_id": "CWE-120"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/119.html",
            "external_id": "CWE-119"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/697.html",
            "external_id": "CWE-697"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/713.html",
            "external_id": "CWE-713"
        }
    ],
    "object_marking_refs": [
        "marking-definition--127d62dd-9993-48ef-9ef1-a9c686da9914"
    ],
    "x_capec_abstraction": "Detailed",
    "x_capec_consequences": {
        "Run Arbitrary Code": "Execute unauthorized code or commands"
    },
    "x_capec_example_instances": [
        "Binary files like music and video files are appended with additional data to cause buffer overflow on target systems. Because these files may be filled with otherwise popular content, the attacker has an excellent vector for wide distribution. There have been numerous cases, for example of malicious screen savers for sports teams that are distributed on the event of the team winning a championship."
    ],
    "x_capec_likelihood_of_attack": "High",
    "x_capec_prerequisites": [
        "Target software processes binary resource files.",
        "Target software contains a buffer overflow vulnerability reachable through input from a user-controllable binary resource file."
    ],
    "x_capec_skills_required": {
        "To modify file, deceive client into downloading, locate and exploit remote stack or heap vulnerability": "Medium"
    },
    "x_capec_typical_severity": "Very High",
    "x_resources_required": ""
}