{
    "type": "bundle",
    "id": "bundle--a48fd95e-ab1f-4b8d-858a-ff2e18732784",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--615674d6-04d0-480f-80ae-c242d63c7620",
            "created_by_ref": "identity--31f421d4-bb36-4dbf-9dfc-c116a91de14b",
            "created": "2018-03-06T17:19:01.984Z",
            "modified": "2018-03-06T17:19:01.984Z",
            "name": "TCP Timestamp Probe",
            "description": "This OS fingerprinting probe examines the remote server's implementation of TCP timestamps. Not all operating systems implement timestamps within the TCP header, but when timestamps are used then this provides the attacker with a means to guess the operating system of the target. The attacker begins by probing any active TCP service in order to get response which contains a TCP timestamp. Different Operating systems update the timestamp value using different intervals. This type of analysis is most accurate when multiple timestamp responses are received and then analyzed. TCP timestamps can be found in the TCP Options field of the TCP header.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/320.html",
                    "external_id": "CAPEC-320"
                }
            ],
            "object_marking_refs": [
                "marking-definition--b345b2a9-b539-4d88-8a9a-1ebcc9f77507"
            ],
            "x_capec_abstraction": "Detailed",
            "x_capec_likelihood_of_attack": "Medium",
            "x_capec_prerequisites": [
                "The ability to monitor and interact with network communications.\nAccess to at least one host, and the privileges to interface with the network interface card.\nThe target OS must support the TCP timestamp option in order to obtain a fingerprint."
            ],
            "x_capec_typical_severity": "Low",
            "x_resources_required": "Any type of active probing that involves non-standard packet headers requires the use of raw sockets, which is not available on particular operating systems (Microsoft Windows XP SP 2, for example). Raw socket manipulation on Unix/Linux requires root privileges.\nA tool capable of sending and receiving packets from a remote system."
        }
    ]
}