{
    "type": "attack-pattern",
    "id": "attack-pattern--4bcd6862-f3d7-4457-93f0-6dc9e4f93be8",
    "created_by_ref": "identity--d922e967-ff9b-4f27-97e6-2fc5f54aac51",
    "created": "2018-03-05T19:06:11.681Z",
    "modified": "2018-03-05T19:06:11.681Z",
    "name": "Homograph Attack via Homoglyphs",
    "description": "An adversary registers a domain name containing a homoglyph, leading the registered domain to appear the same as a trusted domain. A homograph attack leverages the fact that different characters among various character sets look the same to the user. Homograph attacks must generally be combined with other attacks, such as phishing attacks, in order to direct Internet traffic to the adversary-controlled destinations.",
    "external_references": [
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/632.html",
            "external_id": "CAPEC-632"
        }
    ],
    "object_marking_refs": [
        "marking-definition--068ab041-90bb-4e30-9394-d306c62765a6"
    ],
    "x_capec_abstraction": "Detailed",
    "x_capec_alternate_terms": [
        "Homoglyph Attack"
    ],
    "x_capec_consequences": {
        "Depending on the intention of the adversary, a successful Homograph attack can be leveraged to execute more complex attacks such as cross-site scripting or stealing account credentials.": "Other"
    },
    "x_capec_example_instances": [
        "An adversary sends an email, impersonating bankofamerica.com to a user stating that they have just received a new deposit and to click the given link to confirm the deposit.\nHowever, the link the in email is bankofamerica.com, where the 'a' and 'e' characters are Cyrillic and not ASCII, instead of bankofamerica.com (all ASCII), which the user clicks after carefully reading the URL, making sure that typosquatting and soundsquatting attacks are not being leveraged against them.\nThe user is directed to the adversary's website, which appears as if it is the legitimate bankofamerica.com login page.\nThe user thinks they are logging into their account, but have actually just given their bankofamerica.com credentials to the adversary. The adversary can now use the user's legitimate bankofamerica.com credentials to log into the user's account and steal any money which may be in the account.\nHomograph vulnerability allows an adversary to impersonate a trusted domain by leveraging homoglyphs and tricking a user into visiting the malicious website to steal user credentials."
    ],
    "x_capec_likelihood_of_attack": "Low",
    "x_capec_prerequisites": [
        "An adversary requires knowledge of popular or high traffic domains, that could be used to deceive potential targets."
    ],
    "x_capec_skills_required": {
        "Adversaries must be able to register DNS hostnames/URL’s.": "Low"
    },
    "x_capec_typical_severity": "Medium"
}