{
    "type": "bundle",
    "id": "bundle--aedfab84-3ac5-47db-b2db-5f9453de2d73",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--d3ed3c67-fd28-49d1-b6a4-8d46b644ad8c",
            "created_by_ref": "identity--99e72de9-cd42-43b1-906d-c4f855fd3322",
            "created": "2014-06-23T00:00:00.000Z",
            "modified": "2017-08-04T00:00:00.000Z",
            "name": "File Manipulation",
            "description": "An attacker modifies file contents or attributes (such as extensions or names) of files in a manner to cause incorrect processing by an application. Attackers use this class of attacks to cause applications to enter unstable states, overwrite or expose sensitive information, and even execute arbitrary code with the application's privileges. This class of attacks differs from attacks on configuration information (even if file-based) in that file manipulation causes the file processing to result in non-standard behaviors, such as buffer overflows or use of the incorrect interpreter. Configuration attacks rely on the application interpreting files correctly in order to insert harmful configuration information. Likewise, resource location attacks rely on controlling an application's ability to locate files, whereas File Manipulation attacks do not require the application to look in a non-default location, although the two classes of attacks are often combined.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/165.html",
                    "external_id": "CAPEC-165"
                }
            ],
            "object_marking_refs": [
                "marking-definition--7af89974-8179-4268-a77a-47d3f7bc1c89"
            ],
            "x_capec_abstraction": "Meta",
            "x_capec_prerequisites": [
                "The target must use the affected file without verifying its integrity."
            ],
            "x_capec_resources_required": [
                "None: No specialized resources are required to execute this type of attack. In some cases, tools can be used to better control the response of the targeted application to the modified file."
            ],
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Medium",
            "x_capec_version": "3.2"
        }
    ]
}