{
    "type": "attack-pattern",
    "id": "attack-pattern--7543f7ad-459b-4c4e-8f29-29fb18060422",
    "created_by_ref": "identity--8f6c4831-6b8a-469b-b654-9dcaeede2d35",
    "created": "2018-03-06T15:56:01.085Z",
    "modified": "2018-03-06T15:56:01.085Z",
    "name": "Web Application Fingerprinting",
    "description": "An attacker sends a series of probes to a web application in order to elicit version-dependent and type-dependent behavior that assists in identifying the target. An attacker could learn information such as software versions, error pages, and response headers, variations in implementations of the HTTP protocol, directory structures, and other similar information about the targeted service. This information can then be used by an attacker to formulate a targeted attack plan. While web application fingerprinting is not intended to be damaging (although certain activities, such as network scans, can sometimes cause disruptions to vulnerable applications inadvertently) it may often pave the way for more damaging attacks.",
    "external_references": [
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/170.html",
            "external_id": "CAPEC-170"
        }
    ],
    "object_marking_refs": [
        "marking-definition--aee86263-8856-421f-b382-457d8408db7d"
    ],
    "x_capec_abstraction": "Detailed",
    "x_capec_consequences": {
        "Information Leakage": "\"Varies by context\""
    },
    "x_capec_example_instances": [
        "An attacker sends malformed requests or requests of nonexistent pages to the server. Consider the following HTTP responses.\n\t$ nc apache.server.com\n\t80 GET / HTTP/3.0\n\t\n\tHTTP/1.1 400 Bad Request\n\tDate: Sun, 15 Jun 2003 17:12: 37 GMT\n\tServer: Apache/1.3.23\n\tConnection: close\n\tTransfer: chunked\n\tContent-Type: text/HTML; charset=iso-8859-1\n[R.170.2]\n\t$ nc iis.server.com 80\n\tGET / HTTP/3.0\n\t\n\tHTTP/1.1 200 OK\n\tServer: Microsoft-IIS/5.0\n\tContent-Location: http://iis.example.com/Default.htm\n\tDate: Fri, 01 Jan 1999 20:14: 02 GMT\n\tContent-Type: text/HTML\n\tAccept-Ranges: bytes Last-Modified: Fri, 01 Jan 1999 20:14: 02 GMT\n\tETag: W/e0d362a4c335be1: ae1\n\tContent-Length: 133"
    ],
    "x_capec_likelihood_of_attack": "High",
    "x_capec_prerequisites": [
        "Any web application can be fingerprinted. However, some configuration choices can limit the useful information an attacker may collect during a fingerprinting attack."
    ],
    "x_capec_skills_required": {
        "Attacker knows how to send HTTP request, SQL query to a web application.": "Low"
    },
    "x_capec_typical_severity": "Low",
    "x_resources_required": "While simple fingerprinting can be accomplished with only a web browser, for more thorough fingerprinting an attacker requires a variety of tools to collect information about the target. These tools might include protocol analyzers, web-site crawlers, and fuzzing tools. Footprinting a service adequately may also take a few days if the attacker wishes the footprinting attempt to go undetected."
}