{
    "type": "attack-pattern",
    "id": "attack-pattern--0611b78c-5965-4e85-9133-668ae378ff0f",
    "created_by_ref": "identity--8f6c4831-6b8a-469b-b654-9dcaeede2d35",
    "created": "2018-03-06T15:56:02.369Z",
    "modified": "2018-03-06T15:56:02.369Z",
    "name": "Hardware Design Specifications Are Altered",
    "description": "An attacker with access to a manufacturer's hardware manufacturing process documentation alters the design specifications, which introduces flaws advantageous to the attacker once the system is deployed.",
    "external_references": [
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/521.html",
            "external_id": "CAPEC-521"
        }
    ],
    "object_marking_refs": [
        "marking-definition--aee86263-8856-421f-b382-457d8408db7d"
    ],
    "x_capec_abstraction": "Detailed",
    "x_capec_example_instances": [
        "To operate at full capability, a manufacturer's network intrusion detection device needs to have either a Intel Xeon E7-2820 or AMD FX-8350 which have 8 \"cores\" available, allowing for advanced threading needed to handle large volumes of network traffic without resorting to dropping packets from the detection process. The attacker alters the documentation to state that the system design must use the Intel Core Duo or the AMD Phenom II X2, which only have 2 cores, causing the system to drop large amounts of packets during deployment at a victim site with large amounts of network traffic."
    ],
    "x_capec_likelihood_of_attack": "Low",
    "x_capec_prerequisites": [
        "Advanced knowledge of hardware capabilities of a manufacturer's product.",
        "Access to the manufacturer's documentation."
    ],
    "x_capec_skills_required": {
        "Ability to stealthly gain access via remote compromise or physical access to the manufacturer's documentation.": "High",
        "Ability to read, interpret, and subsequently alter manufacturer's documentation to cause errors in design specifications.": "High"
    },
    "x_capec_typical_severity": "High"
}