{
    "type": "bundle",
    "id": "bundle--71a4a08d-45c0-4ab8-85c2-d244c9d99bd2",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--69f7ae46-ecf7-4550-a92f-dd3fc65ac086",
            "created_by_ref": "identity--99e72de9-cd42-43b1-906d-c4f855fd3322",
            "created": "2014-06-23T00:00:00.000Z",
            "modified": "2018-07-31T00:00:00.000Z",
            "name": "USB Memory Attacks",
            "description": "An adversary loads malicious code onto a USB memory stick in order to infect any system which the device is plugged in to. USB drives present a significant security risk for business and government agencies. Given the ability to integrate wireless functionality into a USB stick, it is possible to design malware that not only steals confidential data, but sniffs the network, or monitor keystrokes, and then exfiltrates the stolen data off-site via a Wireless connection. Also, viruses can be transmitted via the USB interface without the specific use of a memory stick. The attacks from USB devices are often of such sophistication that experts conclude they are not the work of single individuals, but suggest state sponsorship. These attacks can be performed by an adversary with direct access to a target system or can be executed via means such as USB Drop Attacks.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/457.html",
                    "external_id": "CAPEC-457"
                },
                {
                    "source_name": "reference_from_CAPEC",
                    "description": "Information Technology Laboratory, Supply Chain Risk Management (SCRM), 2010, National Institute of Standards and Technology (NIST)",
                    "external_id": "REF-379"
                }
            ],
            "object_marking_refs": [
                "marking-definition--7af89974-8179-4268-a77a-47d3f7bc1c89"
            ],
            "x_capec_abstraction": "Detailed",
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_prerequisites": [
                "Some level of physical access to the device being attacked.",
                "Information pertaining to the target organization on how to best execute a USB Drop Attack."
            ],
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.2"
        }
    ]
}