{
    "type": "attack-pattern",
    "id": "attack-pattern--1240ca60-7531-4217-929a-d4ed26ad8da2",
    "created_by_ref": "identity--d922e967-ff9b-4f27-97e6-2fc5f54aac51",
    "created": "2018-03-05T19:06:09.711Z",
    "modified": "2018-03-05T19:06:09.711Z",
    "name": "DNS Cache Poisoning",
    "description": "A domain name server translates a domain name (such as www.example.com) into an IP address that Internet hosts use to contact Internet resources. An adversary modifies a public DNS cache to cause certain names to resolve to incorrect addresses that the adversary specifies. The result is that client applications that rely upon the targeted cache for domain name resolution will be directed not to the actual address of the specified domain name but to some other address. Adversaries can use this to herd clients to sites that install malware on the victim's computer or to masquerade as part of a Pharming attack.",
    "external_references": [
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/142.html",
            "external_id": "CAPEC-142"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/348.html",
            "external_id": "CWE-348"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/345.html",
            "external_id": "CWE-345"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/349.html",
            "external_id": "CWE-349"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/346.html",
            "external_id": "CWE-346"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/441.html",
            "external_id": "CWE-441"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/350.html",
            "external_id": "CWE-350"
        }
    ],
    "object_marking_refs": [
        "marking-definition--068ab041-90bb-4e30-9394-d306c62765a6"
    ],
    "x_capec_abstraction": "Detailed",
    "x_capec_example_instances": [
        "In this example, an adversary sends request to a local DNS server to look up www.example .com. The associated IP address of www.example.com is 1.3.5.7.\nLocal DNS usually caches IP addresses and do not go to remote DNS every time. Since the local record is not found, DNS server tries to connect to remote DNS for queries. However, before the remote DNS returns the right IP address 1.3.5.7, the adversary floods local DNS with crafted responses with IP address 2.4.6.8. The result is that 2.4.6.8 is stored in DNS cache. Meanwhile, 2.4.6.8 is associated with a malicious website www.maliciousexampsle.com\nWhen users connect to www.example.com, the local DNS will direct it to www.maliciousexample.com, this works as part of a Pharming attack."
    ],
    "x_capec_likelihood_of_attack": "High",
    "x_capec_prerequisites": [
        "A DNS cache must be vulnerable to some attack that allows the adversary to replace addresses in its lookup table.\nClient applications must trust the corrupted cashed values and utilize them for their domain name resolutions."
    ],
    "x_capec_skills_required": {
        "To overwrite/modify targeted DNS cache": "Medium"
    },
    "x_capec_typical_severity": "High",
    "x_resources_required": "The adversary must have the resources to modify the targeted cache. In addition, in most cases the adversary will wish to host the sites to which users will be redirected, although in some cases redirecting to a third party site will accomplish the adversary's goals."
}