{
    "type": "attack-pattern",
    "id": "attack-pattern--ee3f1e3c-dab9-4b50-b2c0-0074148093df",
    "created_by_ref": "identity--2888a06a-5541-4bad-8066-df6f196f70ff",
    "created": "2018-03-05T19:00:33.920Z",
    "modified": "2018-03-05T19:00:33.920Z",
    "name": "Excavation",
    "description": "An adversary actively probes the target in a manner that is designed to solicit information that could be leveraged for malicious purposes. This is achieved by exploring the target via ordinary interactions for the purpose of gathering intelligence about the target, or by sending data that is syntactically invalid or non-standard in an attempt to produce a response that contains the desired data. As a result of these interactions, the adversary is able to obtain information from the target that aids the attacker in making inferences about its security, configuration, or potential vulnerabilities. Examplar exchanges with the target may trigger unhandled exceptions or verbose error messages that reveal information like stack traces, configuration information, path information, or database design. This type of attack also includes the manipulation of query strings in a URI to produce invalid SQL queries, or by trying alternative path values in the hope that the server will return useful information.",
    "external_references": [
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/116.html",
            "external_id": "CAPEC-116"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/200.html",
            "external_id": "CWE-200"
        }
    ],
    "object_marking_refs": [
        "marking-definition--ad91480b-92ca-4958-92fe-407f4493dcb9"
    ],
    "x_capec_abstraction": "Meta",
    "x_capec_likelihood_of_attack": "High",
    "x_capec_prerequisites": [
        "An adversary requires some way of interacting with the system."
    ],
    "x_capec_typical_severity": "Medium",
    "x_resources_required": "A tool, such as a MITM Proxy or a fuzzer, that is capable of generating and injecting custom inputs to be used in the attack."
}