{
    "type": "bundle",
    "id": "bundle--fd70d3ce-77e6-4bfe-88dd-822ab2dd11d1",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--886a7175-e28a-4e6d-bd22-3b1497e31dc7",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "created": "2015-11-09T00:00:00.000Z",
            "modified": "2020-07-30T00:00:00.000Z",
            "name": "Use of Known Domain Credentials",
            "description": "\n            <xhtml:p>An adversary guesses or obtains (i.e. steals or purchases) legitimate credentials (e.g. userID/password) to achieve authentication and to perform authorized actions under the guise of an authenticated user or service. Attacks leveraging trusted credentials typically result in the adversary laterally moving within the local network, since users are often allowed to login to systems/applications within the network using the same password. This further allows the adversary to obtain sensitive data, download/install malware on the system, pose as a legitimate user for social engineering purposes, and more.</xhtml:p>\n            <xhtml:p>Attacks on known passwords generally rely on the primary fact that users often reuse the same username/password combination for a variety of systems, applications, and services, coupled with poor password policies on the target system or application. Adversaries can also utilize known passwords to target Single Sign On (SSO) or cloud-based applications and services, which often don't verify the authenticity of the user's input. Known credentials are usually obtained by an adversary via a system/application breach and/or by purchasing dumps of credentials on the dark web. These credentials may be further gleaned via exposed configuration and properties files that contain system passwords, database connection strings, and other sensitive data.</xhtml:p>\n            <xhtml:p>Successful spoofing and impersonation of trusted credentials can lead to an adversary breaking authentication, authorization, and audit controls with the target system or application.</xhtml:p>\n         ",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/560.html",
                    "external_id": "CAPEC-560"
                },
                {
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/522.html",
                    "external_id": "CWE-522"
                },
                {
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/307.html",
                    "external_id": "CWE-307"
                },
                {
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/308.html",
                    "external_id": "CWE-308"
                },
                {
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/309.html",
                    "external_id": "CWE-309"
                },
                {
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/262.html",
                    "external_id": "CWE-262"
                },
                {
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/263.html",
                    "external_id": "CWE-263"
                },
                {
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/654.html",
                    "external_id": "CWE-654"
                },
                {
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/1273.html",
                    "external_id": "CWE-1273"
                },
                {
                    "source_name": "ATTACK",
                    "description": "Valid Accounts:Default Accounts",
                    "url": "https://attack.mitre.org/wiki/Technique/T1078/001",
                    "external_id": "T1078.001"
                },
                {
                    "source_name": "ATTACK",
                    "description": "Valid Accounts:Domain Accounts",
                    "url": "https://attack.mitre.org/wiki/Technique/T1078/002",
                    "external_id": "T1078.002"
                },
                {
                    "source_name": "ATTACK",
                    "description": "Valid Accounts:Local Accounts",
                    "url": "https://attack.mitre.org/wiki/Technique/T1078/003",
                    "external_id": "T1078.003"
                },
                {
                    "source_name": "ATTACK",
                    "description": "Trusted Relationship",
                    "url": "https://attack.mitre.org/wiki/Technique/T1199",
                    "external_id": "T1199"
                },
                {
                    "source_name": "reference_from_CAPEC",
                    "description": "Attractive Accounts for Credential Theft, 2017--05---31, Microsoft Corporation",
                    "url": "https://docs.microsoft.com/en-us/windows-server/identity/ad-ds/plan/security-best-practices/attractive-accounts-for-credential-theft?redirectedfrom=MSDN",
                    "external_id": "REF-570"
                },
                {
                    "source_name": "reference_from_CAPEC",
                    "description": "Feike Hacquebord, Two Years of Pawn Storm: Examining an Increasingly Relevant Threat, 2017--04---25, Trend Micro",
                    "url": "https://documents.trendmicro.com/assets/wp/wp-two-years-of-pawn-storm.pdf",
                    "external_id": "REF-571"
                },
                {
                    "source_name": "reference_from_CAPEC",
                    "description": "Corporate IoT – a path to intrusion, 2019--10---05, Microsoft Security Response Center (MSRC)",
                    "url": "https://msrc-blog.microsoft.com/2019/08/05/corporate-iot-a-path-to-intrusion",
                    "external_id": "REF-572"
                },
                {
                    "source_name": "reference_from_CAPEC",
                    "description": "Brendan McKeague, Van Ta, Ben Fedore, Geoff Ackerman, Alex Pennino, Andrew Thompson, Douglas Bienstock, Pick-Six: Intercepting a FIN6 Intrusion, an Actor Recently Tied to Ryuk and LockerGoga Ransomware, 2019--04---05, Microsoft Security Response Center (MSRC)",
                    "url": "https://www.fireeye.com/blog/threat-research/2019/04/pick-six-intercepting-a-fin6-intrusion.html",
                    "external_id": "REF-573"
                }
            ],
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "x_capec_abstraction": "Meta",
            "x_capec_consequences": {
                "Access_Control": [
                    "Gain Privileges"
                ],
                "Authentication": [
                    "Gain Privileges"
                ],
                "Authorization": [
                    "Read Data"
                ],
                "Confidentiality": [
                    "Gain Privileges",
                    "Read Data"
                ],
                "Integrity": [
                    "Modify Data"
                ]
            },
            "x_capec_example_instances": [
                "Throughout 2015 and 2016, APT28 — also known as Pawn Storm, Sednit, Fancy Bear, Sofacy, and STRONTIUM — leveraged stolen credentials to infiltrate the Democratic National Committee (DNC), the United States Army, the World Anti-Doping Agency (WADA), the Court of Arbitration for Sport (TAS-CAS), and more. In most cases, the legitimate credentials were obtained via calculated spearphishing, tabnabbing, and DNS attacks targeted at corporate webmail systems. APT28 also executed several watering hole attacks, in addition to exploiting several zero-day vulnerabilities within Flash and Windows. The stolen credentials were then utilized to maintain authenticated access, laterally move within the local network, and exfiltrate sensitive information including DNC emails and personal medical records of numerous athletes. [REF-571]",
                "In early 2019, FIN6 exploited stolen credentials from an organization within the engineering industry to laterally move within an environment via the Windows’ Remote Desktop Protocol (RDP). Multiple servers were subsequently infected with malware to create malware distribution servers, which were used to distribute the LockerGoga ransomware. [REF-573]"
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Acquire known credentials: </b>The adversary must obtain known credentials in order to access the target system, application, or service.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>An adversary purchases breached username/password combinations or leaked hashed passwords from the dark web.</td></tr><tr><td>An adversary leverages a key logger or phishing attack to steal user credentials as they are provided.</td></tr><tr><td>An adversary conducts a sniffing attack to steal credentials as they are transmitted.</td></tr><tr><td>An adversary gains access to a database and exfiltrates password hashes.</td></tr><tr><td>An adversary examines outward-facing configuration and properties files to discover hardcoded credentials.</td></tr></tbody></table><li> <p> <b>Determine target's password policy: </b>Determine the password policies of the target system/application to determine if the known credentials fit within the specified criteria.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Determine minimum and maximum allowed password lengths.</td></tr><tr><td>Determine format of allowed passwords (whether they are required or allowed to contain numbers, special characters, etc., or whether they are allowed to contain words from the dictionary).</td></tr><tr><td>Determine account lockout policy (a strict account lockout policy will prevent brute force attacks if multiple passwords are known for a single user account).</td></tr></tbody></table></ol></div><div><h3>Experiment</h3><ol><li> <p> <b>Attempt authentication: </b>Try each credential until the target grants access.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Manually or automatically enter each credential through the target's interface.</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Impersonate: </b>An adversary can use successful experiments or authentications to impersonate an authorized user or system, or to laterally move within a system or application</p></li><li> <p> <b>Spoofing: </b>Malicious data can be injected into the target system or into a victim user's system by an adversary. The adversary can also pose as a legitimate user to perform social engineering attacks.</p></li><li> <p> <b>Data Exfiltration: </b>The adversary can obtain sensitive data contained within the system or application.</p></li></ol></div>",
            "x_capec_likelihood_of_attack": "High",
            "x_capec_prerequisites": [
                "The system/application uses one factor password based authentication, SSO, and/or cloud-based authentication.",
                "The system/application does not have a sound password policy that is being enforced.",
                "The system/application does not implement an effective password throttling mechanism.",
                "The adversary possesses a list of known user accounts and corresponding passwords that may exist on the target."
            ],
            "x_capec_resources_required": [
                "A list of known credentials.",
                "A custom script that leverages the credential list to launch an attack."
            ],
            "x_capec_skills_required": {
                "Low": "Once an adversary obtains a known credential, leveraging it is trivial."
            },
            "x_capec_status": "Stable",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.4"
        }
    ]
}