{
    "type": "bundle",
    "id": "bundle--5bbe06e7-3ef1-4e09-8fbb-c482e6705b48",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--4f21e5ee-4f6a-4106-a0fd-83a93af8660b",
            "created_by_ref": "identity--31f421d4-bb36-4dbf-9dfc-c116a91de14b",
            "created": "2018-03-06T17:19:03.100Z",
            "modified": "2018-03-06T17:19:03.100Z",
            "name": "Terrestrial Jamming",
            "description": "In this attack pattern, the adversary transmits disruptive signals in the direction of the target consumer-level satellite dish (as opposed to the satellite itself). The transmission disruption occurs in a more targeted range. Portable terrestrial jammers have a range of 3-5 kilometers in urban areas and 20 kilometers in rural areas. This technique requires a terrestrial jammer that is more powerful than the frequencies sent from the satellite.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/599.html",
                    "external_id": "CAPEC-599"
                }
            ],
            "object_marking_refs": [
                "marking-definition--b345b2a9-b539-4d88-8a9a-1ebcc9f77507"
            ],
            "x_capec_abstraction": "Detailed",
            "x_capec_consequences": {
                "A successful attack will deny, degrade, or disrupt availability of satellite communications for the target by overwhelming its resources to accurately receive authorized transmissions.": "Other"
            },
            "x_capec_example_instances": [
                "An attempt to deceive a GPS receiver by broadcasting counterfeit GPS signals, structured to resemble a set of normal GPS signals. These jamming signals may be structured in such a way as to cause the receiver to estimate its position to be somewhere other than where it actually is, or to be located where it is but at a different time, as determined by the adversary."
            ],
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_typical_severity": "High",
            "x_resources_required": "A terrestrial satellite jammer with a signal more powerful than that of the satellite attempting to communicate with the target.\nThe adversary must know the location of the target satellite dish."
        }
    ]
}