{
    "type": "bundle",
    "id": "bundle--beba225c-d244-4df4-ab2b-bb04e3444ce3",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--8f84be0f-81aa-4812-9fb7-b7e00caf00e4",
            "created_by_ref": "identity--a310da54-cad2-443b-8371-36e2df91ab5d",
            "created": "2014-06-23T00:00:00.000Z",
            "modified": "2018-07-31T00:00:00.000Z",
            "name": "Intent Intercept",
            "description": "An adversary, through a previously installed malicious application, intercepts messages from a trusted Android-based application in an attempt to achieve a variety of different objectives including denial of service, information disclosure, and data injection. An implicit intent sent from a trusted application can be received by any application that has declared an appropriate intent filter. If the intent is not protected by a permission that the malicious application lacks, then the attacker can gain access to the data contained within the intent. Further, the intent can be either blocked from reaching the intended destination, or modified and potentially forwarded along.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/499.html",
                    "external_id": "CAPEC-499"
                },
                {
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/925.html",
                    "external_id": "CWE-925"
                },
                {
                    "source_name": "reference_from_CAPEC",
                    "description": "Erika Chin, Adrienne Porter Felt, Kate Greenwood, David Wagner, Analyzing Inter-Application Communication in Android, 2011, International Conference on Mobile Systems, Applications, and Services (MobiSys)",
                    "url": "https://people.eecs.berkeley.edu/~daw/papers/intents-mobisys11.pdf",
                    "external_id": "REF-427"
                }
            ],
            "object_marking_refs": [
                "marking-definition--db13c800-5b49-4c0f-b51b-7f0ec4309951"
            ],
            "x_capec_abstraction": "Standard",
            "x_capec_prerequisites": [
                "An adversary must be able install a purpose built malicious application onto the Android device and convince the user to execute it. The malicious application is used to intercept implicit intents."
            ],
            "x_capec_status": "Draft"
        }
    ]
}