{
    "type": "attack-pattern",
    "id": "attack-pattern--f1ecc0c2-181d-4fc8-94f3-8420018a7556",
    "created_by_ref": "identity--d922e967-ff9b-4f27-97e6-2fc5f54aac51",
    "created": "2018-03-05T19:06:10.761Z",
    "modified": "2018-03-05T19:06:10.761Z",
    "name": "Manipulating Writeable Terminal Devices",
    "description": "This attack exploits terminal devices that allow themselves to be written to by other users. The attacker sends command \n                  strings to the target terminal device hoping that the target user will hit enter and thereby execute the malicious command with \n                  their privileges. The attacker can send the results (such as copying /etc/passwd) to a known directory and collect once the \n                  attack has succeeded.",
    "external_references": [
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/40.html",
            "external_id": "CAPEC-40"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/306.html",
            "external_id": "CWE-306"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/74.html",
            "external_id": "CWE-74"
        }
    ],
    "object_marking_refs": [
        "marking-definition--068ab041-90bb-4e30-9394-d306c62765a6"
    ],
    "x_capec_abstraction": "Detailed",
    "x_capec_consequences": {
        "Run Arbitrary Code": "Execute unauthorized code or commands"
    },
    "x_capec_example_instances": [
        "\"Any system that allows other peers to write directly to its terminal process is vulnerable to this type of attack. If the terminals are available through being over-privileged (i.e. world-writable) or the attacker is an administrator, then a series of commands in this format can be used to echo commands out to victim terminals.\n\t\"$echo -e \"\\033[30m\\033\\132\" > /dev/ttyXX\nwhere XX is the tty number of the user under attack. This will paste the characters to another terminal (tty). Note this technique works only if the victim's tty is world writable (which it may not be). That is one reason why programs like write(1) and talk(1) in UNIX systems need to run setuid.\" [R.40.1][REF-2]\nIf the victim continues to hit \"enter\" and execute the commands, there are an endless supply of vectors available to the attacker, copying files, open up network connections, ftp out to servers, and so on."
    ],
    "x_capec_likelihood_of_attack": "High",
    "x_capec_prerequisites": [
        "User terminals must have a permissive access control such as world writeable that allows normal users to control data on other user's terminals."
    ],
    "x_capec_typical_severity": "Very High",
    "x_resources_required": "Access to a terminal on the target network"
}