{
    "type": "attack-pattern",
    "id": "attack-pattern--dc699d35-1a8b-4319-93a3-38b4fad85985",
    "created_by_ref": "identity--8f6c4831-6b8a-469b-b654-9dcaeede2d35",
    "created": "2018-03-06T15:56:02.021Z",
    "modified": "2018-03-06T15:56:02.021Z",
    "name": "Influence Perception of Authority",
    "description": "An adversary uses a social engineering technique to convey a sense of authority that motivates the target reveal specific information or take specific action. There are various techniques for producing a sense of authority during ordinary modes of communication. One common method is impersonation. By impersonating someone with a position of power within an organization an adversary may motivate the target individual to reveal some piece of sensitive information or perform an action that benefits the adversary.",
    "external_references": [
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/421.html",
            "external_id": "CAPEC-421"
        }
    ],
    "object_marking_refs": [
        "marking-definition--aee86263-8856-421f-b382-457d8408db7d"
    ],
    "x_capec_abstraction": "Detailed",
    "x_capec_consequences": {
        "Attacks that leverage the principle of scarcity can lead to the target performing an action that results in a variety of consequences that negatively affect the confidentiality, availability, and/or integrity of an application or system.": "\"Varies by context\""
    },
    "x_capec_example_instances": [
        "The adversary calls the target and announces that he is the head of IT at the target's company. The adversary goes on to say that there has been a technical issue and he/she needs the target's login credentials for their account. By convincing the target of his/her authority, the adversary hopes the target will reveal the sensitive information."
    ],
    "x_capec_likelihood_of_attack": "High",
    "x_capec_prerequisites": [
        "The adversary must have the means and knowledge of how to communicate with the target in some manner."
    ],
    "x_capec_skills_required": {
        "The adversary requires strong inter-personal and communication skills.": "Low"
    },
    "x_capec_typical_severity": "Low",
    "x_resources_required": "None: No specialized resources are required to execute this type of attack."
}