{
    "type": "bundle",
    "id": "bundle--7d66e6d8-1628-41ed-bd7c-1de68374f945",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--4f206bf0-ddaa-49e3-8dd8-6f578082c8e0",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "created": "2014-06-23T00:00:00.000Z",
            "modified": "2019-09-30T00:00:00.000Z",
            "name": "ICMP Address Mask Request",
            "description": "An adversary sends an ICMP Type 17 Address Mask Request to gather information about a target's networking configuration. ICMP Address Mask Requests are defined by RFC-950, \"Internet Standard Subnetting Procedure.\" An Address Mask Request is an ICMP type 17 message that triggers a remote system to respond with a list of its related subnets, as well as its default gateway and broadcast address via an ICMP type 18 Address Mask Reply datagram. Gathering this type of information helps the adversary plan router-based attacks as well as denial-of-service attacks against the broadcast address. Many modern operating systems will not respond to ICMP type 17 messages for security reasons. Determining whether a system or router will respond to an ICMP Address Mask Request helps the adversary determine operating system or firmware version. Additionally, because these types of messages are rare, they are easily spotted by intrusion detection systems. Many ICMP scanning tools support IP spoofing to help conceal the origin of the actual request among a storm of similar ICMP messages. It is a common practice for border firewalls and gateways to be configured to block ingress ICMP type 17 and egress ICMP type 18 messages.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/294.html",
                    "external_id": "CAPEC-294"
                },
                {
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/200.html",
                    "external_id": "CWE-200"
                },
                {
                    "source_name": "reference_from_CAPEC",
                    "description": "Stuart McClure, Joel Scambray, George Kurtz, Hacking Exposed: Network Security Secrets & Solutions (6th Edition), 2009, McGraw Hill",
                    "external_id": "REF-33"
                },
                {
                    "source_name": "reference_from_CAPEC",
                    "description": "J. Mogul, J. Postel, RFC950 - Internet Standard Subnetting Procedure, 1985--08",
                    "url": "http://www.faqs.org/rfcs/rfc950.html",
                    "external_id": "REF-139"
                },
                {
                    "source_name": "reference_from_CAPEC",
                    "description": "J. Postel, RFC792 - Internet Control Messaging Protocol, 1981--09, Defense Advanced Research Projects Agency (DARPA)",
                    "url": "http://www.faqs.org/rfcs/rfc792.html",
                    "external_id": "REF-123"
                },
                {
                    "source_name": "reference_from_CAPEC",
                    "description": "Mark Wolfgang, Host Discovery with Nmap, 2002--11",
                    "url": "http://nmap.org/docs/discovery.pdf",
                    "external_id": "REF-125"
                },
                {
                    "source_name": "reference_from_CAPEC",
                    "description": "Gordon \"Fyodor\" Lyon, Nmap Network Scanning: The Official Nmap Project Guide to Network Discovery and Security Scanning (3rd \"Zero Day\" Edition,), 2008, Insecure.com LLC, ISBN: 978-0-9799587-1-7",
                    "external_id": "REF-34"
                }
            ],
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "x_capec_abstraction": "Detailed",
            "x_capec_consequences": {
                "Access_Control": [
                    "Hide Activities"
                ],
                "Authorization": [
                    "Hide Activities"
                ],
                "Confidentiality": [
                    "Other",
                    "Hide Activities"
                ]
            },
            "x_capec_prerequisites": [
                "The ability to send an ICMP type 17 query (Address Mask Request) to a remote target and receive an ICMP type 18 message (ICMP Address Mask Reply) in response. Generally, modern operating systems will ignore ICMP type 17 messages, however, routers will commonly respond to this request."
            ],
            "x_capec_resources_required": [
                "The ability to send custom ICMP queries. This can be accomplished via the use of various scanners or utilities."
            ],
            "x_capec_status": "Stable",
            "x_capec_typical_severity": "Low",
            "x_capec_version": "3.2"
        }
    ]
}