{
    "type": "attack-pattern",
    "id": "attack-pattern--5666f44a-fb84-4165-9a97-0134a74ab137",
    "created_by_ref": "identity--2888a06a-5541-4bad-8066-df6f196f70ff",
    "created": "2018-03-05T19:00:35.311Z",
    "modified": "2018-03-05T19:00:35.311Z",
    "name": "Influence Perception of Scarcity",
    "description": "The adversary leverages a perception of scarcity to persuade the target to perform an action or divulge information that is advantageous to the adversary. By conveying a perception of scarcity, or a situation of limited supply, the adversary aims to create a sense of urgency in the context of a target's decision-making process.",
    "external_references": [
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/420.html",
            "external_id": "CAPEC-420"
        }
    ],
    "object_marking_refs": [
        "marking-definition--ad91480b-92ca-4958-92fe-407f4493dcb9"
    ],
    "x_capec_abstraction": "Detailed",
    "x_capec_consequences": {
        "Attacks that leverage the principle of scarcity can lead to the target performing an action that results in a variety of consequences that negatively affect the confidentiality, availability, and/or integrity of an application or system.": "\"Varies by context\""
    },
    "x_capec_example_instances": [
        "An adversary sends an email to a target about a limited-time opportunity to claim a considerable monetary reward. The email contains a link to a site which the adversary says is only active for a short time and to the first person to claim it. By convincing the user of the scarcity of the monetary reward, the adversary aims to persuade them to click on the malicious link in the email."
    ],
    "x_capec_likelihood_of_attack": "High",
    "x_capec_prerequisites": [
        "The adversary must have the means and knowledge of how to communicate with the target in some manner."
    ],
    "x_capec_skills_required": {
        "The adversary requires strong inter-personal and communication skills.": "Low"
    },
    "x_capec_typical_severity": "Low",
    "x_resources_required": "None: No specialized resources are required to execute this type of attack."
}