{
    "type": "bundle",
    "id": "bundle--13ac17d0-862b-4cab-a920-6075d19a3f19",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--628b720a-7bb5-49e1-b990-71c89e073467",
            "created_by_ref": "identity--31f421d4-bb36-4dbf-9dfc-c116a91de14b",
            "created": "2018-03-06T17:19:02.727Z",
            "modified": "2018-03-06T17:19:02.727Z",
            "name": "Documentation Alteration to Cause Errors in System Design",
            "description": "An attacker with access to a manufacturer's documentation containing requirements allocation and software design processes maliciously alters the documentation in order to cause errors in system design. This allows the attacker to take advantage of a weakness in a deployed system of the manufacturer for malicious purposes.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/519.html",
                    "external_id": "CAPEC-519"
                }
            ],
            "object_marking_refs": [
                "marking-definition--b345b2a9-b539-4d88-8a9a-1ebcc9f77507"
            ],
            "x_capec_abstraction": "Detailed",
            "x_capec_example_instances": [
                "During operation, a firewall will restart various subsystems to reload and implement new rules as added by the user. An attacker alters the software design dependencies in the manufacturer's documentation so that under certain predictable conditions the reload will fail to load in rules resulting in a \"fail open\" state. Once deployed at a victim site, this will allow the attacker to bypass the victim's firewall."
            ],
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_prerequisites": [
                "Advanced knowledge of software capabilities of a manufacturer's product.",
                "Access to the manufacturer's documentation."
            ],
            "x_capec_skills_required": {
                "Ability to stealthly gain access via remote compromise or physical access to the manufacturer's documentation.": "High",
                "Ability to read, interpret, and subsequently alter manufacturer's documentation to cause errors in system design.": "High"
            },
            "x_capec_typical_severity": "High"
        }
    ]
}