{
    "type": "bundle",
    "id": "bundle--6263fef1-604e-4356-b76a-c2ed32e82c1f",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--d4647d72-8782-432b-849c-a54a26c8cef3",
            "created_by_ref": "identity--31f421d4-bb36-4dbf-9dfc-c116a91de14b",
            "created": "2014-06-23T00:00:00.000Z",
            "modified": "2018-07-31T00:00:00.000Z",
            "name": "Local Code Inclusion",
            "description": "The attacker forces an application to load arbitrary code files from the local machine. The attacker could use this to try to load old versions of library files that have known vulnerabilities, to load files that the attacker placed on the local machine during a prior attack, or to otherwise change the functionality of the targeted application in unexpected ways.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/251.html",
                    "external_id": "CAPEC-251"
                }
            ],
            "object_marking_refs": [
                "marking-definition--b345b2a9-b539-4d88-8a9a-1ebcc9f77507"
            ],
            "x_capec_abstraction": "Standard",
            "x_capec_consequences": {
                "Integrity": [
                    "Execute Unauthorized Commands (Through local code inclusion, the adversary compromises the integrity of the application.)"
                ],
                "Confidentiality": [
                    "Read Data (An attacker may leverage local code inclusion in order to print sensitive data to a page, such as hidden configuration files or or password hashes.)"
                ]
            },
            "x_capec_prerequisites": [
                "The targeted application must have a bug that allows an adversary to control which code file is loaded at some juncture.",
                "Some variants of this attack may require that old versions of some code files be present and in predictable locations."
            ],
            "x_capec_resources_required": [
                "The adversary needs to have enough access to the target application to control the identity of a locally included file. The attacker may also need to be able to upload arbitrary code files to the target machine, although any location for these files may be acceptable."
            ],
            "x_capec_status": "Stable",
            "x_capec_typical_severity": "Medium"
        }
    ]
}