{
    "type": "attack-pattern",
    "id": "attack-pattern--eda526e2-d765-4d42-a349-ccf3793e7756",
    "created_by_ref": "identity--2888a06a-5541-4bad-8066-df6f196f70ff",
    "created": "2018-03-05T19:00:34.371Z",
    "modified": "2018-03-05T19:00:34.371Z",
    "name": "Reverse Engineer an Executable to Expose Assumed Hidden Functionality or Content",
    "description": "An attacker analyzes a binary file or executable for the purpose of discovering the structure, function, and possibly source-code of the file by using a variety of analysis techniques to effectively determine how the software functions and operates. This type of analysis is also referred to as Reverse Code Engineering, as techniques exist for extracting source code from an executable.\nSeveral techniques are often employed for this purpose, both black box and white box. The use of computer bus analyzers and packet sniffers allows the binary to be studied at a level of interactions with its computing environment, such as a host OS, inter-process communication, and/or network communication. This type of analysis falls into the 'black box' category because it involves behavioral analysis of the software without reference to source code, object code, or protocol specifications.",
    "external_references": [
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/190.html",
            "external_id": "CAPEC-190"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/798.html",
            "external_id": "CWE-798"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/259.html",
            "external_id": "CWE-259"
        }
    ],
    "object_marking_refs": [
        "marking-definition--ad91480b-92ca-4958-92fe-407f4493dcb9"
    ],
    "x_capec_abstraction": "Detailed",
    "x_capec_typical_severity": "Low",
    "x_resources_required": "Access to the target file such that it can be analyzed with the appropriate tools. A range of tools suitable for analyzing an executable or its operations"
}