{
    "type": "bundle",
    "id": "bundle--b5f98ce7-0fe0-4884-a83b-8c65388c16cc",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--b96003e9-7554-40e2-a5cf-0a0d4d485948",
            "created_by_ref": "identity--a310da54-cad2-443b-8371-36e2df91ab5d",
            "created": "2014-06-23T00:00:00.000Z",
            "modified": "2014-06-23T00:00:00.000Z",
            "name": "Eavesdropping",
            "description": "An adversary intercepts a form of communication (e.g. text, audio, video) by way of software (e.g., microphone and audio recording application), hardware (e.g., recording equipment), or physical means (e.g., physical proximity). The goal of eavesdropping is typically to gain unauthorized access to sensitive information about the target for financial, personal, political, or other gains. Eavesdropping is different from a sniffing attack as it does not take place on a network-based communication channel (e.g., IP traffic). Instead, it entails listening in on the raw audio source of a conversation between two or more parties.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/651.html",
                    "external_id": "CAPEC-651"
                },
                {
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/200.html",
                    "external_id": "CWE-200"
                }
            ],
            "object_marking_refs": [
                "marking-definition--db13c800-5b49-4c0f-b51b-7f0ec4309951"
            ],
            "x_capec_abstraction": "Standard",
            "x_capec_consequences": {
                "Confidentiality": [
                    "Other (The adversary gains unauthorized access to information.)"
                ]
            },
            "x_capec_prerequisites": [
                "The adversary typically requires physical proximity to the target's environment, whether for physical eavesdropping or for placing recording equipment. This is not always the case for software-based eavesdropping, if the adversary has the capability to install malware on the target system that can activate a microphone and record audio digitally."
            ],
            "x_capec_resources_required": [
                "For logical eavesdropping, some equipment may be necessary (e.g., microphone, tape recorder, etc.). For physical eavesdropping, only proximity is required."
            ],
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Medium"
        }
    ]
}