{
    "type": "bundle",
    "id": "bundle--fcd25a1d-fc3b-4c37-9a30-85cce9277ca8",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--c63ac366-c8a7-4202-a848-65985e55ddd8",
            "created_by_ref": "identity--31f421d4-bb36-4dbf-9dfc-c116a91de14b",
            "created": "2018-03-06T17:19:01.179Z",
            "modified": "2018-03-06T17:19:01.179Z",
            "name": "IMAP/SMTP Command Injection",
            "description": "An attacker exploits weaknesses in input validation on IMAP/SMTP servers to execute commands on the server. Web-mail servers often sit between the Internet and the IMAP or SMTP mail server. User requests are received by the web-mail servers which then query the back-end mail server for the requested information and return this response to the user. In an IMAP/SMTP command injection attack, mail-server commands are embedded in parts of the request sent to the web-mail server. If the web-mail server fails to adequately sanitize these requests, these commands are then sent to the back-end mail server when it is queried by the web-mail server, where the commands are then executed. This attack can be especially dangerous since administrators may assume that the back-end server is protected against direct Internet access and therefore may not secure it adequately against the execution of malicious commands.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/183.html",
                    "external_id": "CAPEC-183"
                }
            ],
            "object_marking_refs": [
                "marking-definition--b345b2a9-b539-4d88-8a9a-1ebcc9f77507"
            ],
            "x_capec_abstraction": "Standard",
            "x_capec_prerequisites": [
                "The target environment must consist of a web-mail server that the attacker can query and a back-end mail server. The back-end mail server need not be directly accessible to the attacker.",
                "The web-mail server must fail to adequately sanitize fields received from users and passed on to the back-end mail server.",
                "The back-end mail server must not be adequately secured against receiving malicious commands from the web-mail server."
            ],
            "x_capec_typical_severity": "Medium",
            "x_resources_required": "None: No specialized resources are required to execute this type of attack. However, in most cases, the attacker will need to be a recognized user of the web-mail server."
        }
    ]
}