{
    "type": "attack-pattern",
    "id": "attack-pattern--ab71ee3b-94e5-4d52-acc8-290793a9f08c",
    "created_by_ref": "identity--8f6c4831-6b8a-469b-b654-9dcaeede2d35",
    "created": "2018-03-06T15:56:01.981Z",
    "modified": "2018-03-06T15:56:01.981Z",
    "name": "Using Meta-characters in E-mail Headers to Inject Malicious Payloads",
    "description": "This type of attack involves an attacker leveraging meta-characters in email headers to inject improper behavior into email programs.\nEmail software has become increasingly sophisticated and feature-rich. In addition, email applications are ubiquitous and connected directly to the Web making them ideal targets to launch and propagate attacks. As the user demand for new functionality in email applications grows, they become more like browsers with complex rendering and plug in routines. As more email functionality is included and abstracted from the user, this creates opportunities for attackers. Virtually all email applications do not list email header information by default, however the email header contains valuable attacker vectors for the attacker to exploit particularly if the behavior of the email client application is known. Meta-characters are hidden from the user, but can contain scripts, enumerations, probes, and other attacks against the user's system.",
    "external_references": [
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/41.html",
            "external_id": "CAPEC-41"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/150.html",
            "external_id": "CWE-150"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/88.html",
            "external_id": "CWE-88"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/697.html",
            "external_id": "CWE-697"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/713.html",
            "external_id": "CWE-713"
        }
    ],
    "object_marking_refs": [
        "marking-definition--aee86263-8856-421f-b382-457d8408db7d"
    ],
    "x_capec_abstraction": "Detailed",
    "x_capec_consequences": {
        "Run Arbitrary Code": "Execute unauthorized code or commands"
    },
    "x_capec_example_instances": [
        "\tTo:<someone@example.com>\n\tFrom:<badguy@example.com>\n\tHeader<SCRIPT>payme</SCRIPT>def: whatever",
        "Meta-characters are among the most valuable tools attackers have to deceive users into taking some action on their behalf. E-mail is perhaps the most efficient and cost effective attack distribution tool available, this has led to the phishing pandemic.\nMeta-characters like \\w \\s \\d ^ can allow the attacker to escape out of the expected behavior to execute additional commands. Escaping out the process (such as email client) lets the attacker run arbitrary code in the user's process."
    ],
    "x_capec_likelihood_of_attack": "High",
    "x_capec_prerequisites": [
        "This attack targets most widely deployed feature rich email applications, including web based email programs."
    ],
    "x_capec_skills_required": {
        "To distribute email": "Low"
    },
    "x_capec_typical_severity": "High",
    "x_resources_required": ""
}