{
    "type": "bundle",
    "id": "bundle--b928c279-eeb9-4bd6-a72e-05b50a312c55",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--336f69a7-4d6b-4e39-bc4f-071b72a201c5",
            "created_by_ref": "identity--a310da54-cad2-443b-8371-36e2df91ab5d",
            "created": "2014-06-23T00:00:00.000Z",
            "modified": "2015-11-09T00:00:00.000Z",
            "name": "Documentation Alteration to Circumvent Dial-down",
            "description": "An attacker with access to a manufacturer's documentation, which include descriptions of advanced technology and/or specific components' criticality, alters the documents to circumvent dial-down functionality requirements. This alteration would change the interpretation of implementation and manufacturing techniques, allowing for advanced technologies to remain in place even though these technologies might be restricted to certain customers, such as nations on the terrorist watch list, giving the attacker on the receiving end of a shipped product access to an advanced technology that might otherwise be restricted.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/517.html",
                    "external_id": "CAPEC-517"
                },
                {
                    "source_name": "reference_from_CAPEC",
                    "description": "John F. Miller, Supply Chain Attack Framework and Attack Patterns, 2013, The MITRE Corporation",
                    "url": "http://www.mitre.org/sites/default/files/publications/supply-chain-attack-framework-14-0228.pdf",
                    "external_id": "REF-439"
                }
            ],
            "object_marking_refs": [
                "marking-definition--db13c800-5b49-4c0f-b51b-7f0ec4309951"
            ],
            "x_capec_abstraction": "Detailed",
            "x_capec_example_instances": [
                "A product for manufacture exists that contains advanced cryptographic capabilities, including algorithms that are restricted from being shipped to some nations. An attacker from one of the restricted nations alters the documentation to ensure that when the product is manufactured for shipment to a restricted nation, the software compilation steps that normally would prevent the advanced cryptographic capabilities from being included are actually included. When the product is shipped to the attacker's home country, the attacker is able to retrieve and/or use the advanced cryptographic capabilities."
            ],
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_prerequisites": [
                "Advanced knowledge of internal software and hardware components within manufacturer's development environment.",
                "Access to the manufacturer's documentation."
            ],
            "x_capec_skills_required": {
                "High": "Ability to stealthly gain access via remote compromise or physical access to the manufacturer's documentation."
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High"
        }
    ]
}