{
    "type": "bundle",
    "id": "bundle--a052755b-06b1-4d81-b7da-1ca6d5cd737c",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--056a463d-6303-438e-a43f-992cee52fb95",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "created": "2018-07-31T00:00:00.000Z",
            "modified": "2018-07-31T00:00:00.000Z",
            "name": "Use of Captured Hashes (Pass The Hash)",
            "description": "An adversary uses stolen hash values for a user's credentials (username and password) to access systems managed under the same credential framwork that leverage the Lan Man (LM) and/or NT Lan Man (NTLM) authentication protocols. When authenticating via LM or NTLM, the hashed credentials' associated plaintext credentials are not requried for successful authentication. Therefore, if an adversary can obtain the hashed credentials of a user, he can then pass these hash values to the server or service to authenticate without needing to brute-force the hashes to obtain their cleartext values. The adversary can then impersonate the user and laterally move within the network. This technique can be performed against any operating system which leverages the LM or NTLM protocols.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/644.html",
                    "external_id": "CAPEC-644"
                },
                {
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/522.html",
                    "external_id": "CWE-522"
                }
            ],
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "x_capec_abstraction": "Detailed",
            "x_capec_consequences": {
                "Integrity": [
                    "Gain Privileges"
                ]
            },
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_prerequisites": [
                "The adversary needs to first obtain the hashed credentials of a user, via the use of a tool, prior to executing this attack.",
                "The victim system must allow Lan Man or NT Lan Man authentication."
            ],
            "x_capec_skills_required": {
                "High": "The adversary uses a third-party tool to obtain hashed credentials to execute the attack.",
                "Low": "Determine if Lan Man and NT Lan Man authentication is allowed on the server."
            },
            "x_capec_status": "Stable",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.2"
        }
    ]
}