{
    "type": "bundle",
    "id": "bundle--2417d054-b1d1-4b6b-ad89-bc637e6526b5",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--59ba3504-6764-48b4-980a-40e4adff2030",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "created": "2014-06-23T00:00:00.000Z",
            "modified": "2019-04-04T00:00:00.000Z",
            "name": "Manipulation During Distribution",
            "description": "An attacker undermines the integrity of a product, software, or technology at some stage of the distribution channel. The core threat of modification or manipulation during distribution arise from the many stages of distribution, as a product may traverse multiple suppliers and integrators as the final asset is delivered. Components and services provided from a manufacturer to a supplier may be tampered with during integration or packaging.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/439.html",
                    "external_id": "CAPEC-439"
                },
                {
                    "source_name": "reference_from_CAPEC",
                    "description": "Information Technology Laboratory, Supply Chain Risk Management (SCRM), 2010, National Institute of Standards and Technology (NIST)",
                    "external_id": "REF-379"
                },
                {
                    "source_name": "reference_from_CAPEC",
                    "description": "SAFECode, The Software Supply Chain Integrity Framework Defining Risks and Responsibilities for Securing Software in the Global Supply Chain, 2009, Safecode.org",
                    "external_id": "REF-384"
                },
                {
                    "source_name": "reference_from_CAPEC",
                    "description": "Marianne Swanson, Nadya Bartol, Rama Moorthy, Piloting Supply Chain Risk Management Practices for Federal Information Systems (Draft NISTIR 7622), 2010, National Institute of Standards and Technology",
                    "external_id": "REF-382"
                }
            ],
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "x_capec_abstraction": "Meta",
            "x_capec_example_instances": [
                "A malicious OEM provider, or OEM provider employee or contractor, may install software, or modify existing code, during distribution.",
                "External contractors involved in the packaging or testing of products or components may install software, or modify existing code, during distribution."
            ],
            "x_capec_status": "Draft",
            "x_capec_version": "3.2"
        }
    ]
}