{
    "type": "attack-pattern",
    "id": "attack-pattern--c8db3a0f-a213-4034-b53a-90fb6d954557",
    "created_by_ref": "identity--8641df51-0f59-4a4d-a300-7f11ca320ba2",
    "created": "2018-03-05T19:11:07.690Z",
    "modified": "2018-03-05T19:11:07.690Z",
    "name": "Pharming",
    "description": "A pharming attack occurs when the victim is fooled into entering sensitive data into supposedly trusted locations, such as an online bank site or a trading platform. An attacker can impersonate these supposedly trusted sites and have the victim be directed to his site rather than the originally intended one.\nPharming does not require script injection or clicking on malicious links for the attack to succeed.",
    "external_references": [
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/89.html",
            "external_id": "CAPEC-89"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/346.html",
            "external_id": "CWE-346"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/350.html",
            "external_id": "CWE-350"
        }
    ],
    "object_marking_refs": [
        "marking-definition--127d62dd-9993-48ef-9ef1-a9c686da9914"
    ],
    "x_capec_abstraction": "Standard",
    "x_capec_example_instances": [
        "An online bank website requires users to provide their customer ID and password to log on, but does not use a secure connection.\nAn attacker can setup a similar fake site and leverage pharming to collect this information from unknowing victims."
    ],
    "x_capec_likelihood_of_attack": "High",
    "x_capec_prerequisites": [
        "Vulnerable DNS software or improperly protected hosts file or router that can be poisoned",
        "A website that handles sensitive information but does not use a secure connection and a certificate that is valid is also prone to pharming"
    ],
    "x_capec_skills_required": {
        "The attacker needs to be able to poison the resolver - DNS entries or local hosts file or router entry pointing to a trusted DNS server - in order to successfully carry out a pharming attack. Setting up a fake website, identical to the targeted one, does not require special skills.": "Medium"
    },
    "x_capec_typical_severity": "Very High",
    "x_resources_required": "None: No specialized resources are required to execute this type of attack. Having knowledge of the way the target site has been structured, in order to create a fake version, is required. Poisoning the resolver requires knowledge of a vulnerability that can be exploited."
}