{
    "type": "attack-pattern",
    "id": "attack-pattern--c3473165-bc8e-4246-aee0-7e69984b7336",
    "created_by_ref": "identity--d922e967-ff9b-4f27-97e6-2fc5f54aac51",
    "created": "2018-03-05T19:06:11.197Z",
    "modified": "2018-03-05T19:06:11.197Z",
    "name": "Documentation Alteration to Produce Under-performing Systems",
    "description": "An attacker with access to a manufacturer's documentation alters the descriptions of system capabilities with the intent of causing errors in derived system requirements, impacting the overall effectiveness and capability of the system, allowing an attacker to take advantage of the introduced system capability flaw once the system is deployed.",
    "external_references": [
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/518.html",
            "external_id": "CAPEC-518"
        }
    ],
    "object_marking_refs": [
        "marking-definition--068ab041-90bb-4e30-9394-d306c62765a6"
    ],
    "x_capec_abstraction": "Detailed",
    "x_capec_example_instances": [
        "A security subsystem involving encryption is a part of a product, but due to the demands of this subsystem during operation, the subsystem only runs when a specific amount of memory and processing is available. An attacker alters the descriptions of the system capabilities so that when deployed with the minimal requirements at the victim location, the encryption subsystem is never operational, leaving the system in a weakened security state."
    ],
    "x_capec_likelihood_of_attack": "Low",
    "x_capec_prerequisites": [
        "Advanced knowledge of software and hardware capabilities of a manufacturer's product.",
        "Access to the manufacturer's documentation."
    ],
    "x_capec_skills_required": {
        "Ability to stealthly gain access via remote compromise or physical access to the manufacturer's documentation.": "High",
        "Ability to read, interpret, and subsequently alter manufacturer's documentation to misrepresent system capabilities.": "High"
    },
    "x_capec_typical_severity": "High"
}