{
    "type": "bundle",
    "id": "bundle--42a7b4e6-7c19-4787-96cf-dcbb0f786842",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--38b19f2b-a2ea-4ea7-b72d-1ad2efe846ad",
            "created_by_ref": "identity--a310da54-cad2-443b-8371-36e2df91ab5d",
            "created": "2018-05-31T00:00:00.000Z",
            "modified": "2019-04-04T00:00:00.000Z",
            "name": "Replace Binaries",
            "description": "Adversaries know that certain binaries will be regularly executed as part of normal processing. If these binaries are not protected with the appropriate file system permissions, it could be possible to replace them with malware. This malware might be executed at higher system permission levels. A variation of this pattern is to discover self-extracting installation packages that unpack binaries to directories with weak file permissions which it does not clean up appropriately. These binaries can be replaced by malware, which can then be executed.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/642.html",
                    "external_id": "CAPEC-642"
                },
                {
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/732.html",
                    "external_id": "CWE-732"
                }
            ],
            "object_marking_refs": [
                "marking-definition--db13c800-5b49-4c0f-b51b-7f0ec4309951"
            ],
            "x_capec_abstraction": "Detailed",
            "x_capec_example_instances": [
                "The installer for a previous version of Firefox would use a DLL maliciously placed in the default download directory instead of the existing DLL located elsewhere, probably due to DLL hijacking. This DLL would be run with administrator privileges if the installer has those privileges.",
                "By default, the Windows screensaver application SCRNSAVE.exe leverages the scrnsave.scr Portable Executable (PE) file in C:\\Windows\\system32\\. This value is set in the registry at HKEY_CURRENT_USER\\Control Panel\\Desktop, which can be modified by an adversary to instead point to a malicious program. This program would then run any time the SCRNSAVE.exe program is activated and with administrator privileges. An adversary may additionally modify other registry values within the same location to set the SCRNSAVE.exe program to run more frequently."
            ],
            "x_capec_prerequisites": [
                "The attacker must be able to place the malicious binary on the target machine."
            ],
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High"
        }
    ]
}