{
    "type": "bundle",
    "id": "bundle--24d74df7-43eb-4bc8-95c8-40e9fe798791",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--edeabcae-cf0a-4678-ba07-bc6e48a0986f",
            "created_by_ref": "identity--a310da54-cad2-443b-8371-36e2df91ab5d",
            "created": "2014-06-23T00:00:00.000Z",
            "modified": "2015-11-09T00:00:00.000Z",
            "name": "Counterfeit Hardware Component Inserted During Product Assembly",
            "description": "An attacker with either direct access to the product assembly process or to the supply of subcomponents used in the product assembly process introduces counterfeit hardware components into product assembly. The assembly containing the counterfeit components results in a system specifically designed for malicious purposes.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/520.html",
                    "external_id": "CAPEC-520"
                },
                {
                    "source_name": "reference_from_CAPEC",
                    "description": "John F. Miller, Supply Chain Attack Framework and Attack Patterns, 2013, The MITRE Corporation",
                    "url": "http://www.mitre.org/sites/default/files/publications/supply-chain-attack-framework-14-0228.pdf",
                    "external_id": "REF-439"
                }
            ],
            "object_marking_refs": [
                "marking-definition--db13c800-5b49-4c0f-b51b-7f0ec4309951"
            ],
            "x_capec_abstraction": "Detailed",
            "x_capec_example_instances": [
                "A manufacturer of a firewall system requires a hardware card which functions as a multi-jack ethernet card with four ethernet ports. The attacker constructs a counterfeit card that functions normally except that packets from the attacker's network are allowed to bypass firewall processing completely. Once deployed at a victim location, this allows the attacker to bypass the firewall unrestricted."
            ],
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_prerequisites": [
                "The attacker will need either physical access or be able to supply malicious hardware components to the product development facility."
            ],
            "x_capec_skills_required": {
                "High": "Resources to physically infiltrate manufacturer or manufacturer's supplier."
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High"
        }
    ]
}