{
    "type": "bundle",
    "id": "bundle--415af4d9-c854-4ab1-a018-61eec7779386",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--9239258b-07e6-4cb3-a515-13ee9585b45d",
            "created_by_ref": "identity--a310da54-cad2-443b-8371-36e2df91ab5d",
            "created": "2014-06-23T00:00:00.000Z",
            "modified": "2017-05-01T00:00:00.000Z",
            "name": "Communication Channel Manipulation",
            "description": "An adversary manipulates a setting or parameter on communications channel in order to compromise its security. This can result in information exposure, insertion/removal of information from the communications stream, and/or potentially system compromise.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/216.html",
                    "external_id": "CAPEC-216"
                }
            ],
            "object_marking_refs": [
                "marking-definition--db13c800-5b49-4c0f-b51b-7f0ec4309951"
            ],
            "x_capec_abstraction": "Meta",
            "x_capec_consequences": {
                "Confidentiality": [
                    "Read Data (A successful Communication Channel Manipulation attack can result in sensitive information exposure to the adversary, thereby compromising the communication channel's confidentiality.)"
                ],
                "Integrity": [
                    "Read Data (The adversary's injection of additional content into a communication channel negatively impacts the integrity of that channel.)",
                    "Modify Data (The adversary's injection of additional content into a communication channel negatively impacts the integrity of that channel.)",
                    "Other (The adversary's injection of additional content into a communication channel negatively impacts the integrity of that channel.)"
                ]
            },
            "x_capec_prerequisites": [
                "The target application must leverage an open communications channel.",
                "The channel on which the target communicates must be vulnerable to interception (e.g., man in the middle attack)."
            ],
            "x_capec_resources_required": [
                "A tool that is capable of viewing network traffic and generating custom inputs to be used in the attack."
            ],
            "x_capec_status": "Stable"
        }
    ]
}