{
    "type": "bundle",
    "id": "bundle--4ea77d7a-0b3b-4c41-a1b2-16904e12147c",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--30b081a0-bf20-432b-8211-a340bbd04731",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "created": "2014-06-23T00:00:00.000Z",
            "modified": "2018-07-31T00:00:00.000Z",
            "name": "Protocol Analysis",
            "description": "An adversary engages in activities to decipher and/or decode protocol information for a network or application communication protocol used for transmitting information between interconnected nodes or systems on a packet-switched data network. While this type of analysis involves the analysis of a networking protocol inherently, it does not require the presence of an actual or physical network. Although certain techniques for protocol analysis benefit from manipulating live 'on-the-wire' interactions between communicating components, static or dynamic analysis techniques applied to executables as well as to device drivers, such as network interface drivers, can also be used to reveal the function and characteristics of a communication protocol implementation. Depending upon the methods used the process may involve observing, interacting, and modifying actual communications occurring between hosts. The goal of protocol analysis is to derive the data transmission syntax, as well as to extract the meaningful content, including packet or content delimiters used by the protocol. This type of analysis is often performed on closed-specification protocols, or proprietary protocols, but is also useful for analyzing publicly available specifications to determine how particular implementations deviate from published specifications.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/192.html",
                    "external_id": "CAPEC-192"
                },
                {
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/326.html",
                    "external_id": "CWE-326"
                },
                {
                    "source_name": "reference_from_CAPEC",
                    "description": "Wikipedia, The Wikimedia Foundation, Inc",
                    "url": "http://en.wikipedia.org/wiki/Proprietary_protocol",
                    "external_id": "REF-57"
                },
                {
                    "source_name": "reference_from_CAPEC",
                    "description": "Wikipedia, The Wikimedia Foundation, Inc",
                    "url": "http://en.wikipedia.org/wiki/Reverse_engineering",
                    "external_id": "REF-50"
                }
            ],
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "x_capec_abstraction": "Meta",
            "x_capec_consequences": {
                "Confidentiality": [
                    "Read Data (Successful deciphering of protocol information compromises the confidentiality of future sensitive communications.)"
                ],
                "Integrity": [
                    "Modify Data (Modifying communications after successful deciphering of protocol information compromises integrity.)"
                ]
            },
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_prerequisites": [
                "Access to a binary executable.",
                "The ability to observe and interact with a communication channel between communicating processes."
            ],
            "x_capec_resources_required": [
                "Depending on the type of analysis, a variety of tools might be required, such as static code and/or dynamic analysis tools. Alternatively, the effort might require debugging programs such as ollydbg, SoftICE, or disassemblers like IDA Pro. In some instances, packet sniffing or packet analyzing programs such as TCP dump or Wireshark are necessary. Lastly, specific protocol analysis might require tools such as PDB (Protocol Debug), or packet injection tools like pcap or Nemesis."
            ],
            "x_capec_skills_required": {
                "High": "Knowlegde of the Open Systems Interconnection model (OSI model), and famililarity with Wireshark or some other packet analyzer."
            },
            "x_capec_status": "Stable",
            "x_capec_typical_severity": "Low",
            "x_capec_version": "3.2"
        }
    ]
}