{
    "type": "bundle",
    "id": "bundle--ea471a67-8b79-4a42-a622-57a0aaa2bf12",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--bb90461b-f233-44ef-b09e-bc6af67a7796",
            "created_by_ref": "identity--99e72de9-cd42-43b1-906d-c4f855fd3322",
            "created": "2014-06-23T00:00:00.000Z",
            "modified": "2019-04-04T00:00:00.000Z",
            "name": "Malicious Manual Software Update",
            "description": "An attacker introduces malicious code to the victim's system by altering the payload of a software update, allowing for additional compromise or site disruption at the victim location. These manual, or user-assisted attacks, vary from requiring the user to download and run an executable, to as streamlined as tricking the user to click a URL. Attacks which aim at penetrating a specific network infrastructure often rely upon secondary attack methods to achieve the desired impact. Spamming, for example, is a common method employed as an secondary attack vector. Thus the attacker has in his or her arsenal a choice of initial attack vectors ranging from traditional SMTP/POP/IMAP spamming and its varieties, to web-application mechanisms which commonly implement both chat and rich HTML messaging within the user interface.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/533.html",
                    "external_id": "CAPEC-533"
                },
                {
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/494.html",
                    "external_id": "CWE-494"
                }
            ],
            "object_marking_refs": [
                "marking-definition--7af89974-8179-4268-a77a-47d3f7bc1c89"
            ],
            "x_capec_abstraction": "Detailed",
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_prerequisites": [
                "Advanced knowledge about the download and update installation processes.",
                "Advanced knowledge about the deployed system and its various software subcomponents and processes."
            ],
            "x_capec_skills_required": {
                "High": "Able to develop malicious code that can be used on the victim's system while maintaining normal functionality."
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.2"
        }
    ]
}