{
    "type": "attack-pattern",
    "id": "attack-pattern--88c6b17f-7107-4157-b1a9-8e16f711d967",
    "created_by_ref": "identity--2888a06a-5541-4bad-8066-df6f196f70ff",
    "created": "2018-03-05T19:00:36.530Z",
    "modified": "2018-03-05T19:00:36.530Z",
    "name": "AJAX Fingerprinting",
    "description": "This attack utilizes the frequent client-server roundtrips in Ajax conversation to scan a system. While Ajax does not open up new vulnerabilities per se, it does optimize them from an attacker point of view. In many XSS attacks the attacker must get a \"hole in one\" and successfully exploit the vulnerability on the victim side the first time, once the client is redirected the attacker has many chances to engage in follow on probes, but there is only one first chance. In a widely used web application this is not a major problem because 1 in a 1,000 is good enough in a widely used application.\nA common first step for an attacker is to footprint the environment to understand what attacks will work. Since footprinting relies on enumeration, the conversational pattern of rapid, multiple requests and responses that are typical in Ajax applications enable an attacker to look for many vulnerabilities, well-known ports, network locations and so on.",
    "external_references": [
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/85.html",
            "external_id": "CAPEC-85"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/79.html",
            "external_id": "CWE-79"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/113.html",
            "external_id": "CWE-113"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/348.html",
            "external_id": "CWE-348"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/96.html",
            "external_id": "CWE-96"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/20.html",
            "external_id": "CWE-20"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/116.html",
            "external_id": "CWE-116"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/184.html",
            "external_id": "CWE-184"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/86.html",
            "external_id": "CWE-86"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/712.html",
            "external_id": "CWE-712"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/692.html",
            "external_id": "CWE-692"
        }
    ],
    "object_marking_refs": [
        "marking-definition--ad91480b-92ca-4958-92fe-407f4493dcb9"
    ],
    "x_capec_abstraction": "Detailed",
    "x_capec_example_instances": [
        "Footprinting can be executed over almost any protocol including HTTP, TCP, UDP, and ICMP, with the general goal of gaining further information about a host environment to launch further attacks. By appending a malicious script to an otherwise normal looking URL, the attacker can probe the system for banners, vulnerabilities, filenames, available services, and in short anything the host process has access to. The results of the probe are either used to execute additional javascript (for example, if the attackers' footprint script identifies a vulnerability in a firewall permission, then the client side script executes a javascript to change client firewall settings, or an attacker may simply echo the results of the scan back out to a remote host for targeting future attacks)."
    ],
    "x_capec_likelihood_of_attack": "High",
    "x_capec_prerequisites": [
        "The user must allow JavaScript to execute in their browser"
    ],
    "x_capec_skills_required": {
        "To land and launch a script on victim's machine with appropriate footprinting logic for enumerating services and vulnerabilities in JavaScript": "Medium"
    },
    "x_capec_typical_severity": "Very High",
    "x_resources_required": ""
}