{
    "type": "attack-pattern",
    "id": "attack-pattern--b6d67b19-70a7-4514-87ed-51b8872a3797",
    "created_by_ref": "identity--8f6c4831-6b8a-469b-b654-9dcaeede2d35",
    "created": "2018-03-06T15:56:02.394Z",
    "modified": "2018-03-06T15:56:02.394Z",
    "name": "Altered Installed BIOS",
    "description": "An attacker with access to download and update system software sends a maliciously altered BIOS to the victim or victim supplier/integrator, which when installed allows for future exploitation.",
    "external_references": [
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/532.html",
            "external_id": "CAPEC-532"
        }
    ],
    "object_marking_refs": [
        "marking-definition--aee86263-8856-421f-b382-457d8408db7d"
    ],
    "x_capec_abstraction": "Detailed",
    "x_capec_example_instances": [
        "An attacker compromises the download and update portion of a manufacturer's web presence, and develops a malicious BIOS that in addition to the normal functionality will also at a specific time of day disable the remote access subsystem's security checks. The malicious BIOS is put in place on the manufacturer's website, the victim location is sent an official-looking email informing the victim of the availability of a new BIOS with bug fixes and enhanced performance capabilities to entice the victim to install the new BIOS quickly. The malicious BIOS is downloaded and installed on the victim's system, which allows for additional compromise by the attacker."
    ],
    "x_capec_likelihood_of_attack": "Low",
    "x_capec_prerequisites": [
        "Advanced knowledge about the installed target system design.",
        "Advanced knowledge about the download and update installation processes.",
        "Access to the download and update system(s) used to deliver BIOS images."
    ],
    "x_capec_skills_required": {
        "Able to develop a malicious BIOS image with the original functionality as a normal BIOS image, but with added functionality that allows for later compromise and/or disruption.": "High"
    },
    "x_capec_typical_severity": "High"
}