{
    "type": "attack-pattern",
    "id": "attack-pattern--46e06055-828c-44aa-9551-0d62256f77b4",
    "created_by_ref": "identity--8f6c4831-6b8a-469b-b654-9dcaeede2d35",
    "created": "2018-03-06T15:56:00.973Z",
    "modified": "2018-03-06T15:56:00.973Z",
    "name": "XML Schema Poisoning",
    "description": "An attacker corrupts or modifies the content of XML schema information passed between a client and server for the purpose of undermining the security of the target. XML Schemas provide the structure and content definitions for XML documents. Schema poisoning is the ability to manipulate a schema either by replacing or modifying it to compromise the programs that process documents that use this schema. Possible attacks are denial of service attacks by modifying the schema so that it does not contain required information for subsequent processing. For example, the unaltered schema may require a @name attribute in all submitted documents. If the attacker removes this attribute from the schema then documents created using the new grammar may lack this field, which may cause the processing application to enter an unexpected state or record incomplete data. In addition, manipulation of the data types described in the schema may affect the results of calculations taken by the document reader. For example, a float field could be changed to an int field. Finally, the attacker may change the encoding defined in the schema for certain fields allowing the contents to bypass filters that scan for dangerous strings. For example, the modified schema might us a URL encoding instead of ASCII, and a filter that catches a semicolon (;) might fail to detect its URL encoding (%3B).",
    "external_references": [
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/146.html",
            "external_id": "CAPEC-146"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/15.html",
            "external_id": "CWE-15"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/472.html",
            "external_id": "CWE-472"
        }
    ],
    "object_marking_refs": [
        "marking-definition--aee86263-8856-421f-b382-457d8408db7d"
    ],
    "x_capec_abstraction": "Detailed",
    "x_capec_prerequisites": [
        "The schema used by the target application must be improperly secured against unauthorized modification and manipulation."
    ],
    "x_capec_typical_severity": "High",
    "x_resources_required": "Access to the schema and the knowledge and ability modify it. Ability to replace or redirect access to the modified schema."
}