{
    "type": "attack-pattern",
    "id": "attack-pattern--ad2afa59-0ec8-4cb9-a9bb-6e4117598f8b",
    "created_by_ref": "identity--8641df51-0f59-4a4d-a300-7f11ca320ba2",
    "created": "2018-03-05T19:11:06.909Z",
    "modified": "2018-03-05T19:11:06.909Z",
    "name": "Embedding NULL Bytes",
    "description": "An attacker embeds one or more null bytes in input to the target software. This attack relies on the usage of a null-valued byte as a string terminator in many environments. The goal is for certain components of the target software to stop processing the input when it encounters the null byte(s).",
    "external_references": [
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/52.html",
            "external_id": "CAPEC-52"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/158.html",
            "external_id": "CWE-158"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/172.html",
            "external_id": "CWE-172"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/173.html",
            "external_id": "CWE-173"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/171.html",
            "external_id": "CWE-171"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/74.html",
            "external_id": "CWE-74"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/20.html",
            "external_id": "CWE-20"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/697.html",
            "external_id": "CWE-697"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/707.html",
            "external_id": "CWE-707"
        }
    ],
    "object_marking_refs": [
        "marking-definition--127d62dd-9993-48ef-9ef1-a9c686da9914"
    ],
    "x_capec_abstraction": "Detailed",
    "x_capec_consequences": {
        "Run Arbitrary Code": "Execute unauthorized code or commands"
    },
    "x_capec_example_instances": [
        "Directory Browsing\n\tPATH%00\n\tPATH[0x00]\n\tPATH[alternate representation of NULL character]\n\t<script></script>%00\nAssume a Web application allows a user to access a set of reports. The path to the reports directory may be something like web/username/reports. If the username is supplied via a hidden field, an attacker could insert a bogus username such as ../../../../../WINDOWS. If the attacker needs to remove the trailing string /reports, then he can simply insert enough characters so the string is truncated. Alternatively the attacker might apply the postfix NULL character (%00) to determine whether this terminates the string.\nDifferent forms of NULL to think about include",
        "Exploitation of a buffer overflow vulnerability in the ActiveX component packaged with Adobe Systems Inc.'s Acrobat/Acrobat Reader allows remote attackers to execute arbitrary code.\n\tGET /any_existing_dir/any_existing_pdf.pdf%00[long string] HTTP/1.1\nThe problem specifically exists upon retrieving a link of the following form:\n\t0x77F83AE5 MOV EAX,[EDI+8]\n\t0x77F83AE8 MOV ECX,[EDI+C]\n\t...\n\t0x77F83AED MOV [ECX],EAX\nWhere [long string] is a malicious crafted long string containing acceptable URI characters. The request must be made to a web server that truncates the request at the null byte (%00), otherwise an invalid file name is specified and a \"file not found\" page will be returned. Example web servers that truncate the requested URI include Microsoft IIS and Netscape Enterprise. Though the requested URI is truncated for the purposes of locating the file the long string is still passed to the Adobe ActiveX component responsible for rendering the page. This in turn triggers a buffer overflow within RTLHeapFree() allowing for an attacker to overwrite an arbitrary word in memory. The responsible instructions from RTLHeapFree() are shown here:\nThe register EDI contains a pointer to a user-supplied string. The attacker therefore has control over both the ECX and EAX registers used in the shown MOV instruction.\nSuccessful exploitation allows remote attackers to utilize the arbitrary word overwrite to redirect the flow of control and eventually take control of the affected system. Code execution will occur under the context of the user that instantiated the vulnerable version of Adobe Acrobat.\nAn attacker does not need to establish a malicious web site as exploitation can occur by adding malicious content to the end of any embedded link and referencing any Microsoft IIS or Netscape Enterprise web server. Clicking on a direct malicious link is also not required as it may be embedded within an IMAGE tag, an IFRAME or an auto-loading script.\nSuccessful exploitation requires that a payload be written such that certain areas of the input are URI acceptable. This includes initial injected instructions as well as certain overwritten addresses. This increases the complexity of successful exploitation. While not trivial, exploitation is definitely plausible [R.52.2].",
        "Consider the following PHP script:\n\t$whatever = addslashes($_REQUEST['whatever']);\n\tinclude(\"/path/to/program/\" . $whatever . \"/header.htm\");\nA malicious attacker might open the following URL, disclosing the boot.ini file:\n\thttp://localhost/phpscript.php?whatever=../../../../boot.ini%00"
    ],
    "x_capec_likelihood_of_attack": "High",
    "x_capec_prerequisites": [
        "The program does not properly handle postfix NULL terminators"
    ],
    "x_capec_skills_required": {
        "Directory traversal": "Medium",
        "Execution of arbitrary code": "High"
    },
    "x_capec_typical_severity": "High",
    "x_resources_required": ""
}