{
    "type": "bundle",
    "id": "bundle--3fcfd86b-225a-49c9-852a-4210f1824992",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--a45b687b-f8fa-422b-81a5-fb2db0960e5c",
            "created_by_ref": "identity--31f421d4-bb36-4dbf-9dfc-c116a91de14b",
            "created": "2018-03-06T17:19:02.245Z",
            "modified": "2018-03-06T17:19:02.245Z",
            "name": "Manipulate Human Behavior",
            "description": "An adversary exploits inherent human psychological predisposition to influence a targeted individual or group to solicit information or manipulate the target into performing an action that serves the adversary's interests. Many interpersonal social engineering techniques do not involve outright deception, although they can; many are subtle ways of manipulating a target to remove barriers, make the target feel comfortable, and produce an exchange in which the target is either more likely to share information directly, or let key information slip out unintentionally. A skilled adversary uses these techniques when appropriate to produce the desired outcome. Manipulation techniques vary from the overt, such as pretending to be a supervisor to a help desk, to the subtle, such as making the target feel comfortable with the adversary's speech and thought patterns.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/416.html",
                    "external_id": "CAPEC-416"
                }
            ],
            "object_marking_refs": [
                "marking-definition--b345b2a9-b539-4d88-8a9a-1ebcc9f77507"
            ],
            "x_capec_abstraction": "Meta",
            "x_capec_consequences": {
                "Attack patterns that manipulate human behavior can result in a wide variety of consequences and potentially affect the confidentiality, availability, and/or integrity of an application or system.": "\"Varies by context\""
            },
            "x_capec_likelihood_of_attack": "Medium",
            "x_capec_prerequisites": [
                "The adversary must have the means and knowledge of how to communicate with the target in some manner."
            ],
            "x_capec_typical_severity": "Medium"
        }
    ]
}