{
    "type": "bundle",
    "id": "bundle--1f74df02-319f-48bb-a5fc-6b338107b81e",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--1306a81e-65f5-4bfa-b2f7-7a5976c26ccc",
            "created_by_ref": "identity--31f421d4-bb36-4dbf-9dfc-c116a91de14b",
            "created": "2018-03-06T17:19:00.713Z",
            "modified": "2018-03-06T17:19:00.713Z",
            "name": "Interception",
            "description": "An adversary monitors data streams to or from a target in order to gather information. This attack may be undertaken to gather information to support a later attack or the data collected may be the end goal of the attack. This attack usually involves sniffing network traffic, but may include observing other types of data streams, such as radio. In most varieties of this attack, the attacker is passive and simply observes regular communication, however in some variants the attacker may attempt to initiate the establishment of a data stream or influence the nature of the data transmitted. However, in all variants of this attack, and distinguishing this attack from other data collection methods, the attacker is not the intended recipient of the data stream. Unlike some other data leakage attacks, the attacker is observing explicit data channels (e.g. network traffic) and reading the content. This differs from attacks that collect more qualitative information, such as communication volume, or other information not explicitly communicated via a data stream.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/117.html",
                    "external_id": "CAPEC-117"
                },
                {
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/200.html",
                    "external_id": "CWE-200"
                }
            ],
            "object_marking_refs": [
                "marking-definition--b345b2a9-b539-4d88-8a9a-1ebcc9f77507"
            ],
            "x_capec_abstraction": "Meta",
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_prerequisites": [
                "For an interception attack to be possible, the target must be transmitting data over a medium that is accessible to the adversary. Any target that transmits information over a public network is potentially vulnerable to this type of attack."
            ],
            "x_capec_typical_severity": "Medium",
            "x_resources_required": "The attacker must have the necessary technology to intercept information passing between the nodes of a network. For TCP/IP, the capability to run tcpdump, ethereal, etc. can be useful. Depending upon the data being targeted the technological requirements will change."
        }
    ]
}