{
    "type": "attack-pattern",
    "id": "attack-pattern--deaac6fe-a7b2-4287-a183-e7bee5ed5533",
    "created_by_ref": "identity--8641df51-0f59-4a4d-a300-7f11ca320ba2",
    "created": "2018-03-05T19:11:05.797Z",
    "modified": "2018-03-05T19:11:05.797Z",
    "name": "Lifting Sensitive Data Embedded in Cache",
    "description": "An attacker examines a target application's cache for sensitive information. Many applications that communicate with remote entities or which perform intensive calculations utilize caches to improve efficiency. However, if the application computes or receives sensitive information and the cache is not appropriately protected, an attacker can browse the cache and retrieve this information. This can result in the disclosure of sensitive information.",
    "external_references": [
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/204.html",
            "external_id": "CAPEC-204"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/524.html",
            "external_id": "CWE-524"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/311.html",
            "external_id": "CWE-311"
        }
    ],
    "object_marking_refs": [
        "marking-definition--127d62dd-9993-48ef-9ef1-a9c686da9914"
    ],
    "x_capec_abstraction": "Detailed",
    "x_capec_prerequisites": [
        "The target application must store sensitive information in a cache.",
        "The cache must be inadequately protected against attacker access."
    ],
    "x_capec_typical_severity": "Medium",
    "x_resources_required": "The attacker must be able to reach the target application's cache. This may require prior access to the machine on which the target application runs. If the cache is encrypted, the attacker would need sufficient computational resources to crack the encryption. With strong encryption schemes, doing this could be intractable, but weaker encryption schemes could allow an attacker with sufficient resources to read the file."
}