{
    "type": "bundle",
    "id": "bundle--642c88f2-d61b-4e3b-ba88-efc07b7fabfd",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--cde07b71-23e6-418d-93e9-665f5f83b032",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "created": "2014-06-23T00:00:00.000Z",
            "modified": "2019-04-04T00:00:00.000Z",
            "name": "Parameter Injection",
            "description": "An adversary manipulates the content of request parameters for the purpose of undermining the security of the target. Some parameter encodings use text characters as separators. For example, parameters in a HTTP GET message are encoded as name-value pairs separated by an ampersand (&). If an attacker can supply text strings that are used to fill in these parameters, then they can inject special characters used in the encoding scheme to add or modify parameters. For example, if user input is fed directly into an HTTP GET request and the user provides the value \"myInput&new_param=myValue\", then the input parameter is set to myInput, but a new parameter (new_param) is also added with a value of myValue. This can significantly change the meaning of the query that is processed by the server. Any encoding scheme where parameters are identified and separated by text characters is potentially vulnerable to this attack - the HTTP GET encoding used above is just one example.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/137.html",
                    "external_id": "CAPEC-137"
                },
                {
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/88.html",
                    "external_id": "CWE-88"
                }
            ],
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "x_capec_abstraction": "Meta",
            "x_capec_consequences": {
                "Integrity": [
                    "Modify Data (Successful parameter injection attacks mean a compromise to integrity of the application.)"
                ]
            },
            "x_capec_likelihood_of_attack": "Medium",
            "x_capec_prerequisites": [
                "The target application must use a parameter encoding where separators and parameter identifiers are expressed in regular text.",
                "The target application must accept a string as user input, fail to sanitize characters that have a special meaning in the parameter encoding, and insert the user-supplied string in an encoding which is then processed."
            ],
            "x_capec_resources_required": [
                "None: No specialized resources are required to execute this type of attack. The only requirement is the ability to provide string input to the target."
            ],
            "x_capec_status": "Stable",
            "x_capec_typical_severity": "Medium",
            "x_capec_version": "3.2"
        }
    ]
}