{
    "type": "bundle",
    "id": "bundle--99a3c218-fc0f-48f4-8cf0-df62cbfea78a",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--42f47196-29e5-4cae-9469-33e051b2ab39",
            "created_by_ref": "identity--a310da54-cad2-443b-8371-36e2df91ab5d",
            "created": "2014-06-23T00:00:00.000Z",
            "modified": "2017-08-04T00:00:00.000Z",
            "name": "Manipulating Hidden Fields",
            "description": "An adversary exploits a weakness in the server's trust of client-side processing by modifying data on the client-side, such as price information, and then submitting this data to the server, which processes the modified data. For example, eShoplifting is a data manipulation attack against an on-line merchant during a purchasing transaction. The manipulation of price, discount or quantity fields in the transaction message allows the adversary to acquire items at a lower cost than the merchant intended. The adversary performs a normal purchasing transaction but edits hidden fields within the HTML form response that store price or other information to give themselves a better deal. The merchant then uses the modified pricing information in calculating the cost of the selected items.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/162.html",
                    "external_id": "CAPEC-162"
                },
                {
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/602.html",
                    "external_id": "CWE-602"
                }
            ],
            "object_marking_refs": [
                "marking-definition--db13c800-5b49-4c0f-b51b-7f0ec4309951"
            ],
            "x_capec_abstraction": "Detailed",
            "x_capec_prerequisites": [
                "The targeted site must contain hidden fields to be modified.",
                "The targeted site must not validate the hidden fields with backend processing."
            ],
            "x_capec_resources_required": [
                "The adversary must have the ability to modify hidden fields by editing the HTTP response to the server."
            ],
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High"
        }
    ]
}