{
    "type": "attack-pattern",
    "id": "attack-pattern--5eea6f24-b955-4692-adc1-f1bfb75c87bc",
    "created_by_ref": "identity--8641df51-0f59-4a4d-a300-7f11ca320ba2",
    "created": "2018-03-05T19:11:07.260Z",
    "modified": "2018-03-05T19:11:07.260Z",
    "name": "Session Fixation",
    "description": "The attacker induces a client to establish a session with the target software using a session identifier provided by the attacker. Once the user successfully authenticates to the target software, the attacker uses the (now privileged) session identifier in their own transactions. This attack leverages the fact that the target software either relies on client-generated session identifiers or maintains the same session identifiers after privilege elevation.",
    "external_references": [
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/61.html",
            "external_id": "CAPEC-61"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/384.html",
            "external_id": "CWE-384"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/361.html",
            "external_id": "CWE-361"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/664.html",
            "external_id": "CWE-664"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/732.html",
            "external_id": "CWE-732"
        }
    ],
    "object_marking_refs": [
        "marking-definition--127d62dd-9993-48ef-9ef1-a9c686da9914"
    ],
    "x_capec_abstraction": "Detailed",
    "x_capec_example_instances": [
        "Consider a banking application that issues a session identifier in the URL to a user before login, and uses the same identifier to identify the customer following successful authentication. An attacker can easily leverage session fixation to access a victim's account by having the victim click on a forged link that contains a valid session identifier from a trapped session setup by the attacker. Once the victim is authenticated, the attacker can take over the session and continue with the same levels of privilege as the victim.",
        "An attacker can hijack user sessions, bypass authentication controls and possibly gain administrative privilege by fixating the session of a user authenticating to the Management Console on certain versions of Macromedia JRun 4.0. This can be achieved by setting the session identifier in the user's browser and having the user authenticate to the Management Console. Session fixation is possible since the application server does not regenerate session identifiers when there is a change in the privilege levels."
    ],
    "x_capec_likelihood_of_attack": "Medium",
    "x_capec_prerequisites": [
        "Session identifiers that remain unchanged when the privilege levels change.",
        "Permissive session management mechanism that accepts random user-generated session identifiers",
        "Predictable session identifiers"
    ],
    "x_capec_skills_required": {
        "Only basic skills are required to determine and fixate session identifiers in a user's browser. Subsequent attacks may require greater skill levels depending on the attackers' motives.": "Low"
    },
    "x_capec_typical_severity": "High",
    "x_resources_required": "None: No specialized resources are required to execute this type of attack."
}