{
    "type": "bundle",
    "id": "bundle--5e1be880-0880-4a85-bf17-ba7a0f8b2c7a",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--4705ef65-afbf-4073-80a0-ed2d4dc9268c",
            "created_by_ref": "identity--31f421d4-bb36-4dbf-9dfc-c116a91de14b",
            "created": "2018-03-06T17:19:01.110Z",
            "modified": "2018-03-06T17:19:01.110Z",
            "name": "Action Spoofing",
            "description": "An adversary is able to disguise one action for another and therefore trick a user into initiating one type of action when they intend to initiate a different action. For example, a user might be led to believe that clicking a button will submit a query, but in fact it downloads software. Adversaries may perform this attack through social means, such as by simply convincing a victim to perform the action or relying on a user's natural inclination to do so, or through technical means, such as a clickjacking attack where a user sees one interface but is actually interacting with a second, invisible, interface.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/173.html",
                    "external_id": "CAPEC-173"
                }
            ],
            "object_marking_refs": [
                "marking-definition--b345b2a9-b539-4d88-8a9a-1ebcc9f77507"
            ],
            "x_capec_abstraction": "Meta",
            "x_capec_consequences": {
                "Action spoofing can result in a wide variety of consequences and negatively affect all three elements of the security triad.": "\"Varies by context\""
            },
            "x_capec_likelihood_of_attack": "High",
            "x_capec_prerequisites": [
                "The adversary must convince the victim into performing the decoy action.",
                "The adversary must have the means to control a user's interface to present them with a decoy action as well as the actual malicious action. Simple versions of this attack can be performed using web pages requiring only that the adversary be able to host (or control) content that the user visits."
            ],
            "x_capec_typical_severity": "Very High"
        }
    ]
}