{
    "type": "attack-pattern",
    "id": "attack-pattern--cf7f16f6-6a48-4481-99d7-ef55b0cf70bf",
    "created_by_ref": "identity--8641df51-0f59-4a4d-a300-7f11ca320ba2",
    "created": "2018-03-05T19:11:06.920Z",
    "modified": "2018-03-05T19:11:06.920Z",
    "name": "Malicious Software Implanted",
    "description": "An attacker implants malicious software into the system in the supply chain distribution channel, with purpose of causing malicious disruption or allowing for additional compromise when the system is deployed.",
    "external_references": [
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/523.html",
            "external_id": "CAPEC-523"
        }
    ],
    "object_marking_refs": [
        "marking-definition--127d62dd-9993-48ef-9ef1-a9c686da9914"
    ],
    "x_capec_abstraction": "Standard",
    "x_capec_example_instances": [
        "An attacker has created a piece of malicious software designed to function as a backdoor in a system that is to be deployed at the victim location. During shipment of the system, the attacker has physical access to the system at a loading dock of an integrator for a short time. The attacker unpacks and powers up the system and installs the malicious piece of software, and configures it to run upon system boot. The system is repackaged and returned to its place on the loading dock, and is shipped and installed at the victim location with the malicious software in place, allowing the attacker to bypass firewalls and remotely gain access to the victim's network for further malicious activities."
    ],
    "x_capec_likelihood_of_attack": "Low",
    "x_capec_prerequisites": [
        "Physical access to the system after it has left the manufacturer but before it is deployed at the victim location."
    ],
    "x_capec_skills_required": {
        "Malicious software creation.": "High",
        "Advanced knowledge of the design of the system and it's operating system components and subcomponents.": "High"
    },
    "x_capec_typical_severity": "High"
}