{
    "type": "attack-pattern",
    "id": "attack-pattern--599ee194-1abf-47c8-b38d-d70cc07f0630",
    "created_by_ref": "identity--2888a06a-5541-4bad-8066-df6f196f70ff",
    "created": "2018-03-05T19:00:35.683Z",
    "modified": "2018-03-05T19:00:35.683Z",
    "name": "SaaS User Request Forgery",
    "description": "An adversary, through a previously installed malicious application, performs malicious actions against a third-party Software as a Service (SaaS) application (also known as a cloud based application) by leveraging the persistent and implicit trust placed on a trusted user's session. This attack is executed after a trusted user is authenticated into a cloud service, \"piggy-backing\" on the authenticated session, and exploiting the fact that the cloud service believes it is only interacting with the trusted user. If successful, the actions embedded in the malicious application will be processed and accepted by the targeted SaaS application and executed at the trusted user's privilege level.",
    "external_references": [
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/510.html",
            "external_id": "CAPEC-510"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/346.html",
            "external_id": "CWE-346"
        }
    ],
    "object_marking_refs": [
        "marking-definition--ad91480b-92ca-4958-92fe-407f4493dcb9"
    ],
    "x_capec_abstraction": "Standard",
    "x_capec_likelihood_of_attack": "High",
    "x_capec_prerequisites": [
        "An adversary must be able install a purpose built malicious application onto the trusted user's system and convince the user to execute it while authenticated to the SaaS application."
    ],
    "x_capec_skills_required": {
        "This attack pattern often requires the technical ability to modify a malicious software package (e.g. Zeus) to spider a targeted site and a way to trick a user into a malicious software download.": "Medium"
    },
    "x_capec_typical_severity": "Medium"
}