{
    "type": "bundle",
    "id": "bundle--3342fae3-d4ce-4527-b5d4-9f218fe6ccdc",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--2f380278-70fd-4947-a13a-f77a5dab71aa",
            "created_by_ref": "identity--31f421d4-bb36-4dbf-9dfc-c116a91de14b",
            "created": "2018-03-06T17:19:01.851Z",
            "modified": "2018-03-06T17:19:01.851Z",
            "name": "Traceroute Route Enumeration",
            "description": "An attacker uses a traceroute utility to map out the route which data flows through the network in route to a target destination. Tracerouting can allow an attacker to construct a working topology of systems and routers by listing the systems through which data passes through on their way to the targeted machine. This attack can return varied results depending upon the type of traceroute that is performed. Traceroute works by sending packets to a target while incrementing the Time-to-Live field in the packet header. As the packet traverses each hop along its way to the destination, its TTL expires generating an ICMP diagnostic message that identifies where the packet expired. Traditional techniques for tracerouting involved the use of ICMP and UDP. As more firewalls began to filter ingress ICMP, methods of traceroute using TCP were developed",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/293.html",
                    "external_id": "CAPEC-293"
                }
            ],
            "object_marking_refs": [
                "marking-definition--b345b2a9-b539-4d88-8a9a-1ebcc9f77507"
            ],
            "x_capec_abstraction": "Detailed",
            "x_capec_prerequisites": [
                "A network capable of routing the attackers' packets to the destination network."
            ],
            "x_capec_typical_severity": "Low",
            "x_resources_required": "A command line version of traceroute or similar tool that performs route enumeration."
        }
    ]
}