{
    "type": "bundle",
    "id": "bundle--d60d6caa-f372-4801-8f60-5a8af4e41f36",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--965d88fd-a632-4960-b4ba-7521878a0ba3",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "created": "2015-11-09T00:00:00.000Z",
            "modified": "2017-08-04T00:00:00.000Z",
            "name": "Fault Injection",
            "description": "The adversary uses disruptive signals or events (e.g. electromagnetic pulses, laser pulses, clock glitches, etc.) to cause faulty behavior in electronic devices. When performed in a controlled manner on devices performing cryptographic operations, this faulty behavior can be exploited to derive secret key information.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/624.html",
                    "external_id": "CAPEC-624"
                }
            ],
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "x_capec_abstraction": "Meta",
            "x_capec_alternate_terms": [
                "Side-Channel Attack"
            ],
            "x_capec_consequences": {
                "Confidentiality": [
                    "Read Data (An adversary capable of successfully collecting and analyzing sensitive, fault/side-channel information, he or she has compromised the confidentiality of that application or information system data.)",
                    "Bypass Protection Mechanism (An adversary capable of successfully collecting and analyzing sensitive, fault/side-channel information, he or she has compromised the confidentiality of that application or information system data.)",
                    "Hide Activities (An adversary capable of successfully collecting and analyzing sensitive, fault/side-channel information, he or she has compromised the confidentiality of that application or information system data.)"
                ],
                "Integrity": [
                    "Execute Unauthorized Commands (If an adversary is able to inject data via a fault or side channel vulnerability towards malicious ends, the integrity of the application or information system will be compromised.)"
                ]
            },
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_prerequisites": [
                "Physical access to the system",
                "The adversary must be cognizant of where fault injection vulnerabilities exist in the system in order to leverage them for exploitation."
            ],
            "x_capec_resources_required": [
                "\n               <xhtml:p>The relevant sensors and tools to detect and analyze fault/side-channel data from a system.</xhtml:p>\n               <xhtml:p>A tool capable of injecting fault/side-channel data into a system or application.</xhtml:p>\n            "
            ],
            "x_capec_skills_required": {
                "High": "Adversaries require non-trivial technical skills to create and implement fault injection attacks. Although this style of attack has become easier (commercial equipment and training classes are available to perform these attacks), they usual require significant setup and experimentation time during which physical access to the device is required."
            },
            "x_capec_status": "Stable",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.2"
        }
    ]
}