{
    "type": "attack-pattern",
    "id": "attack-pattern--5a99563f-f7d7-42ad-bc0b-4f7033da56b1",
    "created_by_ref": "identity--d922e967-ff9b-4f27-97e6-2fc5f54aac51",
    "created": "2018-03-05T19:06:10.611Z",
    "modified": "2018-03-05T19:06:10.611Z",
    "name": "HTTP Request Smuggling",
    "description": "HTTP Request Smuggling results from the discrepancies in parsing HTTP requests between HTTP entities such as web caching proxies or application firewalls. Entities such as web servers, web caching proxies, application firewalls or simple proxies often parse HTTP requests in slightly different ways. Under specific situations where there are two or more such entities in the path of the HTTP request, a specially crafted request is seen by two attacked entities as two different sets of requests. This allows certain requests to be smuggled through to a second entity without the first one realizing it.",
    "external_references": [
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/33.html",
            "external_id": "CAPEC-33"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/444.html",
            "external_id": "CWE-444"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/436.html",
            "external_id": "CWE-436"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/707.html",
            "external_id": "CWE-707"
        }
    ],
    "object_marking_refs": [
        "marking-definition--068ab041-90bb-4e30-9394-d306c62765a6"
    ],
    "x_capec_abstraction": "Detailed",
    "x_capec_consequences": {
        "Run Arbitrary Code": "Execute unauthorized code or commands"
    },
    "x_capec_example_instances": [
        "When using Sun Java System Web Proxy Server 3.x or 4.x in conjunction with Sun ONE/iPlanet 6.x, Sun Java System Application Server 7.x or 8.x, it is possible to bypass certain application firewall protections, hijack web sessions, perform Cross Site Scripting or poison the web proxy cache using HTTP Request Smuggling. Differences in the way HTTP requests are parsed by the Proxy Server and the Application Server enable malicious requests to be smuggled through to the Application Server, thereby exposing the Application Server to aforementioned attacks.",
        "Apache server 2.0.45 and version before 1.3.34, when used as a proxy, easily lead to web cache poisoning and bypassing of application firewall restrictions because of non-standard HTTP behavior. Although the HTTP/1.1 specification clearly states that a request with both \"Content-Length\" and a \"Transfer-Encoding: chunked\" headers is invalid, vulnerable versions of Apache accept such requests and reassemble the ones with \"Transfer-Encoding: chunked\" header without replacing the existing \"Content-Length\" header or adding its own. This leads to HTTP Request Smuggling using a request with a chunked body and a header with \"Content-Length: 0\"."
    ],
    "x_capec_likelihood_of_attack": "Medium",
    "x_capec_prerequisites": [
        "An additional HTTP entity such as an application firewall or a web caching proxy between the attacker and the second entity such as a web server",
        "Differences in the way the two HTTP entities parse HTTP requests"
    ],
    "x_capec_skills_required": {
        "The attacker has to have detailed knowledge of the HTTP protocol specifics and must also possess exact details on the discrepancies between the two targeted entities in parsing HTTP requests.": "High"
    },
    "x_capec_typical_severity": "High",
    "x_resources_required": "None: No specialized resources are required to execute this type of attack."
}