{
    "type": "bundle",
    "id": "bundle--044b2cff-16a0-43b3-8016-8643b71a35bc",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--55946915-0a5f-4acb-b3af-c997a8ff501e",
            "created_by_ref": "identity--a310da54-cad2-443b-8371-36e2df91ab5d",
            "created": "2018-07-31T00:00:00.000Z",
            "modified": "2019-04-04T00:00:00.000Z",
            "name": "Inclusion of Code in Existing Process",
            "description": "The adversary takes advantage of a bug in an application failing to verify the integrity of the running process to execute arbitrary code in the address space of a separate live process. The adversary could use running code in the context of another process to try to access process's memory, system/network resources, etc. The goal of this attack is to evade detection defenses and escalate privileges by masking the malicious code under an existing legitimate process. Examples of approaches include but not limited to: dynamic-link library (DLL) injection, portable executable injection, thread execution hijacking, ptrace system calls, VDSO hijacking, and more.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/640.html",
                    "external_id": "CAPEC-640"
                }
            ],
            "object_marking_refs": [
                "marking-definition--db13c800-5b49-4c0f-b51b-7f0ec4309951"
            ],
            "x_capec_abstraction": "Detailed",
            "x_capec_consequences": {
                "Confidentiality": [
                    "Execute Unauthorized Commands",
                    "Read Data"
                ],
                "Integrity": [
                    "Execute Unauthorized Commands",
                    "Read Data"
                ]
            },
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_prerequisites": [
                "The targeted application fails to verify the integrity of the running process that allows an adversary to execute arbitrary code."
            ],
            "x_capec_skills_required": {
                "High": "Knowledge of how to load malicious code into the memory space of a running process, as well as the ability to have the running process execute this code. For example, with DLL injection, the adversary must know how to load a DLL into the memory space of another running process, and cause this process to execute the code inside of the DLL."
            },
            "x_capec_status": "Stable",
            "x_capec_typical_severity": "High"
        }
    ]
}