{
    "type": "bundle",
    "id": "bundle--0d2be3e2-336c-40ab-8f72-038353cc80be",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--77baff26-86fd-4ee7-bb6b-b8c5781c4c9f",
            "created_by_ref": "identity--a310da54-cad2-443b-8371-36e2df91ab5d",
            "created": "2017-01-12T00:00:00.000Z",
            "modified": "2019-04-04T00:00:00.000Z",
            "name": "Terrestrial Jamming",
            "description": "In this attack pattern, the adversary transmits disruptive signals in the direction of the target consumer-level satellite dish (as opposed to the satellite itself). The transmission disruption occurs in a more targeted range. Portable terrestrial jammers have a range of 3-5 kilometers in urban areas and 20 kilometers in rural areas. This technique requires a terrestrial jammer that is more powerful than the frequencies sent from the satellite.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/599.html",
                    "external_id": "CAPEC-599"
                },
                {
                    "source_name": "reference_from_CAPEC",
                    "description": "Small Media, Satellite Jamming in Iran: A War over Airwaves, 2012--11",
                    "external_id": "REF-462"
                }
            ],
            "object_marking_refs": [
                "marking-definition--db13c800-5b49-4c0f-b51b-7f0ec4309951"
            ],
            "x_capec_abstraction": "Detailed",
            "x_capec_consequences": {
                "Availability": [
                    "Other (A successful attack will deny, degrade, or disrupt availability of satellite communications for the target by overwhelming its resources to accurately receive authorized transmissions.)"
                ]
            },
            "x_capec_example_instances": [
                "An attempt to deceive a GPS receiver by broadcasting counterfeit GPS signals, structured to resemble a set of normal GPS signals. These jamming signals may be structured in such a way as to cause the receiver to estimate its position to be somewhere other than where it actually is, or to be located where it is but at a different time, as determined by the adversary."
            ],
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_resources_required": [
                "\n               <xhtml:p>A terrestrial satellite jammer with a signal more powerful than that of the satellite attempting to communicate with the target.</xhtml:p>\n               <xhtml:p>The adversary must know the location of the target satellite dish.</xhtml:p>\n            "
            ],
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High"
        }
    ]
}