{
    "type": "attack-pattern",
    "id": "attack-pattern--15cf4475-43b3-4bb9-82ca-d40a3b1d7f4a",
    "created_by_ref": "identity--d922e967-ff9b-4f27-97e6-2fc5f54aac51",
    "created": "2018-03-05T19:06:10.383Z",
    "modified": "2018-03-05T19:06:10.383Z",
    "name": "Leveraging Race Conditions via Symbolic Links",
    "description": "This attack leverages the use of symbolic links (Symlinks) in order to write to sensitive files. An attacker can create a Symlink link to a target file not otherwise accessible to her. When the privileged program tries to create a temporary file with the same name as the Symlink link, it will actually write to the target file pointed to by the attackers' Symlink link. If the attacker can insert malicious content in the temporary file she will be writing to the sensitive file by using the Symlink. The race occurs because the system checks if the temporary file exists, then creates the file. The attacker would typically create the Symlink during the interval between the check and the creation of the temporary file.",
    "external_references": [
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/27.html",
            "external_id": "CAPEC-27"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/367.html",
            "external_id": "CWE-367"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/61.html",
            "external_id": "CWE-61"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/662.html",
            "external_id": "CWE-662"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/689.html",
            "external_id": "CWE-689"
        },
        {
            "source_name": "cwe",
            "url": "http://cwe.mitre.org/data/definitions/667.html",
            "external_id": "CWE-667"
        }
    ],
    "object_marking_refs": [
        "marking-definition--068ab041-90bb-4e30-9394-d306c62765a6"
    ],
    "x_capec_abstraction": "Detailed",
    "x_capec_consequences": {
        "Denial of Service": "DoS: resource consumption (other)"
    },
    "x_capec_example_instances": [
        "In this naive example, the Unix program foo is setuid. Its function is to retrieve information for the accounts specified by the user. For \"efficiency,\" it sorts the requested accounts into a temporary file (/tmp/foo naturally) before making the queries.\nThe directory /tmp is world-writable. Malicious user Mallory creates a symbolic link to the file /.rhosts named /tmp/foo. Then, she invokes foo with + + as the requested account. The program creates the (temporary) file /tmp/foo (really creating /.rhosts) and puts the requested account (+ +) in it. It removes the temporary file (merely removing the symbolic link).\nNow the /.rhosts contains + +, which is the incantation necessary to allow anyone to use rlogin to log into the computer as the superuser.\n[R.27.1]",
        "GNU ed before 0.3 allows local users to overwrite arbitrary files via a symlink attack on temporary files, possibly in the open_sbuf function.",
        "OpenmosixCollector and OpenMosixView in OpenMosixView 1.5 allow local users to overwrite or delete arbitrary files via a symlink attack on (1) temporary files in the openmosixcollector directory or (2) nodes.tmp.",
        "Setuid product allows file reading by replacing a file being edited with a symlink to the targeted file, leaking the result in error messages when parsing fails."
    ],
    "x_capec_likelihood_of_attack": "Medium",
    "x_capec_prerequisites": [
        "The attacker is able to create Symlink links on the target host.",
        "Tainted data from the attacker is used and copied to temporary files.",
        "The target host does insecure temporary file creation."
    ],
    "x_capec_skills_required": {
        "This attack is sophisticated because the attacker has to overcome a few challenges such as creating symlinks on the target host during a precise timing, inserting malicious data in the temporary file and have knowledge about the temporary files created (file name and function which creates them).": "Medium"
    },
    "x_capec_typical_severity": "High",
    "x_resources_required": ""
}