{
    "type": "bundle",
    "id": "bundle--081b6bdd-6a06-4f2b-9350-73c1a25543d7",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--ccee5dab-d84a-4897-87a0-a192a28b2038",
            "created_by_ref": "identity--a310da54-cad2-443b-8371-36e2df91ab5d",
            "created": "2015-11-09T00:00:00.000Z",
            "modified": "2019-04-04T00:00:00.000Z",
            "name": "Cellular Traffic Intercept",
            "description": "Cellular traffic for voice and data from mobile devices and retransmission devices can be intercepted via numerous methods. Malicious actors can deploy their own cellular tower equipment and intercept cellular traffic surreptitiously. Additionally, government agencies of adversaries and malicious actors can intercept cellular traffic via the telecommunications backbone over which mobile traffic is transmitted.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/609.html",
                    "external_id": "CAPEC-609"
                },
                {
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/311.html",
                    "external_id": "CWE-311"
                }
            ],
            "object_marking_refs": [
                "marking-definition--db13c800-5b49-4c0f-b51b-7f0ec4309951"
            ],
            "x_capec_abstraction": "Detailed",
            "x_capec_consequences": {
                "Confidentiality": [
                    "Read Data (Capture all cellular and RF traffic from mobile and retransmission devices. Move bulk traffic capture to storage area for cryptanalysis of encrypted traffic, and telemetry analysis of non-encrypted data. (packet headers, cellular power data, signal strength, etc.))"
                ]
            },
            "x_capec_prerequisites": [
                "None"
            ],
            "x_capec_skills_required": {
                "Medium": "Adversaries can purchase hardware and software solutions, or create their own solutions, to capture/intercept cellular radio traffic. The cost of a basic Base Transceiver Station (BTS) to broadcast to local mobile cellular radios in mobile devices has dropped to very affordable costs. The ability of commercial cellular providers to monitor for “rogue” BTS stations is poor in many areas and it is assumed that “rogue” BTS stations exist in urban areas."
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Low"
        }
    ]
}