{
    "type": "bundle",
    "id": "bundle--1ccec567-f86e-43e5-9d00-7972668c4666",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--6b7e666b-a6e8-4e9a-9f62-48cd500b2f79",
            "created_by_ref": "identity--31f421d4-bb36-4dbf-9dfc-c116a91de14b",
            "created": "2018-03-06T17:19:01.934Z",
            "modified": "2018-03-06T17:19:01.934Z",
            "name": "Scanning for Vulnerable Software",
            "description": "An attacker engages in scanning activity to find vulnerable software versions or types, such as operating system versions or network services. Vulnerable or exploitable network configurations, such as improperly firewalled systems, or misconfigured systems in the DMZ or external network, provide windows of opportunity for an attacker. Common types of vulnerable software include unpatched operating systems or services (e.g FTP, Telnet, SMTP, SNMP) running on open ports that the attacker has identified. Attackers usually begin probing for vulnerable software once the external network has been port scanned and potential targets have been revealed.",
            "external_references": [
                {
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/310.html",
                    "external_id": "CAPEC-310"
                }
            ],
            "object_marking_refs": [
                "marking-definition--b345b2a9-b539-4d88-8a9a-1ebcc9f77507"
            ],
            "x_capec_abstraction": "Detailed",
            "x_capec_prerequisites": [
                "Access to the network on which the targeted system resides.",
                "Software tools used to probe systems over a range of ports and protocols."
            ],
            "x_capec_skills_required": {
                "To probe a system remotely without detection requires careful planning and patience.": "Medium"
            },
            "x_capec_typical_severity": "Low",
            "x_resources_required": "Probing requires the ability to interactively send and receive data from a target, whereas passive listening requires a sufficient understanding of the protocol to analyze a preexisting channel of communication."
        }
    ]
}