{
    "type": "attack-pattern",
    "id": "attack-pattern--5ed33e2f-6323-4c1b-a908-d744fbc049b6",
    "created_by_ref": "identity--8f6c4831-6b8a-469b-b654-9dcaeede2d35",
    "created": "2018-03-06T15:56:02.004Z",
    "modified": "2018-03-06T15:56:02.004Z",
    "name": "Influence Perception of Reciprocation",
    "description": "An adversary uses a social engineering techniques to produce a sense of obligation in the target to perform a certain action or concede some sensitive or key piece of information. Obligation has to do with actions one feels they need to take due to some sort of social, legal, or moral requirement, duty, contract, or promise. There are various techniques for fostering a sense of obligation to reciprocate or concede during ordinary modes of communication. One method is to compliment the target, and follow up the compliment with a question. If performed correctly the target may volunteer a key piece of information, sometimes involuntarily. ",
    "external_references": [
        {
            "source_name": "capec",
            "url": "https://capec.mitre.org/data/definitions/418.html",
            "external_id": "CAPEC-418"
        }
    ],
    "object_marking_refs": [
        "marking-definition--aee86263-8856-421f-b382-457d8408db7d"
    ],
    "x_capec_abstraction": "Detailed",
    "x_capec_consequences": {
        "Attacks that influence the perception of the target can result in a wide variety of consequences and negatively affect potentially the confidentiality, availability, and/or integrity of an application or system.": "\"Varies by context\""
    },
    "x_capec_example_instances": [
        "An adversary develops a relationship with the target to foster a feeling of obligation in them to perform a certain action or concede some information. A perception of obligation/concession means that the target feels they need to behave in some way or perform some sort of action due to being morally or legally bound to do so."
    ],
    "x_capec_likelihood_of_attack": "Medium",
    "x_capec_prerequisites": [
        "The adversary must have the means and knowledge of how to communicate with the target in some manner."
    ],
    "x_capec_skills_required": {
        "The adversary requires strong inter-personal and communication skills.": "Low"
    },
    "x_capec_typical_severity": "Medium",
    "x_resources_required": "None: No specialized resources are required to execute this type of attack."
}