{
    "objects": [
        {
            "name": "Determine centralization of IT management",
            "created": "2017-12-14T16:46:06.044Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "description": "Determining if a \"corporate\" help desk exists, the degree of access and control it has, and whether there are \"edge\" units that may have different support processes and standards. (Citation: SANSCentratlizeManagement)\n\nDetectable by Common Defenses: No\n\nDetectable by Common Defenses explanation: No technical means to detect an adversary collecting information about a target.  Any detection would be based upon strong OPSEC policy implementation.\n\nDifficulty for the Adversary: Yes\n\nDifficulty for the Adversary explanation: Requires an adversary to undergo a research process to learn the internal workings of an organization.  An adversary can do this by social engineering individuals in the company by claiming to need to find information for the help desk, or through social engineering of former employees or business partners.",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-pre-attack",
                    "phase_name": "organizational-information-gathering"
                }
            ],
            "external_references": [
                {
                    "url": "https://attack.mitre.org/pre-attack/index.php/Technique/PRE-T1062",
                    "source_name": "mitre-pre-attack",
                    "external_id": "PRE-T1062"
                },
                {
                    "description": "Scott Rasmussen. (2002, January 28). Centralized Network Security Management: Combining Defense In Depth with Manageable Security. Retrieved March 5, 2017.",
                    "source_name": "SANSCentratlizeManagement"
                }
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "id": "attack-pattern--a7dff5d5-99f9-4a7e-ac54-a64113c28121",
            "modified": "2018-04-18T17:59:24.739Z",
            "x_mitre_detectable_by_common_defenses": "No",
            "x_mitre_detectable_by_common_defenses_explanation": "No technical means to detect an adversary collecting information about a target.  Any detection would be based upon strong OPSEC policy implementation.",
            "x_mitre_difficulty_for_adversary": "Yes",
            "x_mitre_difficulty_for_adversary_explanation": "Requires an adversary to undergo a research process to learn the internal workings of an organization.  An adversary can do this by social engineering individuals in the company by claiming to need to find information for the help desk, or through social engineering of former employees or business partners.",
            "type": "attack-pattern"
        }
    ],
    "type": "bundle",
    "id": "bundle--5995b030-15c9-4af2-9a7e-1880bf14998c",
    "spec_version": "2.0"
}