{
    "objects": [
        {
            "name": "Deploy exploit using advertising",
            "created": "2017-12-14T16:46:06.044Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "description": "This technique has been deprecated. Please see ATT&CK's Initial Access and Execution tactics for replacement techniques.\n\nExploits spread through advertising (malvertising) involve injecting malicious or malware-laden advertisements into legitimate online advertising networks and webpages. (Citation: TPMalvertising)\n\nDetectable by Common Defenses: No\n\nDetectable by Common Defenses explanation: Although some commercial technologies are being advertised which claim to detect malvertising, it largely spreads unknowingly because it doesn't always require an action by a user.\n\nDifficulty for the Adversary: Yes\n\nDifficulty for the Adversary explanation: An adversary can deploy exploits via malvertising using multiple mechanisms.  Such mechanisms include an image ad that is infected, redirection, or using social engineering to get the end user to install the malicious software themselves.",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-pre-attack",
                    "phase_name": "launch"
                }
            ],
            "external_references": [
                {
                    "url": "https://attack.mitre.org/pre-attack/index.php/Technique/PRE-T1157",
                    "source_name": "mitre-pre-attack",
                    "external_id": "PRE-T1157"
                },
                {
                    "description": "Michael Mimoso. (2015, March 30). AD NETWORKS RIPE FOR ABUSE VIA MALVERTISING. Retrieved March 9, 2017.",
                    "source_name": "TPMalvertising"
                }
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "id": "attack-pattern--d72c0bc0-3007-418c-842c-328027ebdbc1",
            "modified": "2018-04-13T17:05:30.756Z",
            "x_mitre_detectable_by_common_defenses": "No",
            "x_mitre_detectable_by_common_defenses_explanation": "Although some commercial technologies are being advertised which claim to detect malvertising, it largely spreads unknowingly because it doesn't always require an action by a user.",
            "x_mitre_difficulty_for_adversary": "Yes",
            "x_mitre_difficulty_for_adversary_explanation": "An adversary can deploy exploits via malvertising using multiple mechanisms.  Such mechanisms include an image ad that is infected, redirection, or using social engineering to get the end user to install the malicious software themselves.",
            "x_mitre_deprecated": "true",
            "type": "attack-pattern"
        }
    ],
    "type": "bundle",
    "id": "bundle--a29b5025-21ad-4ead-86b9-e2d978256bdb",
    "spec_version": "2.0"
}