{
    "type": "bundle",
    "id": "bundle--c43bbef7-4329-4d68-a8d6-9e8920241b2f",
    "spec_version": "2.0",
    "objects": [
        {
            "x_mitre_old_attack_id": "PRE-T1148",
            "x_mitre_detectable_by_common_defenses_explanation": "Defensive technologies exist to scan web content before delivery to the requested end user.  However, this is not foolproof as some sites encrypt web communications and the adversary constantly moves to sites not previously flagged as malicious thus defeating this defense.  Host-based defenses can also aid in detection/mitigation as well as detection by the web site that got compromised.  The added challenge for a conditional watering hole is the reduced scope and likely reduced ability to detect or be informed.  Determining deltas in content (e.g., differences files type/size/number/hashes) downloaded could also aid in detection.",
            "name": "Targeted client-side exploitation",
            "description": "This technique has been deprecated. Please see ATT&CK's Initial Access and Execution tactics for replacement techniques.\n\nA technique used to compromise a specific group of end users by taking advantage of flaws in client-side applications. For example, infecting websites that members of a targeted group are known to visit with the goal to infect a targeted user's computer. (Citation: RSASEThreat) (Citation: WikiStagefright) (Citation: ForbesSecurityWeek) (Citation: StrongPity-waterhole)",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-pre-attack",
                    "phase_name": "launch"
                }
            ],
            "id": "attack-pattern--72923cae-6c8c-4da2-8f48-b73389529c25",
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "x_mitre_version": "1.0",
            "x_mitre_deprecated": true,
            "type": "attack-pattern",
            "x_mitre_difficulty_for_adversary_explanation": "Commonly executed technique to place an exploit on an often widely used public web site intended for driveby delivery.  The additional challenge is the reduced set of options for web sites to compromise since the set is reduced to those often visited by targets of interest.",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "created": "2017-12-14T16:46:06.044Z",
            "x_mitre_difficulty_for_adversary": "Yes",
            "x_mitre_detectable_by_common_defenses": "Yes",
            "external_references": [
                {
                    "external_id": "T1371",
                    "source_name": "mitre-pre-attack",
                    "url": "https://attack.mitre.org/techniques/T1371"
                },
                {
                    "description": "Bob Griffin. (2015, May 16). THE ON-GOING THREAT OF SOCIAL ENGINEERING. Retrieved March 9, 2017.",
                    "source_name": "RSASEThreat"
                },
                {
                    "description": "Wikipedia contributors. (2017, March 8). Stagefright (bug). Retrieved March 9, 2017.",
                    "source_name": "WikiStagefright"
                },
                {
                    "description": "Fahmida Y. Rashid. (2015, February 11). Chinese Attackers Hacked Forbes Website in Watering Hole Attack: Security Firms. Retrieved March 7, 2017.",
                    "source_name": "ForbesSecurityWeek"
                },
                {
                    "description": "Kurt Baumgartner. (2016, October 3). On the StrongPity Waterhole Attacks Targeting Italian and Belgian Encryption Users. Retrieved May 9, 2017.",
                    "source_name": "StrongPity-waterhole"
                }
            ],
            "modified": "2018-10-17T00:14:20.652Z"
        }
    ]
}