{
    "type": "bundle",
    "id": "bundle--3306402f-ced2-4d4b-a459-94bf7d10cff8",
    "spec_version": "2.0",
    "objects": [
        {
            "x_mitre_old_attack_id": "PRE-T1168",
            "x_mitre_detectable_by_common_defenses_explanation": "Possible to detect compromised credentials if alerting from a service provider is enabled and acted upon by the individual.",
            "name": "Choose pre-compromised mobile app developer account credentials or signing keys",
            "description": "The adversary can use account credentials or signing keys of an existing mobile app developer to publish malicious updates of existing mobile apps to an application store, or to abuse the developer's identity and reputation to publish new malicious apps.  Many mobile devices are configured to automatically install new versions of already-installed apps. (Citation: Fraudenlent Apps Stolen Dev Credentials)",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-pre-attack",
                    "phase_name": "persona-development"
                }
            ],
            "id": "attack-pattern--7a265bf0-6acc-4f43-8b22-2e58b443e62e",
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "x_mitre_version": "1.0",
            "x_mitre_difficulty_for_adversary": "No",
            "type": "attack-pattern",
            "x_mitre_difficulty_for_adversary_explanation": "The difficulty of obtaining useful developer credentials may vary.  Well-organized, professional app developers whose credentials or signing keys would be the most useful to an adversary because of the large install bases of their apps, would likely strongly protect their credentials and signing keys.  Less-organized app developers may not protect their credentials and signing keys as strongly, but the credentials and signing keys would also be less useful to an adversary.  These less-organized app developers may reuse passwords across sites, fail to turn on multi-factor authentication features when available, or store signing keys in unprotected locations.",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "created": "2017-12-14T16:46:06.044Z",
            "modified": "2018-10-17T00:14:20.652Z",
            "external_references": [
                {
                    "external_id": "T1391",
                    "source_name": "mitre-pre-attack",
                    "url": "https://attack.mitre.org/techniques/T1391"
                },
                {
                    "description": "Galen Gruman. (2014, December 5). Keep out hijackers: Secure your app store dev account. Retrieved April 12, 2017.",
                    "source_name": "Fraudenlent Apps Stolen Dev Credentials"
                }
            ],
            "x_mitre_detectable_by_common_defenses": "No"
        }
    ]
}