{
    "objects": [
        {
            "name": "OS-vendor provided communication channels",
            "created": "2017-12-14T16:46:06.044Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "description": "Google and Apple provide Google Cloud Messaging and Apple Push Notification Service, respectively, services designed to enable efficient communication between third-party mobile app backend servers and the mobile apps running on individual devices. These services maintain an encrypted connection between every mobile device and Google or Apple that cannot easily be inspected and must be allowed to traverse networks as part of normal device operation. These services could be used by adversaries for communication to compromised mobile devices. (Citation: Securelist Mobile Malware 2013) (Citation: DroydSeuss)\n\nDetectable by Common Defenses: No\n\nDetectable by Common Defenses explanation: These services are heavily utilized by mainstream mobile app developers.  High volume of communications makes it extremely hard for a defender to distinguish between legitimate and adversary communications.\n\nDifficulty for the Adversary: Yes\n\nDifficulty for the Adversary explanation: These are free services provided by Google and Apple to app developers, and information on how to use them is readily available.",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-pre-attack",
                    "phase_name": "adversary-opsec"
                }
            ],
            "external_references": [
                {
                    "url": "https://attack.mitre.org/pre-attack/index.php/Technique/PRE-T1167",
                    "source_name": "mitre-pre-attack",
                    "external_id": "PRE-T1167"
                },
                {
                    "description": "Roman Unuchek, Victor Chebyshev. (2014, February 24). Mobile Malware Evolution: 2013. Retrieved April 12, 2017.",
                    "source_name": "Securelist Mobile Malware 2013"
                },
                {
                    "description": "Alberto Coletta, Victor van der Veen, and Federico Maggi. (2016). DroydSeuss: A Mobile Banking Trojan Tracker - Short Paper. Retrieved April 12, 2017.",
                    "source_name": "DroydSeuss"
                }
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "id": "attack-pattern--5436571f-2332-4b51-b7ed-0bc822fe02c2",
            "modified": "2018-04-18T17:59:24.739Z",
            "x_mitre_detectable_by_common_defenses": "No",
            "x_mitre_detectable_by_common_defenses_explanation": "These services are heavily utilized by mainstream mobile app developers.  High volume of communications makes it extremely hard for a defender to distinguish between legitimate and adversary communications.",
            "x_mitre_difficulty_for_adversary": "Yes",
            "x_mitre_difficulty_for_adversary_explanation": "These are free services provided by Google and Apple to app developers, and information on how to use them is readily available.",
            "type": "attack-pattern"
        }
    ],
    "type": "bundle",
    "id": "bundle--7af52ff2-d8ee-41e3-93d3-c082e3235b19",
    "spec_version": "2.0"
}