{
    "id": "bundle--f9a10522-9e60-472b-ae7a-6241a6c55641",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An attacker leverages the security functionality of the system aimed at thwarting potential attacks to launch a denial of service attack against a legitimate system user. Many systems, for instance, implement a password throttling mechanism that locks an account after a certain number of incorrect log in attempts. An attacker can leverage this throttling mechanism to lock a legitimate user out of their own account. The weakness that is being leveraged by an attacker is the very security feature that has been put in place to counteract attacks.",
            "external_references": [
                {
                    "external_id": "CAPEC-2",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/2.html"
                },
                {
                    "external_id": "CWE-645",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/645.html"
                },
                {
                    "description": "Account Access Removal",
                    "external_id": "T1531",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1531"
                }
            ],
            "id": "attack-pattern--4ee9fc30-e736-4f4f-b55b-8a3008214042",
            "modified": "2021-06-24T00:00:00.000Z",
            "name": "Inducing Account Lockout",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Standard",
            "x_capec_child_of_refs": [
                "attack-pattern--c727c058-2c9d-4021-a1ec-81dd030dea59"
            ],
            "x_capec_consequences": {
                "Availability": [
                    "Resource Consumption (Denial of Service)"
                ]
            },
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_example_instances": [
                "A famous example of this type an attack is the eBay attack. eBay always displays the user id of the highest bidder. In the final minutes of the auction, one of the bidders could try to log in as the highest bidder three times. After three incorrect log in attempts, eBay password throttling would kick in and lock out the highest bidder's account for some time. An attacker could then make their own bid and their victim would not have a chance to place the counter bid because they would be locked out. Thus an attacker could win the auction."
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Experiment</h3><ol><li> <p> <b>Investigate account lockout behavior of system: </b>Investigate the security features present in the system that may trigger an account lockout</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Analyze system documentation to find list of events that could potentially cause account lockout</td></tr><tr><td>Obtain user account in system and attempt to lock it out by sending malformed or incorrect data repeatedly</td></tr><tr><td>Determine another user's login ID, and attempt to brute force the password (or other credentials) for it a predetermined number of times, or until the system provides an indication that the account is locked out.</td></tr></tbody></table><li> <p> <b>Obtain list of user accounts to lock out: </b>Generate a list of valid user accounts to lock out</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Obtain list of authorized users using another attack pattern, such as SQL Injection.</td></tr><tr><td>Attempt to create accounts if possible; system should indicate if a user ID is already taken.</td></tr><tr><td>Attempt to brute force user IDs if system reveals whether a given user ID is valid or not upon failed login attempts.</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Lock Out Accounts: </b>Perform lockout procedure for all accounts that the attacker wants to lock out.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>For each user ID to be locked out, perform the lockout procedure discovered in the first step.</td></tr></tbody></table></ol></div>",
            "x_capec_likelihood_of_attack": "High",
            "x_capec_prerequisites": [
                "The system has a lockout mechanism.",
                "An attacker must be able to reproduce behavior that would result in an account being locked."
            ],
            "x_capec_resources_required": [
                "Computer with access to the login portion of the target system"
            ],
            "x_capec_skills_required": {
                "Low": "No programming skills or computer knowledge is needed. An attacker can easily use this attack pattern following the Execution Flow above."
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Medium",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}