{
    "id": "bundle--6515d31c-72b4-4a86-9b92-af45152277d5",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An attacker uses methods to deactivate a passive RFID tag for the purpose of rendering the tag, badge, card, or object containing the tag unresponsive. RFID tags are used primarily for access control, inventory, or anti-theft devices. The purpose of attacking the RFID chip is to disable or damage the chip without causing damage to the object housing it.",
            "external_references": [
                {
                    "external_id": "CAPEC-400",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/400.html"
                },
                {
                    "description": "Stuart McClure, Joel Scambray, George Kurtz, Hacking Exposed: Network Security Secrets & Solutions (6th Edition), 2009, McGraw Hill",
                    "external_id": "REF-33",
                    "source_name": "reference_from_CAPEC"
                }
            ],
            "id": "attack-pattern--309b5fec-8a59-4d28-8a1c-427d289aad93",
            "modified": "2022-02-22T00:00:00.000Z",
            "name": "RFID Chip Deactivation or Destruction",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_child_of_refs": [
                "attack-pattern--5e808864-44b1-478c-8cb0-75c55cd51e2b"
            ],
            "x_capec_domains": [
                "Physical Security"
            ],
            "x_capec_extended_description": "\n            <xhtml:p>When correctly performed the RFID chip can be disabled or destroyed without visible damage or marking to whatever item or device containing the chip. Attacking the chip directly allows for the security device or method to be bypassed without directly damaging the device itself, such as an alarm system or computer system. Various methods exist for damaging or deactivating RFID tags. For example, most common RFID chips can be permanently destroyed by creating a small electromagnetic pulse near the chip itself. One method employed requires the modifying a disposable camera by disconnecting the flash bulb and soldering a copper coil to the capacitor. Firing the camera in this configuration near any RFID chip-based device creates an EMP pulse sufficient to destroy the chip without leaving evidence of tampering. So far this attack has been demonstrated to work against RFID chips in the 13.56 MHz range.</xhtml:p>\n         ",
            "x_capec_status": "Draft",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}