{
    "id": "bundle--abb930b9-251f-4e04-9002-f4db263a5cc8",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary exploits a weakness in the server's trust of client-side processing by modifying data on the client-side, such as price information, and then submitting this data to the server, which processes the modified data. For example, eShoplifting is a data manipulation attack against an on-line merchant during a purchasing transaction. The manipulation of price, discount or quantity fields in the transaction message allows the adversary to acquire items at a lower cost than the merchant intended. The adversary performs a normal purchasing transaction but edits hidden fields within the HTML form response that store price or other information to give themselves a better deal. The merchant then uses the modified pricing information in calculating the cost of the selected items.",
            "external_references": [
                {
                    "external_id": "CAPEC-162",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/162.html"
                },
                {
                    "external_id": "CWE-602",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/602.html"
                }
            ],
            "id": "attack-pattern--a506984b-0870-42d9-8bcd-0787f13b8c2e",
            "modified": "2022-02-22T00:00:00.000Z",
            "name": "Manipulating Hidden Fields",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_child_of_refs": [
                "attack-pattern--5e4a268e-f89f-445a-aa42-395922f56bf0"
            ],
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Probe target web application: </b>The adversary first probes the target web application to find all possible pages that can be visited on the website.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Use a spidering tool to follow and record all links</td></tr><tr><td>Use a proxy tool to record all links visited during a manual traversal of the web application.</td></tr></tbody></table><li> <p> <b>Find hidden fields: </b>Once the web application has been traversed, the adversary looks for all hidden HTML fields present in the client-side.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Use the inspect tool on all modern browsers and filter for the keyword \"hidden\"</td></tr><tr><td>Specifically look for hidden fields inside form elements.</td></tr></tbody></table></ol></div><div><h3>Experiment</h3><ol><li> <p> <b>Send modified hidden fields to server-side: </b>Once the adversary has found hidden fields in the client-side, they will modify the values of these hidden fields one by one and then interact with the web application so that this data is sent to the server-side. The adversary observes the response from the server to determine if the values of each hidden field are being validated.</p></li></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Manipulate hidden fields: </b>Once the adversary has determined which hidden fields are not being validated by the server, they will manipulate them to change the normal behavior of the web application in a way that benefits the adversary.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Manipulate a hidden field inside a form element and then submit the form so that the manipulated data is sent to the server.</td></tr></tbody></table></ol></div>",
            "x_capec_prerequisites": [
                "The targeted site must contain hidden fields to be modified.",
                "The targeted site must not validate the hidden fields with backend processing."
            ],
            "x_capec_resources_required": [
                "The adversary must have the ability to modify hidden fields by editing the HTTP response to the server."
            ],
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}