{
    "id": "bundle--2cab53a5-b61b-4bab-a619-43eee224680b",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An attacker targets a system that uses JavaScript Object Notation (JSON) as a transport mechanism between the client and the server (common in Web 2.0 systems using AJAX) to steal possibly confidential information transmitted from the server back to the client inside the JSON object by taking advantage of the loophole in the browser's Same Origin Policy that does not prohibit JavaScript from one website to be included and executed in the context of another website.",
            "external_references": [
                {
                    "external_id": "CAPEC-111",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/111.html"
                },
                {
                    "external_id": "CWE-345",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/345.html"
                },
                {
                    "external_id": "CWE-346",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/346.html"
                },
                {
                    "external_id": "CWE-352",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/352.html"
                }
            ],
            "id": "attack-pattern--5b2d7149-c0f3-4b42-9c10-febe7dfd3ea5",
            "modified": "2022-09-29T00:00:00.000Z",
            "name": "JSON Hijacking (aka JavaScript Hijacking)",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Standard",
            "x_capec_child_of_refs": [
                "attack-pattern--c727c058-2c9d-4021-a1ec-81dd030dea59"
            ],
            "x_capec_consequences": {
                "Confidentiality": [
                    "Read Data"
                ]
            },
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_example_instances": [
                "\n               <xhtml:p>Gmail service was found to be vulnerable to a JSON Hijacking attack that enabled an attacker to get the contents of the victim's address book. An attacker could send an e-mail to the victim's Gmail account (which ensures that the victim is logged in to Gmail when they receive it) with a link to the attackers' malicious site. If the victim clicked on the link, a request (containing the victim's authenticated session cookie) would be sent to the Gmail servers to fetch the victim's address book. This functionality is typically used by the Gmail service to get this data on the fly so that the user can be provided a list of contacts from which to choose the recipient of the e-mail.</xhtml:p>\n               <xhtml:p>When the JSON object with the contacts came back, it was loaded into the JavaScript space via a script tag on the attackers' malicious page. Since the JSON object was never assigned to a local variable (which would have prevented a script from a different domain accessing it due to the browser's same origin policy), another mechanism was needed to access the data that it contained. That mechanism was overwriting the internal array constructor with the attackers' own constructor in order to gain access to the JSON object's contents. These contents could then be transferred to the site controlled by the attacker.</xhtml:p>\n            "
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Understand How to Request JSON Responses from the Target System: </b>An attacker first explores the target system to understand what URLs need to be provided to it in order to retrieve JSON objects that contain information of interest to the attacker.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>An attacker creates an account with the target system and observes requests and the corresponding JSON responses from the server. Understanding how to properly elicit responses from the server is crucial to the attackers' ability to craft the exploit.</td></tr></tbody></table></ol></div><div><h3>Experiment</h3><ol><li> <p>[Craft a malicious website]<xhtml:p>The attacker crafts a malicious website to which they plan to lure the victim who is using the vulnerable target system. The malicious website does two things:</xhtml:p>\n                  <xhtml:ul>\n                     <xhtml:li>1. Contains a hook that intercepts incoming JSON objects, reads their contents and forwards the contents to the server controlled by the attacker (via a new XMLHttpRequest).</xhtml:li>\n                     <xhtml:li>2. Uses the script tag with a URL in the source that requests a JSON object from the vulnerable target system. Once the JSON object is transmitted to the victim's browser, the malicious code (as described in step 1) intercepts that JSON object, steals its contents, and forwards to the attacker.</xhtml:li>\n                  </xhtml:ul>\n                  <xhtml:p>This attack step leverages the fact that the same origin policy in the browser does not protect JavaScript originating from one domain from setting up an environment to intercept and access JSON objects arriving from a completely different domain.</xhtml:p>\n               </p></li></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Launch JSON hijack: </b>An attacker lures the victim to the malicious website or leverages other means to get their malicious code executing in the victim's browser. Once that happens, the malicious code makes a request to the victim target system to retrieve a JSON object with sensitive information. The request includes the victim's session cookie if the victim is logged in.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>An attacker employs a myriad of standard techniques to get the victim to visit their malicious site or by some other means get the attackers' malicious code executing in the victim's browser.</td></tr></tbody></table></ol></div>",
            "x_capec_extended_description": "\n            <xhtml:p>An attacker gets the victim to visit their malicious page that contains a script tag whose source points to the vulnerable system with a URL that requests a response from the server containing a JSON object with possibly confidential information. The malicious page also contains malicious code to capture the JSON object returned by the server before any other processing on it can take place, typically by overriding the JavaScript function used to create new objects. This hook allows the malicious code to get access to the creation of each object and transmit the possibly sensitive contents of the captured JSON object to the attackers' server.</xhtml:p>\n            <xhtml:p>There is nothing in the browser's security model to prevent the attackers' malicious JavaScript code (originating from attacker's domain) to set up an environment (as described above) to intercept a JSON object response (coming from the vulnerable target system's domain), read its contents and transmit to the attackers' controlled site. The same origin policy protects the domain object model (DOM), but not the JSON.</xhtml:p>\n         ",
            "x_capec_likelihood_of_attack": "High",
            "x_capec_prerequisites": [
                "JSON is used as a transport mechanism between the client and the server",
                "The target server cannot differentiate real requests from forged requests",
                "The JSON object returned from the server can be accessed by the attackers' malicious code via a script tag"
            ],
            "x_capec_resources_required": [
                "None: No specialized resources are required to execute this type of attack."
            ],
            "x_capec_skills_required": {
                "Medium": "Once this attack pattern is developed and understood, creating an exploit is not very complex.The attacker needs to have knowledge of the URLs that need to be accessed on the target system to request the JSON objects."
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}