{
    "id": "bundle--99167ec9-eb01-4b71-8367-ed2624494732",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary contaminates organizational information systems (including devices and networks) by causing them to handle information of a classification/sensitivity for which they have not been authorized. When this happens, the contaminated information system, device, or network must be brought offline to investigate and mitigate the data spill, which denies availability of the system until the investigation is complete.",
            "external_references": [
                {
                    "external_id": "CAPEC-548",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/548.html"
                },
                {
                    "description": "Florida Industrial Security Working Group (FISWG), Managing a “Data Spill”",
                    "external_id": "REF-742",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://fiswg.research.ucf.edu/Documents/PPT/Manage%20a%20Data%20Spill-Contamination%20September%202015.pptx"
                },
                {
                    "description": "data spillage",
                    "external_id": "REF-743",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://csrc.nist.gov/glossary/term/data_spillage"
                }
            ],
            "id": "attack-pattern--61546d1a-d720-4609-89ca-12039268d502",
            "modified": "2023-01-24T00:00:00.000Z",
            "name": "Contaminate Resource",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Meta",
            "x_capec_alternate_terms": [
                "Data Spill"
            ],
            "x_capec_can_precede_refs": [
                "attack-pattern--576968ad-12ef-46d8-bb10-63f496bcaccb"
            ],
            "x_capec_consequences": {
                "Availability": [
                    "Resource Consumption (Denial of Service)"
                ],
                "Confidentiality": [
                    "Read Data (Victims of the attack can be exposed to classified materials)"
                ]
            },
            "x_capec_domains": [
                "Software",
                "Hardware"
            ],
            "x_capec_example_instances": [
                "\n               <xhtml:p>An insider threat was able to obtain a classified document. They have knowledge that a backend server which provides access to a website also runs a mail server. The adversary creates a throwaway email address and sends the classified document to the mail server. When an administrator checks the mail server they notice that it has processed an email with a classified document and the server has to be taken offline while they investigate the contamination. In the meantime, the website has to be taken down as well and access to the website is denied until the backend can be migrated to another server or the investigation is complete.</xhtml:p>\n            "
            ],
            "x_capec_extended_description": "Contamination through email is a very common attack vector. Systems with email servers or personal work systems using email are susceptible to this attack simply by receiving an email that contains a classified document or information. A fake classified document could even be used that is mistaken as true classified material. This would still cause the system to be taken offline until the validity of the classified material is confirmed.",
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_prerequisites": [
                "The adversary needs to have real or fake classified/sensitive information to place on a system"
            ],
            "x_capec_skills_required": {
                "High": "The ability to obtain a classified document or information",
                "Low": "The ability to fake a classified document"
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}