{
    "id": "bundle--89eb11ec-9499-4cfb-9d66-e3d611ddd909",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary searches a targeted web site for web pages that have not been publicized. In doing this, the adversary may be able to gain access to information that the targeted site did not intend to make public.",
            "external_references": [
                {
                    "external_id": "CAPEC-143",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/143.html"
                },
                {
                    "external_id": "CWE-425",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/425.html"
                }
            ],
            "id": "attack-pattern--a20a3cc9-4a6a-4376-a2b4-777ee9df2a34",
            "modified": "2023-01-24T00:00:00.000Z",
            "name": "Detect Unpublicized Web Pages",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_child_of_refs": [
                "attack-pattern--797f4b4e-371a-4d06-9e98-5cccb8a7ebc1"
            ],
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Find target web site: </b>An adversary finds a target web site that they think may have unpublicized web pages</p></li><li> <p> <b>Map the published web site: </b>The adversary will map the published web site either by using an automated tool or by manually accessing well-known debugging or logging pages, or otherwise predictable pages within the site tree</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Use Dirbuster to brute force directories and file names to find unpublicized pages</td></tr><tr><td>Find a pattern in the naming of documents and extrapolate this pattern to discover additional documents that have been created but are no longer externally linked</td></tr></tbody></table></ol></div><div><h3>Experiment</h3><ol><li> <p> <b>Try to find weaknesses or information: </b>The adversary will try to find weaknesses or information on the unpublicized pages that the targeted site did not intend to be public</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Manually analyze files or pages for information that could be useful in a further attack</td></tr><tr><td>Use a static analysis tool to find weaknesses in unpublished web pages</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Follow-up attack: </b>Use any information or weaknesses found to carry out a follow-up attack</p></li></ol></div>",
            "x_capec_prerequisites": [
                "The targeted web site must include pages within its published tree that are not connected to its tree of links. The sensitivity of the content of these pages determines the severity of this attack."
            ],
            "x_capec_resources_required": [
                "Spidering tools to explore the target web site are extremely useful in this attack especially when attacking large sites. Some tools might also be able to automatically construct common page locations from known paths."
            ],
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Low",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}