{
    "id": "bundle--c7ceeefb-0cc4-48b5-8e4f-ed377fe4e7ca",
    "objects": [
        {
            "created": "2020-07-30T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary, through a previously installed malicious application, impersonates a credential prompt in an attempt to steal a user's credentials.",
            "external_references": [
                {
                    "external_id": "CAPEC-654",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/654.html"
                },
                {
                    "external_id": "CWE-1021",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/1021.html"
                },
                {
                    "description": "Input Capture",
                    "external_id": "T1056",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1056"
                },
                {
                    "description": "Abuse Elevation Control Mechanism: Elevated Execution with Prompt",
                    "external_id": "T1548.004",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1548/004"
                }
            ],
            "id": "attack-pattern--f7a0e7bd-d24a-4390-b365-9e71f22e4e06",
            "modified": "2022-09-29T00:00:00.000Z",
            "name": "Credential Prompt Impersonation",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_child_of_refs": [
                "attack-pattern--1995c522-a25d-46e4-b024-65172771a692"
            ],
            "x_capec_consequences": {
                "Access_Control": [
                    "Gain Privileges"
                ],
                "Authentication": [
                    "Gain Privileges"
                ]
            },
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_example_instances": [
                "An adversary monitors the system task list for Microsoft Outlook in an attempt to determine when the application may prompt the user to enter their credentials to view encrypted email. Once the task is executed, the adversary impersonates the credential prompt to obtain the user's Microsoft Outlook encryption credentials. These credentials can then be leveraged by the adversary to read a user's encrypted email.",
                "An adversary randomly prompts a user to enter their system credentials, tricking the user into believing that a background process requires the credentials to function. The adversary can then use these gleaned credentials to execute additional attacks or obtain data."
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Determine suitable tasks to exploit: </b>Determine what tasks exist on the target system that may result in a user providing their credentials.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Determine what tasks prompt a user for their credentials.</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Impersonate Task: </b>Impersonate a legitimate task, either expected or unexpected, in an attempt to gain user credentials.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Prompt a user for their credentials, while making the user believe the credential request is legitimate.</td></tr></tbody></table></ol></div>",
            "x_capec_extended_description": "\n            <xhtml:p>The adversary may monitor the task list maintained by the operating system and wait for a specific legitimate credential prompt to become active. Once the prompt is detected, the adversary launches a new credential prompt in the foreground that mimics the user interface of the legitimate credential prompt. At this point, the user thinks that they are interacting with the legitimate credential prompt, but instead they are interacting with the malicious credential prompt.</xhtml:p>\n            <xhtml:p>A second approach involves the adversary impersonating an unexpected credential prompt, but one that may often be spawned by legitimate background processes. For example, an adversary may randomly impersonate a system credential prompt, implying that a background process or commonly used application (e.g., email reader) requires authentication for some purpose. The user, believing they are interacting with a legitimate credential prompt, enters their credentials which the adversary then leverages for nefarious purposes. The ultimate goal of this attack is to obtain sensitive information (e.g., credentials) from the user.</xhtml:p>\n         ",
            "x_capec_likelihood_of_attack": "Medium",
            "x_capec_prerequisites": [
                "The adversary must already have access to the target system via some means.",
                "A legitimate task must exist that an adversary can impersonate to glean credentials."
            ],
            "x_capec_resources_required": [
                "Malware or some other means to initially comprise the target system.",
                "Additional malware to impersonate a legitimate credential prompt."
            ],
            "x_capec_skills_required": {
                "Low": "Once an adversary has gained access to the target system, impersonating a credential prompt is not difficult."
            },
            "x_capec_status": "Stable",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}