{
    "id": "bundle--af20cc47-a387-4278-938d-16003b9f7e59",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary targets a specific user or group with a Phishing (CAPEC-98) attack tailored to a category of users in order to have maximum relevance and deceptive capability. Spear Phishing is an enhanced version of the Phishing attack targeted to a specific user or group. The quality of the targeted email is usually enhanced by appearing to come from a known or trusted entity. If the email account of some trusted entity has been compromised the message may be digitally signed. The message will contain information specific to the targeted users that will enhance the probability that they will follow the URL to the compromised site. For example, the message may indicate knowledge of the targets employment, residence, interests, or other information that suggests familiarity. As soon as the user follows the instructions in the message, the attack proceeds as a standard Phishing attack.",
            "external_references": [
                {
                    "external_id": "CAPEC-163",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/163.html"
                },
                {
                    "external_id": "CWE-451",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/451.html"
                },
                {
                    "description": "Internal Spearfishing",
                    "external_id": "T1534",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1534"
                },
                {
                    "description": "Phishing: Spearfishing Attachment",
                    "external_id": "T1566.001",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1566/001"
                },
                {
                    "description": "Phishing: Spearfishing Link",
                    "external_id": "T1566.002",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1566/002"
                },
                {
                    "description": "Phishing: Spearfishing via Service",
                    "external_id": "T1566.003",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1566/003"
                },
                {
                    "description": "Phishing for Information: Spearfishing Service",
                    "external_id": "T1598.001",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1598/001"
                },
                {
                    "description": "Phishing for Information: Spearfishing Attachment",
                    "external_id": "T1598.002",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1598/002"
                },
                {
                    "description": "Phishing for Information: Spearfishing Link",
                    "external_id": "T1598.003",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1598/003"
                }
            ],
            "id": "attack-pattern--ff3cf9fc-c308-4571-8a01-ecae629a49c1",
            "modified": "2023-01-24T00:00:00.000Z",
            "name": "Spear Phishing",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_can_follow_refs": [
                "attack-pattern--913426fa-ea1f-43b0-8492-1d363ea109d6",
                "attack-pattern--756a1a93-3734-426c-9e91-f9339de74a7a",
                "attack-pattern--8b329689-f8f8-466e-a890-4e30b8d8ec30"
            ],
            "x_capec_child_of_refs": [
                "attack-pattern--a00c2cc2-bd4f-4594-9ec1-b021b62ac896"
            ],
            "x_capec_consequences": {
                "Accountability": [
                    "Gain Privileges (Privilege Escalation)"
                ],
                "Authentication": [
                    "Gain Privileges (Privilege Escalation)"
                ],
                "Authorization": [
                    "Gain Privileges (Privilege Escalation)"
                ],
                "Confidentiality": [
                    "Read Data (Information Leakage)"
                ],
                "Integrity": [
                    "Modify Data (Data Modification)"
                ],
                "Non-Repudiation": [
                    "Gain Privileges (Privilege Escalation)"
                ]
            },
            "x_capec_domains": [
                "Social Engineering"
            ],
            "x_capec_example_instances": [
                "The target gets an official looking e-mail from their bank stating that their account has been temporarily locked due to suspected unauthorized activity that happened in a different area from where they live (details might be provided by the spear phishers) and that they need to click on the link included in the e-mail to log in to their bank account in order to unlock it. The link in the e-mail looks very similar to that of their bank and once the link is clicked, the log in page is the exact replica. The target supplies their login credentials after which they are notified that their account has now been unlocked and that everything is fine. An adversary has just collected the target's online banking information which can now be used by them to log into the target's bank account and transfer money to a bank account of the adversary's choice.",
                "An adversary can leverage a weakness in the SMB protocol by sending the target, an official looking e-mail from their employer's IT Department stating that their system has vulnerable software, which they need to manually patch by accessing an updated version of the software by clicking on a provided link to a network share. Once the link is clicked, the target is directed to an external server controlled by the adversary or to a malicious file on a public access share. The SMB protocol will then attempt to authenticate the target to the adversary controlled server, which allows the adversary to capture the hashed credentials over SMB. These credentials can then be used to execute offline brute force attacks or a \"Pass The Hash\" attack."
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Obtain useful contextual detailed information about the targeted user or organization: </b>An adversary collects useful contextual detailed information about the targeted user or organization in order to craft a more deceptive and enticing message to lure the target into responding.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Conduct web searching research of target. See also: CAPEC-118.</td></tr><tr><td>Identify trusted associates, colleagues and friends of target. See also: CAPEC-118.</td></tr><tr><td>Utilize social engineering attack patterns such as Pretexting. See also: CAPEC-407.</td></tr><tr><td>Collect social information via dumpster diving. See also: CAPEC-406.</td></tr><tr><td>Collect social information via traditional sources. See also: CAPEC-118.</td></tr><tr><td>Collect social information via Non-traditional sources. See also: CAPEC-118.</td></tr></tbody></table></ol></div><div><h3>Experiment</h3><ol><li> <p> <b>Optional: Obtain domain name and certificate to spoof legitimate site: </b>This optional step can be used to help the adversary impersonate the legitimate site more convincingly. The adversary can use homograph attacks to convince users that they are using the legitimate website. Note that this step is not required for phishing attacks, and many phishing attacks simply supply URLs containing an IP address and no SSL certificate.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Optionally obtain a domain name that visually looks similar to the legitimate site's domain name. An example is www.paypaI.com vs. www.paypal.com (the first one contains a capital i, instead of a lower case L).</td></tr><tr><td>Optionally obtain a legitimate SSL certificate for the new domain name.</td></tr></tbody></table><li> <p> <b>Optional: Explore legitimate website and create duplicate: </b>An adversary creates a website (optionally at a URL that looks similar to the original URL) that closely resembles the website that they are trying to impersonate. That website will typically have a login form for the victim to put in their authentication credentials. There can be different variations on a theme here.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Use spidering software to get copy of web pages on legitimate site.</td></tr><tr><td>Manually save copies of required web pages from legitimate site.</td></tr><tr><td>Create new web pages that have the legitimate site's look at feel, but contain completely new content.</td></tr></tbody></table><li> <p> <b>Optional: Build variants of the website with very specific user information e.g., living area, etc.: </b>Once the adversary has their website which duplicates a legitimate website, they need to build very custom user related information in it. For example, they could create multiple variants of the website which would target different living area users by providing information such as local news, local weather, etc. so that the user believes this is a new feature from the website.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Integrate localized information in the web pages created to duplicate the original website. Those localized information could be dynamically generated based on unique key or IP address of the future victim.</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Convince user to enter sensitive information on adversary's site.: </b>An adversary sends a message (typically an e-mail) to the victim that has some sort of a call to action to get the user to click on the link included in the e-mail (which takes the victim to adversary's website) and log in. The key is to get the victim to believe that the message is coming from a legitimate entity trusted by the victim or with which the victim or does business and that the website pointed to by the URL in the e-mail is the legitimate website. A call to action will usually need to sound legitimate and urgent enough to prompt action from the user.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Send the user a message from a spoofed legitimate-looking e-mail address that asks the user to click on the included link.</td></tr><tr><td>Place phishing link in post to online forum.</td></tr></tbody></table><li> <p> <b>Use stolen credentials to log into legitimate site: </b>Once the adversary captures some sensitive information through phishing (login credentials, credit card information, etc.) the adversary can leverage this information. For instance, the adversary can use the victim's login credentials to log into their bank account and transfer money to an account of their choice.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Log in to the legitimate site using another user's supplied credentials.</td></tr></tbody></table></ol></div>",
            "x_capec_likelihood_of_attack": "High",
            "x_capec_prerequisites": [
                "None. Any user can be targeted by a Spear Phishing attack."
            ],
            "x_capec_resources_required": [
                "An adversay must have the ability communicate their phishing scheme to the victims (via email, instance message, etc.), as well as a website or other platform for victims to enter personal information into."
            ],
            "x_capec_skills_required": {
                "Medium": "Spear phishing attacks require specific knowledge of the victims being targeted, such as which bank is being used by the victims, or websites they commonly log into (Google, Facebook, etc)."
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}