{
    "id": "bundle--f14ff61a-ba23-42a6-b9ad-7cd8c656f702",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary exploits a weakness in ATA security on a drive to gain access to the information the drive contains without supplying the proper credentials. ATA Security is often employed to protect hard disk information from unauthorized access. The mechanism requires the user to type in a password before the BIOS is allowed access to drive contents. Some implementations of ATA security will accept the ATA command to update the password without the user having authenticated with the BIOS. This occurs because the security mechanism assumes the user has first authenticated via the BIOS prior to sending commands to the drive. Various methods exist for exploiting this flaw, the most common being installing the ATA protected drive into a system lacking ATA security features (a.k.a. hot swapping). Once the drive is installed into the new system the BIOS can be used to reset the drive password.",
            "external_references": [
                {
                    "external_id": "CAPEC-402",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/402.html"
                },
                {
                    "external_id": "CWE-285",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/285.html"
                },
                {
                    "description": "Stuart McClure, Joel Scambray, George Kurtz, Hacking Exposed: Network Security Secrets & Solutions (6th Edition), 2009, McGraw Hill",
                    "external_id": "REF-33",
                    "source_name": "reference_from_CAPEC"
                },
                {
                    "description": "Oliver Tennert, Using the ATA security features of modern hard disks and SSDs, 2014, Admin Magazine",
                    "external_id": "REF-701",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://www.admin-magazine.com/Archive/2014/19/Using-the-ATA-security-features-of-modern-hard-disks-and-SSDs"
                },
                {
                    "description": "Breaking ATA Password Security, The University of Texas at Austin Information Security Office",
                    "external_id": "REF-702",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://security.utexas.edu/education-outreach/BreakingATA"
                }
            ],
            "id": "attack-pattern--6aac48b7-c277-46ba-b9c0-523471a84c11",
            "modified": "2022-02-22T00:00:00.000Z",
            "name": "Bypassing ATA Password Security",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_child_of_refs": [
                "attack-pattern--fdf61d51-9432-47d3-9376-7cf51fc86176"
            ],
            "x_capec_domains": [
                "Supply Chain",
                "Physical Security",
                "Hardware"
            ],
            "x_capec_example_instances": [
                "\n               <xhtml:p>The A-FF Repair Station tool is a data recovery utility that can be used for ATA password removal (both High and Maximum level) and firmware area recovery. An adversary with access to this tool could reset the ATA password to bypass this security feature and unlock the hard drive. The adversary could then obtain any data contained within the drive. [REF-702]</xhtml:p>\n            ",
                "\n               <xhtml:p>An adversary gains physical access to the targeted hard drive and installs it into a system that does not support ATA security features. Once the drive is installed in the feature-lacking system, the adversary is able to reset the hard drive password via the BIOS. As a result, the adversary is able to bypass ATA password security and access content on the drive.</xhtml:p>\n            "
            ],
            "x_capec_prerequisites": [
                "Access to the system containing the ATA Drive so that the drive can be physically removed from the system."
            ],
            "x_capec_status": "Draft",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}