{
    "id": "bundle--ec86004e-cc00-4c23-924c-e05ee4cdc65d",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An attacker is able to trick the victim into executing a Flash document that passes commands or calls to a Flash player browser plugin, allowing the attacker to exploit native Flash functionality in the client browser. This attack pattern occurs where an attacker can provide a crafted link to a Flash document (SWF file) which, when followed, will cause additional malicious instructions to be executed. The attacker does not need to serve or control the Flash document. The attack takes advantage of the fact that Flash files can reference external URLs. If variables that serve as URLs that the Flash application references can be controlled through parameters, then by creating a link that includes values for those parameters, an attacker can cause arbitrary content to be referenced and possibly executed by the targeted Flash application.",
            "external_references": [
                {
                    "external_id": "CAPEC-178",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/178.html"
                },
                {
                    "external_id": "CWE-601",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/601.html"
                },
                {
                    "description": "Stefano Di Paola, Testing Flash Applications, 2007",
                    "external_id": "REF-41",
                    "source_name": "reference_from_CAPEC",
                    "url": "http://www.wisec.it/en/Docs/flash_App_testing_Owasp07.pdf"
                },
                {
                    "description": "OWASP Web Security Testing Guide, The Open Web Application Security Project (OWASP)",
                    "external_id": "REF-42",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://www.owasp.org/www-project-web-security-testing-guide/latest/4-Web_Application_Security_Testing/11-Client-side_Testing/08-Testing_for_Cross_Site_Flashing.html"
                },
                {
                    "description": "Cross-Site Flashing, Trustwave",
                    "external_id": "REF-561",
                    "source_name": "reference_from_CAPEC",
                    "url": "http://doc.cenzic.com/sadoc9x14ba847/CPL0001509.htm"
                }
            ],
            "id": "attack-pattern--4ce65b20-6d2c-4217-b08a-e87b36c22353",
            "modified": "2023-01-24T00:00:00.000Z",
            "name": "Cross-Site Flashing",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_can_follow_refs": [
                "attack-pattern--8bd0c718-f126-4397-9754-c5225da7b696"
            ],
            "x_capec_child_of_refs": [
                "attack-pattern--2a8824eb-4fd0-45a4-9c3c-af3fd7c5e0ca"
            ],
            "x_capec_consequences": {
                "Access_Control": [
                    "Bypass Protection Mechanism"
                ],
                "Accountability": [
                    "Gain Privileges"
                ],
                "Authentication": [
                    "Gain Privileges"
                ],
                "Authorization": [
                    "Execute Unauthorized Commands (Run Arbitrary Code)",
                    "Gain Privileges",
                    "Bypass Protection Mechanism"
                ],
                "Confidentiality": [
                    "Read Data"
                ],
                "Integrity": [
                    "Modify Data"
                ],
                "Non-Repudiation": [
                    "Gain Privileges"
                ]
            },
            "x_capec_domains": [
                "Social Engineering",
                "Software"
            ],
            "x_capec_example_instances": [
                "The attacker tries to get their malicious flash movie to be executed in the targeted flash application. The malicious file is hosted on the attacker.com domain and the targeted flash application is hosted on example.com The crossdomain.xml file in the root of example.com allows all domains and no specific restriction is specified in the targeted flash application. When the attacker injects their malicious file in the vulnerable flash movie, the rogue flash application is able to access internal variables and parameter of the flash movie."
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Identification: </b>Using a browser or an automated tool, an attacker records all instances of URLs (or partial URL such as domain) passed to a flash file (SWF).</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Use an automated tool to record the variables passed to a flash file.</td></tr><tr><td>Use a browser to manually explore the website and analyze how the flash file receive variables, e.g. JavaScript using SetVariable/GetVariable, HTML FlashVars param tag, etc.</td></tr><tr><td>Use decompilers to retrieve the flash source code and record all user-controllable variables passed to a loadMovie* directive.</td></tr></tbody></table></ol></div><div><h3>Experiment</h3><ol><li> <p> <b>Attempt to inject a remote flash file: </b>The attacker makes use of a remotely available flash file (SWF) that generates a uniquely identifiable output when executed inside the targeted flash file.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Modify the variable of the SWF file that contains the remote movie URL to the attacker controlled flash file.</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Access or Modify Flash Application Variables: </b>As the attacker succeeds in exploiting the vulnerability, they target the content of the flash application to steal variable content, password, etc.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Develop malicious Flash application that is injected through vectors identified during the Experiment Phase and loaded by the victim browser's flash plugin and sends document information to the attacker.</td></tr><tr><td>Develop malicious Flash application that is injected through vectors identified during the Experiment Phase and takes commands from an attacker's server and then causes the flash application to execute appropriately.</td></tr></tbody></table><li> <p> <b>Execute JavaScript in victim's browser: </b>When the attacker targets the current flash application, they can choose to inject JavaScript in the client's DOM and therefore execute cross-site scripting attack.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Develop malicious JavaScript that is injected from the rogue flash movie to the targeted flash application through vectors identified during the Experiment Phase and loaded by the victim's browser.</td></tr></tbody></table></ol></div>",
            "x_capec_likelihood_of_attack": "Medium",
            "x_capec_prerequisites": [
                "The targeted Flash application must reference external URLs and the locations thus referenced must be controllable through parameters. The Flash application must fail to sanitize such parameters against malicious manipulation. The victim must follow a crafted link created by the attacker."
            ],
            "x_capec_skills_required": {
                "Medium": "knowledge of Flash internals, parameters and remote referencing."
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Medium",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}