{
    "id": "bundle--e717e34e-858f-4cb4-9b1b-ea5e8fdd001e",
    "objects": [
        {
            "created": "2015-11-09T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary registers a domain name that sounds the same as a trusted domain, but has a different spelling. A SoundSquatting attack takes advantage of a user's confusion of the two words to direct Internet traffic to adversary-controlled destinations. SoundSquatting does not require an attack against the trusted domain or complicated reverse engineering.",
            "external_references": [
                {
                    "external_id": "CAPEC-631",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/631.html"
                },
                {
                    "description": "Nick Nikiforakis, Marco Balduzzi, Lieven Desmet, Frank Piessens, Wouter Joosen, Soundsquatting: Uncovering the Use of Homophones in Domain Squatting, Trend Micro",
                    "external_id": "REF-491",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://www.trendmicro.de/cloud-content/us/pdfs/security-intelligence/white-papers/wp-soundsquatting.pdf"
                }
            ],
            "id": "attack-pattern--a2cad567-3a04-4ef3-8b62-25924c93b53f",
            "modified": "2022-09-29T00:00:00.000Z",
            "name": "SoundSquatting",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_alternate_terms": [
                "Homophone Attack"
            ],
            "x_capec_can_follow_refs": [
                "attack-pattern--a00c2cc2-bd4f-4594-9ec1-b021b62ac896"
            ],
            "x_capec_can_precede_refs": [
                "attack-pattern--5dec633b-7b10-4bfe-9270-e68b98112285",
                "attack-pattern--0d249bf9-13b3-4c13-9423-bcb1ea73c067"
            ],
            "x_capec_child_of_refs": [
                "attack-pattern--e9d5d2e4-588f-43c1-bc98-73417abbb727"
            ],
            "x_capec_consequences": {
                "Other": [
                    "Other (Depending on the intention of the adversary, a successful SoundSquatting attack can be leveraged to execute more complex attacks such as cross-site scripting or stealing account credentials.)"
                ]
            },
            "x_capec_domains": [
                "Social Engineering"
            ],
            "x_capec_example_instances": [
                "\n               <xhtml:p>An adversary sends an email, impersonating the popular banking website guaranteebanking.com, to a user stating that they have just received a new deposit and to click the given link to confirm the deposit.</xhtml:p>\n               <xhtml:p>However, the link the in email is guarantybanking.com instead of guaranteebanking.com, which the user clicks without fully reading the link.</xhtml:p>\n               <xhtml:p>The user is directed to the adversary's website, which appears as if it is the legitimate guaranteebanking.com login page.</xhtml:p>\n               <xhtml:p>The user thinks they are logging into their account, but have actually just given their guaranteebanking.com credentials to the adversary. The adversary can now use the user's legitimate guaranteebanking.com credentials to log into the user's account and steal any money which may be in the account.</xhtml:p>See also: SoundSquatting vulnerability allows an adversary to impersonate a trusted domain and leverages a user's confusion between the meaning of two words which are pronounced the same into visiting the malicious website to steal user credentials."
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Determine target website: </b>The adversary first determines which website to impersonate, generally one that is trusted, receives a consistent amount of traffic, and is a homophone.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Research popular or high traffic websites which are also homophones.</td></tr></tbody></table></ol></div><div><h3>Experiment</h3><ol><li> <p> <b>Impersonate trusted domain: </b>In order to impersonate the trusted domain, the adversary needs to register the SoundSquatted URL.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Register the SoundSquatted domain.</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Deceive user into visiting domain: </b>Finally, the adversary needs to deceive a user into visiting the SoundSquatted domain.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Execute a phishing attack and send a user an e-mail convincing the user to click on a link leading the user to the SoundSquatted domain.</td></tr><tr><td>Assume that a user will unintentionally use the homophone in the URL, leading the user to the SoundSquatted domain.</td></tr></tbody></table></ol></div>",
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_prerequisites": [
                "An adversary requires knowledge of popular or high traffic domains, that could be used to deceive potential targets."
            ],
            "x_capec_skills_required": {
                "Low": "Adversaries must be able to register DNS hostnames/URL’s."
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Medium",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}