{"type": "bundle", "id": "bundle--c6b04bd6-936c-404b-9b96-e477d40f1072", "objects": [{"type": "attack-pattern", "spec_version": "2.1", "id": "attack-pattern--229804f0-b017-4a26-937b-159da866bf9a", "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd", "created": "2014-06-23T00:00:00.000Z", "modified": "2021-06-24T00:00:00.000Z", "name": "Reflection Attack in Authentication Protocol", "description": "An attacker can abuse an authentication protocol susceptible to reflection attack in order to defeat it. Doing so allows the attacker illegitimate access to the target system, without possessing the requisite credentials. Reflection attacks are of great concern to authentication protocols that rely on a challenge-handshake or similar mechanism. An attacker can impersonate a legitimate user and can gain illegitimate access to the system by successfully mounting a reflection attack during authentication.", "external_references": [{"source_name": "capec", "url": "https://capec.mitre.org/data/definitions/90.html", "external_id": "CAPEC-90"}, {"source_name": "cwe", "url": "http://cwe.mitre.org/data/definitions/301.html", "external_id": "CWE-301"}, {"source_name": "cwe", "url": "http://cwe.mitre.org/data/definitions/303.html", "external_id": "CWE-303"}], "object_marking_refs": ["marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"], "x_capec_abstraction": "Standard", "x_capec_child_of": ["attack-pattern--2166d3c5-baec-4f42-8284-c1b5b649ad34", "attack-pattern--2e2ed1f8-f736-4fc9-83bc-308595fc6e03"], "x_capec_consequences": {"Confidentiality": ["Gain Privileges", "Bypass Protection Mechanism", "Read Data"], "Access_Control": ["Gain Privileges", "Bypass Protection Mechanism"], "Authorization": ["Gain Privileges", "Bypass Protection Mechanism"]}, "x_capec_example_instances": ["\n               <xhtml:p>A single sign-on solution for a network uses a fixed pre-shared key with its clients to initiate the sign-on process in order to avoid eavesdropping on the initial exchanges.</xhtml:p>\n               <xhtml:p>An attacker can use a reflection attack to mimic a trusted client on the network to participate in the sign-on exchange.</xhtml:p>\n            "], "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Experiment</h3><ol><li> <p>The attacker opens a connection to the target server and sends it a challenge</p></li><li> <p>The server responds by returning the challenge encrypted with a shared secret as well as its own challenge to the attacker</p></li><li> <p>Since the attacker does not possess the shared secret, they initiate a second connection to the server and sends it, as challenge, the challenge received from the server on the first connection</p></li><li> <p>The server treats this as just another handshake and responds by encrypting the challenge and issuing its own to the attacker</p></li><li> <p>The attacker now receives the encrypted challenge on the second connection and sends it as response to the server on the first connection, thereby successfully completing the handshake and authenticating to the server.</p></li></ol></div>", "x_capec_likelihood_of_attack": "High", "x_capec_prerequisites": ["The attacker must have direct access to the target server in order to successfully mount a reflection attack. An intermediate entity, such as a router or proxy, that handles these exchanges on behalf of the attacker inhibits the attackers' ability to attack the authentication protocol."], "x_capec_resources_required": ["All that the attacker requires is a means to observe and understand the protocol exchanges in order to reflect the challenges appropriately."], "x_capec_skills_required": {"Medium": "The attacker needs to have knowledge of observing the protocol exchange and managing the required connections in order to issue and respond to challenges"}, "x_capec_status": "Draft", "x_capec_typical_severity": "High", "x_capec_version": "3.5"}]}