{
    "id": "bundle--ed9b1b5d-48d6-405f-b396-5d7527b60d5a",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary replaces legitimate hardware in the system with faulty counterfeit or tampered hardware in the supply chain distribution channel, with purpose of causing malicious disruption or allowing for additional compromise when the system is deployed.",
            "external_references": [
                {
                    "external_id": "CAPEC-522",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/522.html"
                },
                {
                    "description": "Supply Chain Compromise: Compromise Hardware Supply Chain",
                    "external_id": "T1195.003",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1195/003"
                },
                {
                    "description": "John F. Miller, Supply Chain Attack Framework and Attack Patterns, 2013, The MITRE Corporation",
                    "external_id": "REF-439",
                    "source_name": "reference_from_CAPEC",
                    "url": "http://www.mitre.org/sites/default/files/publications/supply-chain-attack-framework-14-0228.pdf"
                },
                {
                    "description": "Cristin Goodwin, Joram Borenstein, Guarding against supply chain attacks—Part 2: Hardware risks, 2020--02---03, Microsoft",
                    "external_id": "REF-712",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://www.microsoft.com/security/blog/2020/02/03/guarding-against-supply-chain-attacks-part-2-hardware-risks/"
                }
            ],
            "id": "attack-pattern--556f08be-d926-448c-b2c2-88a817a170a4",
            "modified": "2022-09-29T00:00:00.000Z",
            "name": "Malicious Hardware Component Replacement",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Standard",
            "x_capec_child_of_refs": [
                "attack-pattern--59ba3504-6764-48b4-980a-40e4adff2030"
            ],
            "x_capec_domains": [
                "Supply Chain",
                "Hardware"
            ],
            "x_capec_example_instances": [
                "During shipment the adversary is able to intercept a system that has been purchased by the victim, and replaces a math processor card that functions just like the original, but contains advanced malicious capability. Once deployed, the system functions as normal, but allows for the adversary to remotely communicate with the system and use it as a conduit for additional compromise within the victim's environment."
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Determine Target Hardware: </b>The adversary must first identify a system that they wish to target, and a specific hardware component that they can swap out with a malicious replacement.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Look for datasheets containing the system schematics that can help identify possible target hardware.</td></tr><tr><td>Procure a system and inspect it manually, looking for possible hardware component targets. Search for manufacturer IDs on hardware chips or FCC IDs on wireless chips to determine their functionality.</td></tr></tbody></table><li> <p> <b>Discover Vulnerability in Supply Chain: </b>The adversary maps out the supply chain for the targeted system. They look for ooportunities to gain physical access to the system after it has left the manufacturer, but before it is deployed to the victim.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Procure a system and observe the steps it takes in the shipment process.</td></tr><tr><td>Identify possible warehouses that systems are stored after manufacturing.</td></tr></tbody></table></ol></div><div><h3>Experiment</h3><ol><li> <p> <b>Test a Malicious Component Replacement: </b>Before performing the attack in the wild, an adversary will test the attack on a system they have procured to ensure that the desired outcome will be achieved.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Design a malicious hardware component that will perform the same functionality as the target component, but also contains additional functionality.</td></tr><tr><td>Obtain already designed malicious components that just need to be placed into the system.</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Substitute Components in the Supply Chain: </b>Using the vulnerability in the supply chain of the system discovered in the explore phase, the adversary substitutes the malicious component for the targeted component. This results in the adversary gaining unintended access to systems once they reach the victim and can lead to a variety of follow up attacks.</p></li></ol></div>",
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_prerequisites": [
                "Physical access to the system after it has left the manufacturer but before it is deployed at the victim location."
            ],
            "x_capec_skills_required": {
                "High": "Hardware creation and manufacture of replacement components."
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}