{
    "id": "bundle--b8adf777-1c90-4336-988d-5cf1c36db473",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An attacker initiates a resource depletion attack where a large number of small XML messages are delivered at a sufficiently rapid rate to cause a denial of service or crash of the target. Transactions such as repetitive SOAP transactions can deplete resources faster than a simple flooding attack because of the additional resources used by the SOAP protocol and the resources necessary to process SOAP messages. The transactions used are immaterial as long as they cause resource utilization on the target. In other words, this is a normal flooding attack augmented by using messages that will require extra processing on the target.",
            "external_references": [
                {
                    "external_id": "CAPEC-147",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/147.html"
                },
                {
                    "external_id": "CWE-400",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/400.html"
                },
                {
                    "external_id": "CWE-770",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/770.html"
                }
            ],
            "id": "attack-pattern--94238840-08ad-4117-8a20-ed359cda1e7e",
            "modified": "2018-07-31T00:00:00.000Z",
            "name": "XML Ping of the Death",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_child_of_refs": [
                "attack-pattern--ad3913be-6ca6-48e6-9e3b-7b67e4162612"
            ],
            "x_capec_consequences": {
                "Availability": [
                    "Resource Consumption (DoS: resource consumption (other))"
                ]
            },
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_example_instances": [
                "Consider the case of attack performed against the createCustomerBillingAccount Web Service for an online store. In this case, the createCustomerBillingAccount Web Service receives a huge number of simultaneous requests, containing nonsense billing account creation information (the small XML messages). The createCustomerBillingAccount Web Services may forward the messages to other Web Services for processing. The application suffers from a high load of requests, potentially leading to a complete loss of availability the involved Web Service."
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Survey the target: </b>Using a browser or an automated tool, an attacker records all instance of web services to process XML requests.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Use an automated tool to record all instances of URLs to process XML requests.</td></tr><tr><td>Use a browser to manually explore the website and analyze how the application processes XML requests.</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Launch a resource depletion attack: </b>The attacker delivers a large number of small XML messages to the target URLs found in the explore phase at a sufficiently rapid rate. It causes denial of service to the target application.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Send a large number of crafted small XML messages to the target URL.</td></tr></tbody></table></ol></div>",
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_prerequisites": [
                "The target must receive and process XML transactions."
            ],
            "x_capec_resources_required": [
                "Transaction generator(s)/source(s) and ability to cause arrival of messages at the target with sufficient rapidity to overload target. Larger targets may be able to handle large volumes of requests so the attacker may require significant resources (such as a distributed network) to affect the target. However, the resources required of the attacker would be less than in the case of a simple flooding attack against the same target."
            ],
            "x_capec_skills_required": {
                "High": "To use distributed network to launch the attack",
                "Low": "To send small XML messages"
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Medium",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}