{
    "id": "bundle--54b3a95c-83ed-422d-aa85-68c5b0c54db4",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary attempts to deny legitimate users access to a resource by continually engaging a specific resource in an attempt to keep the resource tied up as long as possible. The adversary's primary goal is not to crash or flood the target, which would alert defenders; rather it is to repeatedly perform actions or abuse algorithmic flaws such that a given resource is tied up and not available to a legitimate user. By carefully crafting a requests that keep the resource engaged through what is seemingly benign requests, legitimate users are limited or completely denied access to the resource.",
            "external_references": [
                {
                    "external_id": "CAPEC-227",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/227.html"
                },
                {
                    "external_id": "CWE-400",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/400.html"
                },
                {
                    "description": "Endpoint Denial of Service",
                    "external_id": "T1499",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1499"
                },
                {
                    "description": "Denial of Service",
                    "external_id": "10",
                    "source_name": "WASC",
                    "url": "http://projects.webappsec.org/Denial-of-Service"
                }
            ],
            "id": "attack-pattern--6e3dda09-c1da-4f44-a0b3-e0e3b6fe0601",
            "modified": "2023-01-24T00:00:00.000Z",
            "name": "Sustained Client Engagement",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Meta",
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_extended_description": "\n            <xhtml:p>The degree to which the attack is successful depends upon the adversary's ability to sustain resource requests over time with a volume that exceeds the normal usage by legitimate users, as well as other mitigating circumstances such as the target's ability to shift load or acquire additional resources to deal with the depletion. This attack differs from a flooding attack as it is not entirely dependent upon large volumes of requests, and it differs from resource leak exposures which tend to exploit the surrounding environment needed for the resource to function. The key factor in a sustainment attack are the repeated requests that take longer to process than usual.</xhtml:p>\n         ",
            "x_capec_parent_of_refs": [
                "attack-pattern--aa92a904-ed9d-4dc3-a01f-c965521e9934"
            ],
            "x_capec_prerequisites": [
                "This pattern of attack requires a temporal aspect to the servicing of a given request. Success can be achieved if the adversary can make requests that collectively take more time to complete than legitimate user requests within the same time frame."
            ],
            "x_capec_resources_required": [
                "To successfully execute this pattern of attack, a script or program is often required that is capable of continually engaging the target and maintaining sustained usage of a specific resource. Depending on the configuration of the target, it may or may not be necessary to involve a network or cluster of objects all capable of making parallel requests."
            ],
            "x_capec_status": "Draft",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}