{
    "id": "bundle--16a22eaa-63ac-441c-a012-71aeaadc9926",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "The attacker induces a client to establish a session with the target software using a session identifier provided by the attacker. Once the user successfully authenticates to the target software, the attacker uses the (now privileged) session identifier in their own transactions. This attack leverages the fact that the target software either relies on client-generated session identifiers or maintains the same session identifiers after privilege elevation.",
            "external_references": [
                {
                    "external_id": "CAPEC-61",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/61.html"
                },
                {
                    "external_id": "CWE-384",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/384.html"
                },
                {
                    "external_id": "CWE-664",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/664.html"
                },
                {
                    "external_id": "CWE-732",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/732.html"
                },
                {
                    "description": "Session Fixation",
                    "external_id": "37",
                    "source_name": "WASC",
                    "url": "http://projects.webappsec.org/Session-Fixation"
                },
                {
                    "description": "Session fixation",
                    "source_name": "OWASP Attacks",
                    "url": "https://owasp.org/www-community/attacks/Session_fixation"
                },
                {
                    "description": "G. Hoglund, G. McGraw, Exploiting Software: How to Break Code, 2004--02, Addison-Wesley",
                    "external_id": "REF-1",
                    "source_name": "reference_from_CAPEC"
                },
                {
                    "description": "OWASP Web Security Testing Guide, The Open Web Application Security Project (OWASP)",
                    "external_id": "REF-601",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://owasp.org/www-project-web-security-testing-guide/latest/4-Web_Application_Security_Testing/06-Session_Management_Testing/03-Testing_for_Session_Fixation.html"
                }
            ],
            "id": "attack-pattern--c1e3e934-5b43-4af9-b92b-9a4837a90c14",
            "modified": "2021-06-24T00:00:00.000Z",
            "name": "Session Fixation",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_can_follow_refs": [
                "attack-pattern--414d0884-4f46-4a51-b4ea-72125c7f5f9e"
            ],
            "x_capec_child_of_refs": [
                "attack-pattern--63f43efb-7a34-4302-b3dc-8245100fdea9"
            ],
            "x_capec_consequences": {
                "Access_Control": [
                    "Gain Privileges"
                ],
                "Authorization": [
                    "Gain Privileges"
                ],
                "Confidentiality": [
                    "Gain Privileges"
                ]
            },
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_example_instances": [
                "Consider a banking application that issues a session identifier in the URL to a user before login, and uses the same identifier to identify the customer following successful authentication. An attacker can easily leverage session fixation to access a victim's account by having the victim click on a forged link that contains a valid session identifier from a trapped session setup by the attacker. Once the victim is authenticated, the attacker can take over the session and continue with the same levels of privilege as the victim.",
                "An attacker can hijack user sessions, bypass authentication controls and possibly gain administrative privilege by fixating the session of a user authenticating to the Management Console on certain versions of Macromedia JRun 4.0. This can be achieved by setting the session identifier in the user's browser and having the user authenticate to the Management Console. Session fixation is possible since the application server does not regenerate session identifiers when there is a change in the privilege levels. See also: CVE-2004-2182"
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Setup the Attack: </b>Setup a session: The attacker has to setup a trap session that provides a valid session identifier, or select an arbitrary identifier, depending on the mechanism employed by the application. A trap session is a dummy session established with the application by the attacker and is used solely for the purpose of obtaining valid session identifiers. The attacker may also be required to periodically refresh the trap session in order to obtain valid session identifiers.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>The attacker chooses a predefined identifier that they know.</td></tr><tr><td>The attacker creates a trap session for the victim.</td></tr></tbody></table></ol></div><div><h3>Experiment</h3><ol><li> <p> <b>Attract a Victim: </b>Fixate the session: The attacker now needs to transfer the session identifier from the trap session to the victim by introducing the session identifier into the victim's browser. This is known as fixating the session. The session identifier can be introduced into the victim's browser by leveraging cross site scripting vulnerability, using META tags or setting HTTP response headers in a variety of ways.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Attackers can put links on web sites (such as forums, blogs, or comment forms).</td></tr><tr><td>Attackers can establish rogue proxy servers for network protocols that give out the session ID and then redirect the connection to the legitimate service.</td></tr><tr><td>Attackers can email attack URLs to potential victims through spam and phishing techniques.</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Abuse the Victim's Session: </b>Takeover the fixated session: Once the victim has achieved a higher level of privilege, possibly by logging into the application, the attacker can now take over the session using the fixated session identifier.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>The attacker loads the predefined session ID into their browser and browses to protected data or functionality.</td></tr><tr><td>The attacker loads the predefined session ID into their software and utilizes functionality with the rights of the victim.</td></tr></tbody></table></ol></div>",
            "x_capec_likelihood_of_attack": "Medium",
            "x_capec_prerequisites": [
                "Session identifiers that remain unchanged when the privilege levels change.",
                "Permissive session management mechanism that accepts random user-generated session identifiers",
                "Predictable session identifiers"
            ],
            "x_capec_resources_required": [
                "None: No specialized resources are required to execute this type of attack."
            ],
            "x_capec_skills_required": {
                "Low": "Only basic skills are required to determine and fixate session identifiers in a user's browser. Subsequent attacks may require greater skill levels depending on the attackers' motives."
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}