{
    "id": "bundle--442ab846-2495-4616-9217-69e0aa940388",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An attacker spoofs a UDDI, ebXML, or similar message in order to impersonate a service provider in an e-business transaction. UDDI, ebXML, and similar standards are used to identify businesses in e-business transactions. Among other things, they identify a particular participant, WSDL information for SOAP transactions, and supported communication protocols, including security protocols. By spoofing one of these messages an attacker could impersonate a legitimate business in a transaction or could manipulate the protocols used between a client and business. This could result in disclosure of sensitive information, loss of message integrity, or even financial fraud.",
            "external_references": [
                {
                    "external_id": "CAPEC-218",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/218.html"
                },
                {
                    "external_id": "CWE-345",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/345.html"
                }
            ],
            "id": "attack-pattern--e7c0cce1-203e-454d-8a9a-76fa7ca120f8",
            "modified": "2019-04-04T00:00:00.000Z",
            "name": "Spoofing of UDDI/ebXML Messages",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_child_of_refs": [
                "attack-pattern--bd4f8f46-1bc7-40a9-b15a-e36b7671cf5b"
            ],
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_prerequisites": [
                "The targeted business's UDDI or ebXML information must be served from a location that the attacker can spoof or compromise or the attacker must be able to intercept and modify unsecured UDDI/ebXML messages in transit."
            ],
            "x_capec_resources_required": [
                "The attacker must be able to force the target user to accept their spoofed UDDI or ebXML message as opposed to the a message associated with a legitimate company. Depending on the follow-on for the attack, the attacker may also need to serve its own web services."
            ],
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Medium",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}