{
    "id": "bundle--123aee75-f084-4736-899a-91d8a145c1b5",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An attacker uses common delivery mechanisms such as email attachments or removable media to infiltrate the IDE (Integrated Development Environment) of a victim manufacturer with the intent of implanting malware allowing for attack control of the victim IDE environment. The attack then uses this access to exfiltrate sensitive data or information, manipulate said data or information, and conceal these actions. This will allow and aid the attack to meet the goal of future compromise of a recipient of the victim's manufactured product further down in the supply chain.",
            "external_references": [
                {
                    "external_id": "CAPEC-511",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/511.html"
                },
                {
                    "description": "Supply Chain Compromise: Compromise Software Dependencies and Development Tools",
                    "external_id": "T1195.001",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1195/001"
                },
                {
                    "description": "John F. Miller, Supply Chain Attack Framework and Attack Patterns, 2013, The MITRE Corporation",
                    "external_id": "REF-439",
                    "source_name": "reference_from_CAPEC",
                    "url": "http://www.mitre.org/sites/default/files/publications/supply-chain-attack-framework-14-0228.pdf"
                }
            ],
            "id": "attack-pattern--5f69cd20-0000-4733-85d5-9bb2fdcaeb36",
            "modified": "2022-09-29T00:00:00.000Z",
            "name": "Infiltration of Software Development Environment",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_child_of_refs": [
                "attack-pattern--efb74200-657d-438c-aaff-bbd9644dd72d"
            ],
            "x_capec_domains": [
                "Supply Chain"
            ],
            "x_capec_example_instances": [
                "The attacker, knowing the victim runs email on a system adjacent to the IDE system, sends a phishing email with a malicious attachment to the victim. When viewed, the malicious attachment installs a backdoor that allows the attacker to remotely compromise the adjacent IDE system from the victim's workstation. The attacker is then able to exfiltrate sensitive data about the software being developed on the IDE system.",
                "Using rogue versions of Xcode (Apple's app development tool) downloaded from third-party websites, it was possible for the adversary to insert malicious code into legitimate apps during the development process."
            ],
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_prerequisites": [
                "The victim must use email or removable media from systems running the IDE (or systems adjacent to the IDE systems).",
                "The victim must have a system running exploitable applications and/or a vulnerable configuration to allow for initial infiltration.",
                "The attacker must have working knowledge of some if not all of the components involved in the IDE system as well as the infrastructure."
            ],
            "x_capec_skills_required": {
                "High": "Development skills to construct malicious attachments that can be used to exploit vulnerabilities in typical desktop applications or system configurations. The malicious attachments should be crafted well enough to bypass typical defensive systems (IDS, anti-virus, etc)",
                "Medium": "Intelligence about the manufacturer's operating environment and infrastructure."
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}