{
    "id": "bundle--414da2b6-d8be-4538-a0dc-f1c53b13b664",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "This type of attack involves an attacker leveraging meta-characters in email headers to inject improper behavior into email programs. Email software has become increasingly sophisticated and feature-rich. In addition, email applications are ubiquitous and connected directly to the Web making them ideal targets to launch and propagate attacks. As the user demand for new functionality in email applications grows, they become more like browsers with complex rendering and plug in routines. As more email functionality is included and abstracted from the user, this creates opportunities for attackers. Virtually all email applications do not list email header information by default, however the email header contains valuable attacker vectors for the attacker to exploit particularly if the behavior of the email client application is known. Meta-characters are hidden from the user, but can contain scripts, enumerations, probes, and other attacks against the user's system.",
            "external_references": [
                {
                    "external_id": "CAPEC-41",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/41.html"
                },
                {
                    "external_id": "CWE-150",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/150.html"
                },
                {
                    "external_id": "CWE-88",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/88.html"
                },
                {
                    "external_id": "CWE-697",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/697.html"
                },
                {
                    "description": "G. Hoglund, G. McGraw, Exploiting Software: How to Break Code, 2004--02, Addison-Wesley",
                    "external_id": "REF-1",
                    "source_name": "reference_from_CAPEC"
                }
            ],
            "id": "attack-pattern--30047c4f-cbf1-48ff-906c-3c6d58feb1a1",
            "modified": "2022-09-29T00:00:00.000Z",
            "name": "Using Meta-characters in E-mail Headers to Inject Malicious Payloads",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_child_of_refs": [
                "attack-pattern--7f0f7de2-bf09-4f60-86bb-6933192b7128",
                "attack-pattern--3e3f4570-827b-4e0e-859b-00a4b13a1a65"
            ],
            "x_capec_consequences": {
                "Availability": [
                    "Execute Unauthorized Commands (Run Arbitrary Code)"
                ],
                "Confidentiality": [
                    "Execute Unauthorized Commands (Run Arbitrary Code)"
                ],
                "Integrity": [
                    "Execute Unauthorized Commands (Run Arbitrary Code)"
                ]
            },
            "x_capec_domains": [
                "Software",
                "Software"
            ],
            "x_capec_example_instances": [
                "\n               <xhtml:div style=\"margin-left:1em;\" class=\"informative\">To:<someone@example.com>From:<badguy@example.com>Header<SCRIPT>payme</SCRIPT>def: whatever</xhtml:div>\n            ",
                "\n               <xhtml:p>Meta-characters are among the most valuable tools attackers have to deceive users into taking some action on their behalf. E-mail is perhaps the most efficient and cost effective attack distribution tool available, this has led to the phishing pandemic.</xhtml:p>\n               <xhtml:p>Meta-characters like \\w \\s \\d ^ can allow the attacker to escape out of the expected behavior to execute additional commands. Escaping out the process (such as email client) lets the attacker run arbitrary code in the user's process.</xhtml:p>\n            "
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Experiment</h3><ol><li> <p> <b>Identify and characterize metacharacter-processing vulnerabilities in email headers: </b>An attacker creates emails with headers containing various metacharacter-based malicious payloads in order to determine whether the target application processes the malicious content and in what manner it does so.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Use an automated tool (fuzzer) to create malicious emails headers containing metacharacter-based payloads.</td></tr><tr><td>Manually tampering email headers to inject malicious metacharacter-based payload content in them.</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p>An attacker leverages vulnerabilities identified during the Experiment Phase to inject malicious email headers and cause the targeted email application to exhibit behavior outside of its expected constraints.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Send emails with specifically-constructed, metacharacter-based malicious payloads in the email headers to targeted systems running email processing applications identified as vulnerable during the Experiment Phase.</td></tr></tbody></table></ol></div>",
            "x_capec_likelihood_of_attack": "High",
            "x_capec_prerequisites": [
                "This attack targets most widely deployed feature rich email applications, including web based email programs."
            ],
            "x_capec_skills_required": {
                "Low": "To distribute email"
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}