{
    "id": "bundle--63a226ef-c1b6-4e5c-859d-9cf67a141275",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary creates a client application to interface with a target service where the client violates assumptions the service makes about clients. Services that have designated client applications (as opposed to services that use general client applications, such as IMAP or POP mail servers which can interact with any IMAP or POP client) may assume that the client will follow specific procedures.",
            "external_references": [
                {
                    "external_id": "CAPEC-202",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/202.html"
                },
                {
                    "external_id": "CWE-602",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/602.html"
                }
            ],
            "id": "attack-pattern--158c1c58-9c44-4822-a8a4-6cb791c5b3cb",
            "modified": "2022-02-22T00:00:00.000Z",
            "name": "Create Malicious Client",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Standard",
            "x_capec_child_of_refs": [
                "attack-pattern--1fa1539d-4a13-4453-bf43-ad0987b2fbf5"
            ],
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_extended_description": "\n            <xhtml:p>For example, servers may assume that clients will accurately compute values (such as prices), will send correctly structured messages, and will attempt to ensure efficient interactions with the server. By reverse-engineering a client and creating their own version, an adversary can take advantage of these assumptions to abuse service functionality.</xhtml:p>\n            <xhtml:p>For example, a purchasing service might send a unit price to its client and expect the client to correctly compute the total cost of a purchase. If the adversary uses a malicious client, however, the adversary could ignore the server input and declare any total price. Likewise, an adversary could configure the client to retain network or other server resources for longer than legitimately necessary in order to degrade server performance. Even services with general clients can be susceptible to this attack if they assume certain client behaviors. However, such services generally can make fewer assumptions about the behavior of their clients in the first place and, as such, are less likely to make assumptions that an adversary can exploit.</xhtml:p>\n         ",
            "x_capec_prerequisites": [
                "The targeted service must make assumptions about the behavior of the client application that interacts with it, which can be abused by an adversary."
            ],
            "x_capec_resources_required": [
                "The adversary must be able to reverse engineer a client of the targeted service. However, the adversary does not need to reverse engineer all client functionality - they only need to recreate enough of the functionality to access the desired server functionality."
            ],
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Medium",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}