{
    "id": "bundle--55811bde-e05a-4e5f-98a4-9a4ffe81c1a8",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary examines a target application's cache, or a browser cache, for sensitive information. Many applications that communicate with remote entities or which perform intensive calculations utilize caches to improve efficiency. However, if the application computes or receives sensitive information and the cache is not appropriately protected, an attacker can browse the cache and retrieve this information. This can result in the disclosure of sensitive information.",
            "external_references": [
                {
                    "external_id": "CAPEC-204",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/204.html"
                },
                {
                    "external_id": "CWE-524",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/524.html"
                },
                {
                    "external_id": "CWE-311",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/311.html"
                },
                {
                    "external_id": "CWE-1239",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/1239.html"
                },
                {
                    "external_id": "CWE-1258",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/1258.html"
                },
                {
                    "description": "Data from Local System",
                    "external_id": "T1005",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1005"
                }
            ],
            "id": "attack-pattern--c2a87533-3c81-40b3-b529-9560c644f70d",
            "modified": "2022-09-29T00:00:00.000Z",
            "name": "Lifting Sensitive Data Embedded in Cache",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_can_precede_refs": [
                "attack-pattern--886a7175-e28a-4e6d-bd22-3b1497e31dc7"
            ],
            "x_capec_child_of_refs": [
                "attack-pattern--d17eb5a5-1361-4e13-a969-e4d587d13b3d"
            ],
            "x_capec_domains": [
                "Software",
                "Physical Security",
                "Hardware"
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Identify Application Cache: </b>An adversary first identifies an application that utilizes a cache. This could either be a web application storing data in a browser cache, or an application running on a separate machine. The adversary examines the cache to determine file permissions and possible encryption.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Use probing tools to look for application cache files on a machine.</td></tr><tr><td>Use a web application and determine if any sensitive information is stored in browser cache.</td></tr></tbody></table></ol></div><div><h3>Experiment</h3><ol><li> <p> <b>Attempt to Access Cache: </b>Once the cache has been discovered, the adversary attempts to access the cached data. This often requires previous access to a machine hosting the target application.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Use priviledge escalation to access cache files that might have strict privileges.</td></tr><tr><td>If the application cache is encrypted with weak encryption, attempt to understand the encryption technique and break the encryption.</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Lift Sensitive Data from Cache: </b>After gaining access to cached data, an adversary looks for potentially sensitive information and stores it for malicious use. This sensitive data could possibly be used in follow-up attacks related to authentication or authorization.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Using a public computer, or gaining access to a victim's computer, examine browser cache to look for sensitive data left over from previous sessions.</td></tr></tbody></table></ol></div>",
            "x_capec_prerequisites": [
                "The target application must store sensitive information in a cache.",
                "The cache must be inadequately protected against attacker access."
            ],
            "x_capec_resources_required": [
                "The attacker must be able to reach the target application's cache. This may require prior access to the machine on which the target application runs. If the cache is encrypted, the attacker would need sufficient computational resources to crack the encryption. With strong encryption schemes, doing this could be intractable, but weaker encryption schemes could allow an attacker with sufficient resources to read the file."
            ],
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Medium",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}