{
    "id": "bundle--1a2a1a54-0da5-476c-a5b2-6fa2b59e71f7",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary loads malicious code onto a USB memory stick in order to infect any system which the device is plugged in to. USB drives present a significant security risk for business and government agencies. Given the ability to integrate wireless functionality into a USB stick, it is possible to design malware that not only steals confidential data, but sniffs the network, or monitor keystrokes, and then exfiltrates the stolen data off-site via a Wireless connection. Also, viruses can be transmitted via the USB interface without the specific use of a memory stick. The attacks from USB devices are often of such sophistication that experts conclude they are not the work of single individuals, but suggest state sponsorship. These attacks can be performed by an adversary with direct access to a target system or can be executed via means such as USB Drop Attacks.",
            "external_references": [
                {
                    "external_id": "CAPEC-457",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/457.html"
                },
                {
                    "external_id": "CWE-1299",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/1299.html"
                },
                {
                    "description": "Replication Through Removable Media",
                    "external_id": "T1091",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1091"
                },
                {
                    "description": "Communication Through Removable Media",
                    "external_id": "T1092",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1092"
                },
                {
                    "description": "Jon Boyens, Angela Smith, Nadya Bartol, Kris Winkler, Alex Holbrook, Matthew Fallon, Cybersecurity Supply Chain Risk Management Practices for Systems and Organizations (2nd Draft), 2021--10---28, National Institute of Standards and Technology (NIST)",
                    "external_id": "REF-379",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.800-161r1-draft2.pdf"
                }
            ],
            "id": "attack-pattern--a55491b8-b521-44f4-a905-a6ed82b8e7e8",
            "modified": "2023-01-24T00:00:00.000Z",
            "name": "USB Memory Attacks",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_can_precede_refs": [
                "attack-pattern--6f7f4589-3abb-4aa8-ac80-1a6715d75a8b"
            ],
            "x_capec_child_of_refs": [
                "attack-pattern--dc05cb9b-00ae-4fd0-8743-b1fb507ea1d3"
            ],
            "x_capec_domains": [
                "Software",
                "Hardware"
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Determine Target System: </b>In certain cases, the adversary will explore an organization's network to determine a specific target machine to exploit based on the information it contains or privileges the main user may possess.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>If needed, the adversary explores an organization's network to determine if any specific systems of interest exist.</td></tr></tbody></table></ol></div><div><h3>Experiment</h3><ol><li> <p> <b>Develop or Obtain malware and install on a USB device: </b>The adversary develops or obtains the malicious software necessary to exploit the target system, which they then install on an external USB device such as a USB flash drive.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>The adversary can develop or obtain malware for to perform a variety of tasks such as sniffing network traffic or monitoring keystrokes.</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Connect or deceive a user into connecting the infected USB device: </b>Once the malware has been placed on an external USB device, the adversary connects the device to the target system or deceives a user into connecting the device to the target system such as in a USB Drop Attack.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>The adversary connects the USB device to a specified target system or performs a USB Drop Attack, hoping a user will find and connect the USB device on their own. Once the device is connected, the malware executes giving the adversary access to network traffic, credentials, etc.</td></tr></tbody></table></ol></div>",
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_prerequisites": [
                "Some level of physical access to the device being attacked.",
                "Information pertaining to the target organization on how to best execute a USB Drop Attack."
            ],
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}