{
    "id": "bundle--85ab0c2d-5f6e-45a0-8549-2f3bc4957acd",
    "objects": [
        {
            "created": "2021-06-24T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "\n            <xhtml:p>An adversary exploits security vulnerabilities or inherent functionalities of a web browser, in order to manipulate traffic between two endpoints.</xhtml:p>\n         ",
            "external_references": [
                {
                    "external_id": "CAPEC-662",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/662.html"
                },
                {
                    "external_id": "CWE-300",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/300.html"
                },
                {
                    "external_id": "CWE-494",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/494.html"
                },
                {
                    "description": "Man in the Browser",
                    "external_id": "T1185",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1185"
                },
                {
                    "description": "Man-in-the-browser attack",
                    "source_name": "OWASP Attacks",
                    "url": "https://owasp.org/www-community/attacks/Man-in-the-browser_attack"
                },
                {
                    "description": "Man-in-the-browser attack, Open Web Application Security Project (OWASP)",
                    "external_id": "REF-629",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://owasp.org/www-community/attacks/Man-in-the-browser_attack"
                },
                {
                    "description": "Liviu Arsene, Oil and Gas Spearphishing Campaigns Drop Agent Tesla Spyware in Advance of Historic OPEC+ Deal, 2020--04---21, Bitdefender Labs",
                    "external_id": "REF-630",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://labs.bitdefender.com/2020/04/oil-gas-spearphishing-campaigns-drop-agent-tesla-spyware-in-advance-of-historic-opec-deal/"
                },
                {
                    "description": "Amit Klein, Man-in-the-Mobile Attacks Single Out Android, 2012--07---10, SecurityIntelligence",
                    "external_id": "REF-631",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://securityintelligence.com/man-in-the-mobile-attacks-single-out-android/"
                },
                {
                    "description": "Kelly Jackson Higgins, New 'Boy In The Browser' Attacks On The Rise, 2011--02---14, Dark Reading, Informa PLC",
                    "external_id": "REF-632",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://www.darkreading.com/risk/new-boy-in-the-browser-attacks-on-the-rise/d/d-id/1135247"
                }
            ],
            "id": "attack-pattern--558870ad-9433-4e39-a0b0-d9b5c4691862",
            "modified": "2022-09-29T00:00:00.000Z",
            "name": "Adversary in the Browser (AiTB)",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Standard",
            "x_capec_alternate_terms": [
                "Man in the Browser",
                "Boy in the Browser",
                "Man in the Mobile"
            ],
            "x_capec_can_follow_refs": [
                "attack-pattern--0123fa83-2d47-4398-85f1-30ce114abb9a",
                "attack-pattern--482cb9fc-0122-49f0-b6df-6d2d42098b0a"
            ],
            "x_capec_child_of_refs": [
                "attack-pattern--38964770-4f39-4191-89cf-73a625162b2b"
            ],
            "x_capec_consequences": {
                "Access_Control": [
                    "Gain Privileges"
                ],
                "Authorization": [
                    "Gain Privileges"
                ],
                "Confidentiality": [
                    "Gain Privileges",
                    "Read Data"
                ],
                "Integrity": [
                    "Modify Data"
                ]
            },
            "x_capec_domains": [
                "Communications",
                "Software"
            ],
            "x_capec_example_instances": [
                "\n               <xhtml:p>An adversary conducts a phishing attack and tricks a victim into installing a malicious browser plugin. The adversary then positions themself between the victim and their banking institution. The victim begins by initiating a funds transfer from their personal savings to their personal checking account. Using injected JavaScript, the adversary captures this request and modifies it to transfer an increased amount of funds to an account that they controls, before sending it to the bank. The bank processes the transfer and sends the confirmation notice back to the victim, which is instead intercepted by the adversary. The adversary modifies the confirmation to reflect the original transaction details and sends this modified message back to the victim. Upon receiving the confirmation, the victim assumes the transfer was successful and is unaware that their money has just been transferred to the adversary.</xhtml:p>\n            ",
                "\n               <xhtml:p>In 2020, the Agent Tesla malware was leveraged to conduct AiTB attacks against organizations within the gas, oil, and other energy sectors. The malware was delivered via a spearphishing campaign and has the capability to form-grab, keylog, copy clipboard data, extract credentials, and capture screenshots. [REF-630]</xhtml:p>\n            ",
                "\n               <xhtml:p>Boy in the browser attacks are a subset of AiTB attacks. Similar to AiTB attacks, the adversary must first trick the victim into installing a Trojan, either via social engineering or drive-by-download attacks. The malware then modifies the victim's \"hosts\" file in order to reroute web traffic from an intended website to an adversary-controlled website that mimics the legitimate website. The adversary is now able to observe, intercept, and/or modify all traffic, as in a traditional Adversary in the Middle attack (CAPEC-94). BiTB attacks are low-cost, easy to execute, and more difficult to detect since the malware often removes itself once the attack has concluded. [REF-631]</xhtml:p>\n            ",
                "\n               <xhtml:p>Man in the Mobile attacks are a subset of AiTB attacks that target mobile device users. Like AiTB attacks, an adversary convinces a victim to install a Trojan mobile application on their mobile device, often under the guise of security. Once the victim has installed the application, the adversary can capture all SMS traffic to bypass SMS-based out-of-band authentication systems. [REF-632]</xhtml:p>\n            "
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Experiment</h3><ol><li> <p>The adversary tricks the victim into installing the Trojan Horse malware onto their system.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Conduct phishing attacks, drive-by malware installations, or masquerade malicious browser extensions as being legitimate.</td></tr></tbody></table><li> <p>The adversary inserts themself into the communication channel initially acting as a routing proxy between the two targeted components.</p></li></ol></div><div><h3>Exploit</h3><ol><li> <p>The adversary observes, filters, or alters passed data of their choosing to gain access to sensitive information or to manipulate the actions of the two target components for their own purposes.</p></li></ol></div>",
            "x_capec_extended_description": "\n            <xhtml:p>This attack first requires the adversary to trick the victim into installing a Trojan Horse application on their system, such as a malicious web browser plugin, which the adversary then leverages to mount the attack. The victim interacts with a web application, such as a banking website, in a normal manner and under the assumption that the connection is secure. However, the adversary can now alter and/or reroute traffic between the client application (e.g., web browser) and the coinciding endpoint, while simultaneously displaying intended transactions and data back to the user. The adversary may also be able to glean cookies, HTTP sessions, and SSL client certificates, which can be used to pivot into an authenticated intranet. Identifying AITB is often difficult because these attacks are successful even when security mechanisms such as SSL/PKI and multifactor authentication are present, since they still function as intended during the attack.</xhtml:p>\n         ",
            "x_capec_likelihood_of_attack": "High",
            "x_capec_prerequisites": [
                "The adversary must install or convince a user to install a Trojan.",
                "There are two components communicating with each other.",
                "An attacker is able to identify the nature and mechanism of communication between the two target components.",
                "Strong mutual authentication is not used between the two target components yielding opportunity for adversarial interposition.",
                "For browser pivoting, the SeDebugPrivilege and a high-integrity process must both exist to execute this attack."
            ],
            "x_capec_skills_required": {
                "Medium": "Tricking the victim into installing the Trojan is often the most difficult aspect of this attack. Afterwards, the remainder of this attack is fairly trivial."
            },
            "x_capec_status": "Stable",
            "x_capec_typical_severity": "Very High",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}