{
    "id": "bundle--27349b4b-4dfb-48c8-b9b7-503f16b44c55",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An attacker with access to the development environment process of an application-specific integrated circuit (ASIC) for a victim system being developed or maintained after initial deployment can insert malicious functionality into the system for the purpose of disruption or further compromise.",
            "external_references": [
                {
                    "external_id": "CAPEC-539",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/539.html"
                },
                {
                    "description": "Supply Chain Compromise: Compromise Hardware Supply Chain",
                    "external_id": "T1195.003",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1195/003"
                },
                {
                    "description": "John F. Miller, Supply Chain Attack Framework and Attack Patterns, 2013, The MITRE Corporation",
                    "external_id": "REF-439",
                    "source_name": "reference_from_CAPEC",
                    "url": "http://www.mitre.org/sites/default/files/publications/supply-chain-attack-framework-14-0228.pdf"
                }
            ],
            "id": "attack-pattern--bfb711d6-f12d-496e-88b9-2c0184485976",
            "modified": "2022-09-29T00:00:00.000Z",
            "name": "ASIC With Malicious Functionality",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_child_of_refs": [
                "attack-pattern--efb74200-657d-438c-aaff-bbd9644dd72d"
            ],
            "x_capec_domains": [
                "Supply Chain",
                "Hardware"
            ],
            "x_capec_example_instances": [
                "A hardware manufacturer periodically updates its ASIC with new features. The attacker, knowing the manufacturer runs email on a system adjacent to the hardware development systems used for ASIC design, sends a phishing email with a malicious attachment to the manufacturer. When viewed, the malicious attachment installs a backdoor that allows the attacker to remotely compromise the adjacent ASIC development system. The attacker is then able to exfiltrate and alter sensitive data on the ASIC system, allowing for future compromise once a new AISC is deployed at the victim location."
            ],
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_prerequisites": [
                "The attacker must have working knowledge of some if not all of the components involved in the target system as well as the infrastructure and development environment of the manufacturer.",
                "Advanced knowledge about the ASIC installed within the target system."
            ],
            "x_capec_skills_required": {
                "High": "Able to develop and manufacture malicious subroutines for an ASIC environment without degradation of existing functions and processes."
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}