{
    "id": "bundle--99898523-a938-4971-a852-991d688a2e4d",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "Adversaries implant malicious code in open source software (OSS) libraries to have it widely distributed, as OSS is commonly downloaded by developers and other users to incorporate into software development projects. The adversary can have a particular system in mind to target, or the implantation can be the first stage of follow-on attacks on many systems.",
            "external_references": [
                {
                    "external_id": "CAPEC-538",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/538.html"
                },
                {
                    "external_id": "CWE-494",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/494.html"
                },
                {
                    "external_id": "CWE-829",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/829.html"
                },
                {
                    "description": "Supply Chain Compromise: Software Dependencies and Development Tools",
                    "external_id": "T1195.001",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1195/001"
                },
                {
                    "description": "John F. Miller, Supply Chain Attack Framework and Attack Patterns, 2013, The MITRE Corporation",
                    "external_id": "REF-439",
                    "source_name": "reference_from_CAPEC",
                    "url": "http://www.mitre.org/sites/default/files/publications/supply-chain-attack-framework-14-0228.pdf"
                }
            ],
            "id": "attack-pattern--ca626464-877a-4f42-83b7-7451cfe71a38",
            "modified": "2023-01-24T00:00:00.000Z",
            "name": "Open-Source Library Manipulation",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_child_of_refs": [
                "attack-pattern--efb74200-657d-438c-aaff-bbd9644dd72d"
            ],
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_example_instances": [
                "An adversary with access to an open source code project introduces a hard-to-find bug in the software that allows under very specific conditions for encryption to be disabled on data streams. The adversary commits the change to the code which is picked up by a manufacturer who develops VPN software. It is eventually deployed at the victim's location where the very specific conditions are met giving the adversary the ability to sniff plaintext traffic thought to be encrypted. This can provide to the adversary access to sensitive data of the victim."
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Determine the relevant open-source code project to target: </b>The adversary will make the selection based on various criteria:<xhtml:ul></p></li></ol></div><div><h3>Experiment</h3><ol><li> <p> <b>Develop a plan for malicious contribution: </b>The adversary develops a plan to contribute malicious code, taking the following into consideration:<xhtml:ul></p></li></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Execute the plan for malicious contribution: </b>Write the code to be contributed based on the plan and then submit the contribution. Multiple commits, possibly using multiple identities, will help obscure the attack. Monitor the contribution site to try to determine if the code has been uploaded to the target system.</p></li></ol></div>",
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_prerequisites": [
                "Access to the open source code base being used by the manufacturer in a system being developed or currently deployed at a victim location."
            ],
            "x_capec_skills_required": {
                "High": "Advanced knowledge about the inclusion and specific usage of an open source code project within system being targeted for infiltration."
            },
            "x_capec_status": "Stable",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}