{
    "id": "bundle--5ded7113-82b4-4e79-abff-b0659c80533a",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "Blind SQL Injection results from an insufficient mitigation for SQL Injection. Although suppressing database error messages are considered best practice, the suppression alone is not sufficient to prevent SQL Injection. Blind SQL Injection is a form of SQL Injection that overcomes the lack of error messages. Without the error messages that facilitate SQL Injection, the adversary constructs input strings that probe the target through simple Boolean SQL expressions. The adversary can determine if the syntax and structure of the injection was successful based on whether the query was executed or not. Applied iteratively, the adversary determines how and where the target is vulnerable to SQL Injection.",
            "external_references": [
                {
                    "external_id": "CAPEC-7",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/7.html"
                },
                {
                    "external_id": "CWE-89",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/89.html"
                },
                {
                    "external_id": "CWE-209",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/209.html"
                },
                {
                    "external_id": "CWE-74",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/74.html"
                },
                {
                    "external_id": "CWE-20",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/20.html"
                },
                {
                    "external_id": "CWE-697",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/697.html"
                },
                {
                    "external_id": "CWE-707",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/707.html"
                },
                {
                    "description": "Blind SQL Injection",
                    "source_name": "OWASP Attacks",
                    "url": "https://owasp.org/www-community/attacks/Blind_SQL_Injection"
                }
            ],
            "id": "attack-pattern--9116da7f-a60e-4186-b42a-218f1b0eb269",
            "modified": "2022-09-29T00:00:00.000Z",
            "name": "Blind SQL Injection",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_child_of_refs": [
                "attack-pattern--42acc604-a86c-46f7-bd03-6e532c02d85e"
            ],
            "x_capec_consequences": {
                "Availability": [
                    "Execute Unauthorized Commands (Run Arbitrary Code)"
                ],
                "Confidentiality": [
                    "Read Data",
                    "Execute Unauthorized Commands (Run Arbitrary Code)"
                ],
                "Integrity": [
                    "Modify Data",
                    "Execute Unauthorized Commands (Run Arbitrary Code)"
                ]
            },
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_example_instances": [
                "\n               <xhtml:p>An adversary may try entering something like \"username' AND 1=1; --\" in an input field. If the result is the same as when the adversary entered \"username\" in the field, then the adversary knows that the application is vulnerable to SQL Injection. The adversary can then ask yes/no questions from the database server to extract information from it. For example, the adversary can extract table names from a database using the following types of queries:</xhtml:p>\n               <xhtml:div style=\"margin-left:1em;\" class=\"informative\">\"username' AND ascii(lower(substring((SELECT TOP 1 name FROM sysobjects WHERE xtype='U'), 1, 1))) > 108\".</xhtml:div>\n               <xhtml:p>If the above query executes properly, then the adversary knows that the first character in a table name in the database is a letter between m and z. If it doesn't, then the adversary knows that the character must be between a and l (assuming of course that table names only contain alphabetic characters). By performing a binary search on all character positions, the adversary can determine all table names in the database. Subsequently, the adversary may execute an actual attack and send something like:</xhtml:p>\n               <xhtml:div style=\"margin-left:1em;\" class=\"informative\">\"username'; DROP TABLE trades; --</xhtml:div>\n            ",
                "In the PHP application TimeSheet 1.1, an adversary can successfully retrieve username and password hashes from the database using Blind SQL Injection. If the adversary is aware of the local path structure, the adversary can also remotely execute arbitrary code and write the output of the injected queries to the local path. Blind SQL Injection is possible since the application does not properly sanitize the $_POST['username'] variable in the login.php file. See also: CVE-2006-4705"
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p>[Hypothesize SQL queries in application]<xhtml:p>Generated hypotheses regarding the SQL queries in an application. For example, the adversary may hypothesize that their input is passed directly into a query that looks like:</xhtml:p>\n                  <xhtml:div style=\"margin-left:1em;\" class=\"informative\">\"SELECT * FROM orders WHERE ordernum = _____\"or\"SELECT * FROM orders WHERE ordernum IN (_____)\"or\"SELECT * FROM orders WHERE ordernum in (_____) ORDER BY _____\"</xhtml:div>\n                  <xhtml:p>Of course, there are many other possibilities.</xhtml:p>\n               </p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Research types of SQL queries and determine which ones could be used at various places in an application.</td></tr></tbody></table><li> <p>[Determine how to inject information into the queries]<xhtml:p>Determine how to inject information into the queries from the previous step such that the injection does not impact their logic. For example, the following are possible injections for those queries:</xhtml:p>\n                  <xhtml:div style=\"margin-left:1em;\" class=\"informative\">\"5' OR 1=1; --\"and\"5) OR 1=1; --\"and\"ordernum DESC; --\"</xhtml:div>\n               </p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Add clauses to the SQL queries such that the query logic does not change.</td></tr><tr><td>Add delays to the SQL queries in case server does not provide clear error messages (e.g. WAITFOR DELAY '0:0:10' in SQL Server or BENCHMARK(1000000000,MD5(1) in MySQL). If these can be injected into the queries, then the length of time that the server takes to respond reveals whether the query is injectable or not.</td></tr></tbody></table></ol></div><div><h3>Experiment</h3><ol><li> <p> <b>Determine user-controllable input susceptible to injection: </b>Determine the user-controllable input susceptible to injection. For each user-controllable input that the adversary suspects is vulnerable to SQL injection, attempt to inject the values determined in the previous step. If an error does not occur, then the adversary knows that the SQL injection was successful.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Use web browser to inject input through text fields or through HTTP GET parameters.</td></tr><tr><td>Use a web application debugging tool such as Tamper Data, TamperIE, WebScarab,etc. to modify HTTP POST parameters, hidden fields, non-freeform fields, etc.</td></tr><tr><td>Use network-level packet injection tools such as netcat to inject input</td></tr><tr><td>Use modified client (modified by reverse engineering) to inject input.</td></tr></tbody></table><li> <p> <b>Determine database type: </b>Determines the type of the database, such as MS SQL Server or Oracle or MySQL, using logical conditions as part of the injected queries</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Try injecting a string containing char(0x31)=char(0x31) (this evaluates to 1=1 in SQL Server only)</td></tr><tr><td>Try injecting a string containing 0x313D31 (this evaluates to 1=1 in MySQL only)</td></tr><tr><td>Inject other database-specific commands into input fields susceptible to SQL Injection. The adversary can determine the type of database that is running by checking whether the query executed successfully or not (i.e. whether the adversary received a normal response from the server or not).</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Extract information about database schema: </b>Extract information about database schema by getting the database to answer yes/no questions about the schema.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Automatically extract database schema using a tool such as Absinthe.</td></tr><tr><td>Manually perform the blind SQL Injection to extract desired information about the database schema.</td></tr></tbody></table><li> <p> <b>Exploit SQL Injection vulnerability: </b>Use the information obtained in the previous steps to successfully inject the database in order to bypass checks or modify, add, retrieve or delete data from the database</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Use information about how to inject commands into SQL queries as well as information about the database schema to execute attacks such as dropping tables, inserting records, etc.</td></tr></tbody></table></ol></div>",
            "x_capec_likelihood_of_attack": "High",
            "x_capec_prerequisites": [
                "SQL queries used by the application to store, retrieve or modify data.",
                "User-controllable input that is not properly validated by the application as part of SQL queries."
            ],
            "x_capec_resources_required": [
                "None: No specialized resources are required to execute this type of attack."
            ],
            "x_capec_skills_required": {
                "Medium": "Determining the database type and version, as well as the right number and type of parameters to the query being injected in the absence of error messages requires greater skill than reverse-engineering database error messages."
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}