{
    "id": "bundle--1dd57f63-555b-44b5-baa7-8ef0077a7788",
    "objects": [
        {
            "created": "2023-01-24T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary exploits the inherent functionalities of a web browser, in order to establish an unnoticed remote desktop connection in the victim's browser to the adversary's system. The adversary must deploy a web client with a remote desktop session that the victim can access.",
            "external_references": [
                {
                    "external_id": "CAPEC-701",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/701.html"
                },
                {
                    "external_id": "CWE-294",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/294.html"
                },
                {
                    "external_id": "CWE-345",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/345.html"
                },
                {
                    "description": "Tommasi F., Catalano, C., Taurino I., Browser-in-the-Middle (BitM) attack, 2021--04---17",
                    "external_id": "REF-747",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://link.springer.com/article/10.1007/s10207-021-00548-5#citeas"
                }
            ],
            "id": "attack-pattern--3491dd54-d586-4f3d-80c1-9576ee48236b",
            "modified": "2023-01-24T00:00:00.000Z",
            "name": "Browser in the Middle (BiTM)",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Standard",
            "x_capec_can_precede_refs": [
                "attack-pattern--22802ed6-ddc6-4da7-b6be-60b10d26198b",
                "attack-pattern--bd4f8f46-1bc7-40a9-b15a-e36b7671cf5b"
            ],
            "x_capec_child_of_refs": [
                "attack-pattern--38964770-4f39-4191-89cf-73a625162b2b"
            ],
            "x_capec_consequences": {
                "Access_Control": [
                    "Gain Privileges"
                ],
                "Authentication": [
                    "Gain Privileges"
                ],
                "Authorization": [
                    "Read Data"
                ],
                "Confidentiality": [
                    "Gain Privileges",
                    "Read Data"
                ],
                "Integrity": [
                    "Modify Data"
                ]
            },
            "x_capec_domains": [
                "Communications",
                "Software"
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Identify potential targets: </b>The adversary identifies an application or service that the target is likely to use.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>The adversary stands up a server to host the transparent browser and entices victims to use it by using a domain name similar to the legitimate application. In addition to the transparent browser, the adversary could also install a web proxy, sniffer, keylogger, and other tools to assist in their goals.</td></tr></tbody></table></ol></div><div><h3>Experiment</h3><ol><li> <p> <b>Lure victims: </b>The adversary crafts a phishing campaign to lure unsuspecting victims into using the transparent browser.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>An adversary can create a convincing email with a link to download the web client and interact with the transparent browser.</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Monitor and Manipulate Data: </b>When the victim establishes the connection to the transparent browser, the adversary can view victim activity and make alterations to what the victim sees when browsing the web.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Once a victim has established a connection to the transparent browser, the adversary can use installed tools such as a web proxy, keylogger, or additional malicious browser extensions to gather and manipulate data or impersonate the victim.</td></tr></tbody></table></ol></div>",
            "x_capec_extended_description": "\n            <xhtml:p>Unlike Adversary in the Browser, the victim does not need to install a malicious application. Browser in the Middle uses the inherent functionalities of a web browser to convince the victim they are browsing normally under the assumption that the connection is secure. All the actions performed by the victim in the open window are actually performed on the machine of the adversary. These victim-authenticated sessions are available to the adversary to use. All entered data such as passwords and usernames can be logged by the adversary and the content displayed to the victim can be altered arbitrarily. Varieties of multifactor authentication which rely solely on user input and do not use a form of hardware-based secret exchange are vulnerable to browser in the middle.</xhtml:p>\n         ",
            "x_capec_likelihood_of_attack": "Medium",
            "x_capec_prerequisites": [
                "The adversary must create a convincing web client to establish the connection. The victim then needs to be lured onto the adversary's webpage. In addition, the victim's machine must not use local authentication APIs, a hardware token, or a Trusted Platform Module (TPM) to authenticate."
            ],
            "x_capec_resources_required": [
                "A web application with a client is needed to enable the victim's browser to establish a remote desktop connection to the system of the adversary."
            ],
            "x_capec_skills_required": {
                "Medium": ""
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}