{
    "id": "bundle--27723f72-a1eb-4570-975d-a3203a34ec2e",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "Some web applications require users to submit information through an ordered sequence of web forms. This is often done if there is a very large amount of information being collected or if information on earlier forms is used to pre-populate fields or determine which additional information the application needs to collect. An attacker who knows the names of the various forms in the sequence may be able to explicitly type in the name of a later form and navigate to it without first going through the previous forms. This can result in incomplete collection of information, incorrect assumptions about the information submitted by the attacker, or other problems that can impair the functioning of the application.",
            "external_references": [
                {
                    "external_id": "CAPEC-140",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/140.html"
                },
                {
                    "external_id": "CWE-372",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/372.html"
                }
            ],
            "id": "attack-pattern--750dc5a2-e3c4-42d7-ad8a-25a7d1116f03",
            "modified": "2020-07-30T00:00:00.000Z",
            "name": "Bypassing of Intermediate Forms in Multiple-Form Sets",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Standard",
            "x_capec_child_of_refs": [
                "attack-pattern--649abc91-f615-4c9e-91c9-9e66131e2d78"
            ],
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_prerequisites": [
                "The target must collect information from the user in a series of forms where each form has its own URL that the attacker can anticipate and the application must fail to detect attempts to access intermediate forms without first filling out the previous forms."
            ],
            "x_capec_resources_required": [
                "None: No specialized resources are required to execute this type of attack."
            ],
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Medium",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}