{
    "id": "bundle--0cf64d50-d556-4b3f-8042-485f6d56830e",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary uses their privileged position within an authorized software development organization to inject malicious logic into a codebase or product. Supply chain attacks from approved or trusted developers are extremely difficult to detect as it is generally assumed the quality control and internal security measures of these organizations conform to best practices. In some cases the malicious logic is intentional, embedded by a disgruntled employee, programmer, or individual with an otherwise hidden agenda. In other cases, the integrity of the product is compromised by accident (e.g. by lapse in the internal security of the organization that results in a product becoming contaminated). In other cases, the developer embeds a backdoor into a product to serve some purpose, such as product support, but discovery of the backdoor results in its malicious use by adversaries.",
            "external_references": [
                {
                    "external_id": "CAPEC-443",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/443.html"
                },
                {
                    "description": "Information Technology Laboratory, Supply Chain Risk Management (SCRM), 2010, National Institute of Standards and Technology (NIST)",
                    "external_id": "REF-379",
                    "source_name": "reference_from_CAPEC"
                }
            ],
            "id": "attack-pattern--42fc0c14-a6f7-4839-978f-d1553f68f750",
            "modified": "2021-06-24T00:00:00.000Z",
            "name": "Malicious Logic Inserted Into Product Software by Authorized Developer",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_child_of_refs": [
                "attack-pattern--efb74200-657d-438c-aaff-bbd9644dd72d"
            ],
            "x_capec_consequences": {
                "Authorization": [
                    "Execute Unauthorized Commands"
                ]
            },
            "x_capec_likelihood_of_attack": "Medium",
            "x_capec_prerequisites": [
                "Access to the software during the development phase."
            ],
            "x_capec_status": "Stable",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.6"
        }
    ],
    "type": "bundle"
}