{
    "id": "bundle--f16a244b-eec3-49e3-8ea1-4ac271945de0",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary with either direct access to the product assembly process or to the supply of subcomponents used in the product assembly process introduces counterfeit hardware components into product assembly. The assembly containing the counterfeit components results in a system specifically designed for malicious purposes.",
            "external_references": [
                {
                    "external_id": "CAPEC-520",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/520.html"
                },
                {
                    "description": "Supply Chain Compromise: Compromise Hardware Supply Chain",
                    "external_id": "T1195.003",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1195/003"
                },
                {
                    "description": "John F. Miller, Supply Chain Attack Framework and Attack Patterns, 2013, The MITRE Corporation",
                    "external_id": "REF-439",
                    "source_name": "reference_from_CAPEC",
                    "url": "http://www.mitre.org/sites/default/files/publications/supply-chain-attack-framework-14-0228.pdf"
                },
                {
                    "description": "Cristin Goodwin, Joram Borenstein, Guarding against supply chain attacks—Part 2: Hardware risks, 2020--02---03, Microsoft",
                    "external_id": "REF-712",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://www.microsoft.com/security/blog/2020/02/03/guarding-against-supply-chain-attacks-part-2-hardware-risks/"
                },
                {
                    "description": "Jordan Robertson, Michael Riley, The Big Hack: How China Used a Tiny Chip to Infiltrate U.S. Companies, 2018--10---04, Bloomberg",
                    "external_id": "REF-713",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://www.bloomberg.com/news/features/2018-10-04/the-big-hack-how-china-used-a-tiny-chip-to-infiltrate-america-s-top-companies"
                }
            ],
            "id": "attack-pattern--a2328e82-460e-4de6-a459-7005de7befe4",
            "modified": "2022-09-29T00:00:00.000Z",
            "name": "Counterfeit Hardware Component Inserted During Product Assembly",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_child_of_refs": [
                "attack-pattern--efb74200-657d-438c-aaff-bbd9644dd72d"
            ],
            "x_capec_domains": [
                "Supply Chain"
            ],
            "x_capec_example_instances": [
                "\n               <xhtml:p>A manufacturer of a firewall system requires a hardware card which functions as a multi-jack ethernet card with four ethernet ports. The adversary constructs a counterfeit card that functions normally except that packets from the adversary's network are allowed to bypass firewall processing completely. Once deployed at a victim location, this allows the adversary to bypass the firewall unrestricted.</xhtml:p>\n            ",
                "\n               <xhtml:p>In 2018 it was discovered that Chinese spies infiltrated several U.S. government agencies and corporations as far back as 2015 by including a malicious microchip within the motherboard of servers sold by Elemental Technologies to the victims. Although these servers were assembled via a U.S. based company, the motherboards used within the servers were manufactured and maliciously altered via a Chinese subcontractor. Elemental Technologies then sold these malicious servers to various U.S. government agencies, such as the DoD and CIA, and corporations like Amazon and Apple. The malicious microchip provided adversaries with a backdoor into the system, which further allowed them to access any network that contained the exploited systems, to exfiltrate data to be sent to the Chinese government.[REF-713]</xhtml:p>\n            "
            ],
            "x_capec_likelihood_of_attack": "Low",
            "x_capec_prerequisites": [
                "The adversary will need either physical access or be able to supply malicious hardware components to the product development facility."
            ],
            "x_capec_skills_required": {
                "High": "Resources to physically infiltrate manufacturer or manufacturer's supplier."
            },
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}