{
    "id": "bundle--2572971e-1c5c-45b4-93ef-169fea865cfe",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An attacker analyzes data returned by an RFID chip and uses this information to duplicate a RFID signal that responds identically to the target chip. In some cases RFID chips are used for building access control, employee identification, or as markers on products being delivered along a supply chain. Some organizations also embed RFID tags inside computer assets to trigger alarms if they are removed from particular rooms, zones, or buildings. Similar to Magnetic strip cards, RFID cards are susceptible to duplication (cloning) and reuse.",
            "external_references": [
                {
                    "external_id": "CAPEC-399",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/399.html"
                },
                {
                    "description": "Stuart McClure, Joel Scambray, George Kurtz, Hacking Exposed: Network Security Secrets & Solutions (6th Edition), 2009, McGraw Hill",
                    "external_id": "REF-33",
                    "source_name": "reference_from_CAPEC"
                }
            ],
            "id": "attack-pattern--ca237733-be3e-4d9c-85a0-d18cb1c8295d",
            "modified": "2022-02-22T00:00:00.000Z",
            "name": "Cloning RFID Cards or Chips",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_child_of_refs": [
                "attack-pattern--5e808864-44b1-478c-8cb0-75c55cd51e2b"
            ],
            "x_capec_domains": [
                "Physical Security"
            ],
            "x_capec_extended_description": "\n            <xhtml:p>RFID (Radio Frequency Identification) are passive devices which consist of an integrated circuit for processing RF signals and an antenna. RFID devices are passive in that they lack an on on-board power source. The majority of RFID chips operate on either the 13.56 MHz or 135 KHz frequency. The chip is powered when a signal is received by the antenna on the chip, powering the chip long enough to send a reply message. An attacker is able to capture and analyze RFID data by either stimulating the chip to respond or being proximate to the chip when it sends a response to a remote transmitter. This allows the attacker to duplicate the signal and conduct attacks such as gaining unauthorized access to a building or impersonating a user's identification.</xhtml:p>\n         ",
            "x_capec_status": "Draft",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}