{
    "id": "bundle--5a0f9604-6f1b-456c-bb6a-88a807ff0da6",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "\n            <xhtml:p>An adversary conducts supply chain attacks by the inclusion of insecure third-party components into a technology, product, or code-base, possibly packaging a malicious driver or component along with the product before shipping it to the consumer or acquirer.</xhtml:p>\n         ",
            "external_references": [
                {
                    "external_id": "CAPEC-446",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/446.html"
                },
                {
                    "description": "Supply Chain Compromise",
                    "external_id": "T1195",
                    "source_name": "ATTACK",
                    "url": "https://attack.mitre.org/wiki/Technique/T1195"
                },
                {
                    "description": "Jon Boyens, Angela Smith, Nadya Bartol, Kris Winkler, Alex Holbrook, Matthew Fallon, Cybersecurity Supply Chain Risk Management Practices for Systems and Organizations (2nd Draft), 2021--10---28, National Institute of Standards and Technology (NIST)",
                    "external_id": "REF-379",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.800-161r1-draft2.pdf"
                },
                {
                    "description": "Thomas Brewster, How Lenovo's Superfish 'Malware' Works And What You Can Do To Kill It, 2015--02---19, Forbes",
                    "external_id": "REF-707",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://www.forbes.com/sites/thomasbrewster/2015/02/19/superfish-need-to-know/?sh=991ab8c38776"
                },
                {
                    "description": "Dan Goodin, Lenovo PCs ship with man-in-the-middle adware that breaks HTTPS connections, 2015--02---19, Ars Technica",
                    "external_id": "REF-708",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://arstechnica.com/information-technology/2015/02/lenovo-pcs-ship-with-man-in-the-middle-adware-that-breaks-https-connections/"
                },
                {
                    "description": "Rob Graham, Extracting the SuperFish certificate, 2015--02---19, Errata Security",
                    "external_id": "REF-709",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://blog.erratasec.com/2015/02/extracting-superfish-certificate.html#.VOX5Ky57RqE"
                },
                {
                    "description": "Jordan Robertson, Michael Riley, The Big Hack: How China Used a Tiny Chip to Infiltrate U.S. Companies, 2018--10---04, Bloomberg",
                    "external_id": "REF-713",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://www.bloomberg.com/news/features/2018-10-04/the-big-hack-how-china-used-a-tiny-chip-to-infiltrate-america-s-top-companies"
                }
            ],
            "id": "attack-pattern--374de530-29f4-4e14-905f-809f8cae631d",
            "modified": "2022-09-29T00:00:00.000Z",
            "name": "Malicious Logic Insertion into Product via Inclusion of Third-Party Component",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_child_of_refs": [
                "attack-pattern--efb74200-657d-438c-aaff-bbd9644dd72d"
            ],
            "x_capec_consequences": {
                "Authorization": [
                    "Execute Unauthorized Commands"
                ]
            },
            "x_capec_domains": [
                "Supply Chain",
                "Software",
                "Hardware"
            ],
            "x_capec_example_instances": [
                "\n               <xhtml:p>From mid-2014 to early 2015, Lenovo computers were shipped with the Superfish Visual Search software that ultimately functioned as adware on the system. The Visual Search installation included a self-signed root HTTPS certificate that was able to intercept encrypted traffic for any site visited by the user. Of more concern was the fact that the certificate's corresponding private key was the same for every Lenovo machine. Once the private key was discovered [REF-709], an adversary could then conduct an Adversary-in-the-Middle (AitM) attack that would go undetected by machines that had this certificate installed on it. Adversaries could then masquerade as legitimate entities such as financial institutions, popular corporations, or other secure destinations on the Internet. [REF-708]</xhtml:p>\n            ",
                "\n               <xhtml:p>In 2018 it was discovered that Chinese spies infiltrated several U.S. government agencies and corporations as far back as 2015 by including a malicious microchip within the motherboard of servers sold by Elemental Technologies to the victims. Although these servers were assembled via a U.S. based company, the motherboards used within the servers were manufactured and maliciously altered via a Chinese subcontractor. Elemental Technologies then sold these malicious servers to various U.S. government agencies, such as the DoD and CIA, and corporations like Amazon and Apple. The malicious microchip provided adversaries with a backdoor into the system, which further allowed them to access any network that contained the exploited systems, to exfiltrate data to be sent to the Chinese government.[REF-713]</xhtml:p>\n            "
            ],
            "x_capec_extended_description": "\n            <xhtml:p>The result is a window of opportunity for exploiting the product until the insecure component is discovered. This supply chain threat can result in the installation of malicious software or hardware that introduces widespread security vulnerabilities within an organization. Additionally, because software often depends upon a large number of interdependent libraries and components to be present, security holes can be introduced merely by installing Commercial off the Shelf (COTS) or Open Source Software (OSS) software that comes pre-packaged with the components required for it to operate. It is also worth noting that this attack can occur during initial product development or throughout a product's sustainment.</xhtml:p>\n         ",
            "x_capec_likelihood_of_attack": "Medium",
            "x_capec_prerequisites": [
                "Access to the product during the initial or continuous development. This access is often obtained via insider access to include the third-party component after deployment."
            ],
            "x_capec_status": "Stable",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}