{
    "id": "bundle--67a68e63-2754-4502-986d-a1cc3a35453e",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "The attacker loads and executes an arbitrary local PHP file on a target machine. The attacker could use this to try to load old versions of PHP files that have known vulnerabilities, to load PHP files that the attacker placed on the local machine during a prior attack, or to otherwise change the functionality of the targeted application in unexpected ways.",
            "external_references": [
                {
                    "external_id": "CAPEC-252",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/252.html"
                },
                {
                    "external_id": "CWE-829",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/829.html"
                },
                {
                    "description": "OWASP Vulnerabilities, The Open Web Application Security Project (OWASP)",
                    "external_id": "REF-621",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://owasp.org/www-community/vulnerabilities/PHP_File_Inclusion"
                }
            ],
            "id": "attack-pattern--d56469be-4ebc-4443-b85a-3097193df4c4",
            "modified": "2021-10-21T00:00:00.000Z",
            "name": "PHP Local File Inclusion",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_child_of_refs": [
                "attack-pattern--283d665d-e109-4d5d-8993-6fb25e5923d6"
            ],
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Survey application: </b>Using a browser or an automated tool, an adversary follows all public links on a web site. They record all the links they find. The adversary is looking for URLs that show PHP file inclusion is used, which can look something like \"http://vulnerable-website/file.php?file=index.php\".</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Use a spidering tool to follow and record all links. Make special note of any links that include parameters in the URL.</td></tr><tr><td>Use a proxy tool to record all links visited during a manual traversal of the web application. Make special note of any links that include parameters in the URL. Manual traversal of this type is frequently necessary to identify forms that are GET method forms rather than POST forms.</td></tr><tr><td>Use a browser to manually explore the website and analyze how it is constructed. Many browser's plugins are available to facilitate the analysis or automate the URL discovery.</td></tr></tbody></table></ol></div><div><h3>Experiment</h3><ol><li> <p> <b>Attempt variations on input parameters: </b>Once the adversary finds a vulnerable URL that takes file input, they attempt a variety of path traversal techniques to attempt to get the application to display the contents of a local file, or execute a different PHP file already stored locally on the server.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Use a list of probe strings to inject in parameters of known URLs. The probe strings are variants of path traversal techniques used to include well known files.</td></tr><tr><td>Use a proxy tool to record results of manual input of local file inclusion probes in known URLs.</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Include desired local file: </b>Once the adversary has determined which techniques of path traversal successfully work with the vulnerable PHP application, they will target a specific local file to include. These can be files such as \"/etc/passwd\", \"/etc/shadow\", or configuration files for the application that might expose sensitive information.</p></li></ol></div>",
            "x_capec_prerequisites": [
                "The targeted PHP application must have a bug that allows an attacker to control which code file is loaded at some juncture."
            ],
            "x_capec_resources_required": [
                "The attacker needs to have enough access to the target application to control the identity of a locally included PHP file."
            ],
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Medium",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}