{
    "id": "bundle--2706d090-ab72-4449-b92f-ad27f7c1f14e",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary takes advantage of weaknesses in the protocol by which a client and server are communicating to perform unexpected actions. Communication protocols are necessary to transfer messages between client and server applications. Moreover, different protocols may be used for different types of interactions.",
            "external_references": [
                {
                    "external_id": "CAPEC-220",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/220.html"
                },
                {
                    "external_id": "CWE-757",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/757.html"
                }
            ],
            "id": "attack-pattern--9c983530-1927-43ca-addd-63d149cda4a7",
            "modified": "2022-02-22T00:00:00.000Z",
            "name": "Client-Server Protocol Manipulation",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Standard",
            "x_capec_child_of_refs": [
                "attack-pattern--2166d3c5-baec-4f42-8284-c1b5b649ad34"
            ],
            "x_capec_domains": [
                "Communications",
                "Software"
            ],
            "x_capec_extended_description": "\n            <xhtml:p>For example, an authentication protocol might be used to establish the identities of the server and client while a separate messaging protocol might be used to exchange data. If there is a weakness in a protocol used by the client and server, an attacker might take advantage of this to perform various types of attacks. For example, if the attacker is able to manipulate an authentication protocol, the attacker may be able spoof other clients or servers. If the attacker is able to manipulate a messaging protocol, the may be able to read sensitive information or modify message contents. This attack is often made easier by the fact that many clients and servers support multiple protocols to perform similar roles. For example, a server might support several different authentication protocols in order to support a wide range of clients, including legacy clients. Some of the older protocols may have vulnerabilities that allow an attacker to manipulate client-server interactions.</xhtml:p>\n         ",
            "x_capec_parent_of_refs": [
                "attack-pattern--b89511b6-f0fb-4c1d-a884-a0d5a0d82b4e",
                "attack-pattern--ae3f2c33-9018-442e-9cc3-24d65c7f4974",
                "attack-pattern--13d1d169-0023-41e2-952f-7d794844733b",
                "attack-pattern--d845a25b-b140-438c-91d7-30b709bb6e18",
                "attack-pattern--ba694895-a0cf-494e-ace2-bf3488330b80",
                "attack-pattern--7b462c1f-e0bf-41a7-b811-2b676c103bda"
            ],
            "x_capec_prerequisites": [
                "The client and/or server must utilize a protocol that has a weakness allowing manipulation of the interaction."
            ],
            "x_capec_resources_required": [
                "The adversary must be able to identify the weakness in the utilized protocol and exploit it. This may require a sniffing tool as well as packet creation abilities. The adversary will be aided if they can force the client and/or server to utilize a specific protocol known to contain exploitable weaknesses."
            ],
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Medium",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}