{
    "id": "bundle--cffc0bf8-c0a4-4cd1-b9ee-11105a7ae7a3",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An attacker is able to discover and query Micro-services at a web location and thereby expose the Micro-services to further exploitation by gathering information about their implementation and function. Micro-services in web pages allow portions of a page to connect to the server and update content without needing to cause the entire page to update. This allows user activity to change portions of the page more quickly without causing disruptions elsewhere.",
            "external_references": [
                {
                    "external_id": "CAPEC-179",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/179.html"
                }
            ],
            "id": "attack-pattern--177d22be-7b76-4726-8085-61756f95c0ce",
            "modified": "2022-02-22T00:00:00.000Z",
            "name": "Calling Micro-Services Directly",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Standard",
            "x_capec_child_of_refs": [
                "attack-pattern--ec382da0-af49-489b-bca1-a555d48b7ce3"
            ],
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_extended_description": "\n            <xhtml:p>However, these micro-services may not be subject to the same level of security review as other forms of content. For example, a micro-service that posts requests to a server that are turned into SQL queries may not adequately protect against SQL-injection attacks. As a result, micro-services may provide another vector for a range of attacks. It should be emphasized that the presence of micro-services does not necessarily make a site vulnerable to attack, but they do provide additional complexity to a web page and therefore may contain vulnerabilities that support other attack patterns.</xhtml:p>\n         ",
            "x_capec_prerequisites": [
                "The target site must use micro-services that interact with the server and one or more of these micro-services must be vulnerable to some other attack pattern."
            ],
            "x_capec_resources_required": [
                "The attacker usually needs to be able to invoke micro-services directly in order to control the parameters that are used in their attack. The attacker may require other resources depending on the nature of the flaw in the targeted micro-service."
            ],
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Medium",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}