{
    "id": "bundle--e85d6d68-f5d9-459e-98d2-a3584c34cfed",
    "objects": [
        {
            "created": "2020-12-17T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary targets users with a phishing attack for the purpose of soliciting account passwords or sensitive information from the user. Voice Phishing is a variation of the Phishing social engineering technique where the attack is initiated via a voice call, rather than email. The user is enticed to provide sensitive information by the adversary, who masquerades as a legitimate employee of the alleged organization. Voice Phishing attacks deviate from standard Phishing attacks, in that a user doesn't typically interact with a compromised website to provide sensitive information and instead provides this information verbally. Voice Phishing attacks can also be initiated by either the adversary in the form of a \"cold call\" or by the victim if calling an illegitimate telephone number.",
            "external_references": [
                {
                    "external_id": "CAPEC-656",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/656.html"
                },
                {
                    "description": "Jovi Umawing, Something else is phishy: How to detect phishing attempts on mobile phones , 2018--12---10, Malwarebytes",
                    "external_id": "REF-592",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://blog.malwarebytes.com/101/2018/12/something-else-phishy-detect-phishing-attempts-mobile/"
                },
                {
                    "description": "Jennifer van der Kleut, What is vishing? Tips for spotting and avoiding voice scams, NortonLifeLock Inc.",
                    "external_id": "REF-594",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://ieeexplore.ieee.org/document/6604058/authors#authors"
                },
                {
                    "description": "What Is Vishing?, AO Kaspersky Lab",
                    "external_id": "REF-595",
                    "source_name": "reference_from_CAPEC",
                    "url": "https://www.kaspersky.com/resource-center/definitions/vishing"
                }
            ],
            "id": "attack-pattern--ec0a802f-1d0a-4360-a4d8-3fb9f48715d0",
            "modified": "2020-12-17T00:00:00.000Z",
            "name": "Voice Phishing",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Detailed",
            "x_capec_alternate_terms": [
                "Vishing",
                "VoIP Phishing"
            ],
            "x_capec_child_of_refs": [
                "attack-pattern--a00c2cc2-bd4f-4594-9ec1-b021b62ac896"
            ],
            "x_capec_consequences": {
                "Access_Control": [
                    "Gain Privileges"
                ],
                "Authorization": [
                    "Gain Privileges"
                ],
                "Confidentiality": [
                    "Gain Privileges",
                    "Read Data"
                ],
                "Integrity": [
                    "Modify Data"
                ]
            },
            "x_capec_domains": [
                "Social Engineering"
            ],
            "x_capec_example_instances": [
                "The target receives an email or text message stating that their Apple ID has been disabled due to suspicious activity and that the included link includes instructions on how to unlock their Apple account. The link in the text message looks legitimate and once the link is clicked, the user is redirected to a legitimate-looking webpage that prompts the user to call a specified number to initiate the unlock process. The target initiates the phone call and provides their credentials or other sensitive information to the individual they assume works for Apple. Now that the adversary possess this data, it can be used to log into the account to obtain other sensitive data, such as Apple Pay information.",
                "An adversary calls the target and claims to work for their bank. The adversary informs the target that their bank account has been frozen, due to potential fraudulent spending, and requires authentication in order to re-enable the account. The target, believing the caller is a legitimate bank employee, provides their bank account login credentials to confirm they are the authorized owner of the account. The adversary then confirms this authentication and claims that the account has been unlocked. Once the adversary has obtained these credentials, money can be transferred from the victim's account to an account controlled by the adversary."
            ],
            "x_capec_execution_flow": "<h2> Execution Flow </h2><div><h3>Explore</h3><ol><li> <p> <b>Obtain domain name and certificate to spoof legitimate site: </b>This optional step can be used to help the adversary impersonate the legitimate organization more convincingly. The adversary can use homograph or similar attacks to convince users that they are using the legitimate website. If the adversary leverages cold-calling for this attack, this step is skipped.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Optionally obtain a domain name that visually looks similar to the legitimate organization's domain name. An example is www.paypaI.com vs. www.paypal.com (the first one contains a capital i, instead of a lower case L)</td></tr><tr><td>Optionally obtain a legitimate SSL certificate for the new domain name.</td></tr></tbody></table><li> <p> <b>Explore legitimate website and create duplicate: </b>An adversary optionally creates a website (optionally at a URL that looks similar to the original URL) that closely resembles the organization's website that they are trying to impersonate. That website will contain a telephone number for the victim to call to assist them with their issue and initiate the attack. If the adversary leverages cold-calling for this attack, this step is skipped.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Use spidering software to get copy of web pages on legitimate site.</td></tr><tr><td>Manually save copies of required web pages from legitimate site.</td></tr><tr><td>Create new web pages that have the legitimate site's look and feel, but contain completely new content.</td></tr></tbody></table></ol></div><div><h3>Exploit</h3><ol><li> <p> <b>Convince user to provide sensitive information to the adversary.: </b>An adversary \"cold calls\" the victim or receives a call from the victim via the malicious site and provides a call-to-action, in order to persuade the user into providing sensitive details to the adversary (e.g. login credentials, bank account information, etc.). The key is to get the victim to believe that the individual they are talking to is from a legitimate entity with which the victim does business and that the call is occurring for legitimate reasons. A call-to-action will usually need to sound legitimate and urgent enough to prompt action from the user.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Call the user a from a spoofed legitimate-looking telephone number.</td></tr></tbody></table><li> <p> <b>Use stolen information: </b>Once the adversary obtains the sensitive information, this information can be leveraged to log into the victim's bank account and transfer money to an account of their choice, or to make fraudulent purchases with stolen credit card information.</p></li><table><tbody><tr><th>Techniques</th></tr><tr><td>Login to the legitimate site using another the victim's supplied credentials</td></tr></tbody></table></ol></div>",
            "x_capec_likelihood_of_attack": "High",
            "x_capec_prerequisites": [
                "An adversary needs phone numbers to initiate contact with the victim, in addition to a legitimate-looking telephone number to call the victim from.",
                "An adversary needs to correctly guess the entity with which the victim does business and impersonate it. Most of the time phishers just use the most popular banks/services and send out their \"hooks\" to many potential victims.",
                "An adversary needs to have a sufficiently compelling call to action to prompt the user to take action.",
                "If passively conducting this attack via a spoofed website, replicated website needs to look extremely similar to the original website and the URL used to get to that website needs to look like the real URL of the said business entity."
            ],
            "x_capec_resources_required": [
                "Legitimate-looking telephone number(s) to initiate calls with victims"
            ],
            "x_capec_skills_required": {
                "Medium": "Basic knowledge about websites: obtaining them, designing and implementing them, etc."
            },
            "x_capec_status": "Stable",
            "x_capec_typical_severity": "High",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}