{
    "id": "bundle--a67ad2c8-8882-418f-a243-45afb651aabc",
    "objects": [
        {
            "created": "2014-06-23T00:00:00.000Z",
            "created_by_ref": "identity--e50ab59c-5c4f-4d40-bf6a-d58418d89bcd",
            "description": "An adversary supplies a value to the target application which is then used by reflection methods to identify a class, method, or field. For example, in the Java programming language the reflection libraries permit an application to inspect, load, and invoke classes and their components by name. If an adversary can control the input into these methods including the name of the class/method/field or the parameters passed to methods, they can cause the targeted application to invoke incorrect methods, read random fields, or even to load and utilize malicious classes that the adversary created. This can lead to the application revealing sensitive information, returning incorrect results, or even having the adversary take control of the targeted application.",
            "external_references": [
                {
                    "external_id": "CAPEC-138",
                    "source_name": "capec",
                    "url": "https://capec.mitre.org/data/definitions/138.html"
                },
                {
                    "external_id": "CWE-470",
                    "source_name": "cwe",
                    "url": "http://cwe.mitre.org/data/definitions/470.html"
                }
            ],
            "id": "attack-pattern--e3a32913-a4a6-4a3c-8f3b-a8a6dc16df53",
            "modified": "2023-01-24T00:00:00.000Z",
            "name": "Reflection Injection",
            "object_marking_refs": [
                "marking-definition--17d82bb2-eeeb-4898-bda5-3ddbcd2b799d"
            ],
            "spec_version": "2.1",
            "type": "attack-pattern",
            "x_capec_abstraction": "Standard",
            "x_capec_child_of_refs": [
                "attack-pattern--cde07b71-23e6-418d-93e9-665f5f83b032"
            ],
            "x_capec_domains": [
                "Software"
            ],
            "x_capec_prerequisites": [
                "The target application must utilize reflection libraries and allow users to directly control the parameters to these methods. If the adversary can host classes where the target can invoke them, more powerful variants of this attack are possible.",
                "The target application must accept a string as user input, fail to sanitize characters that have a special meaning in the parameter encoding, and insert the user-supplied string in an encoding which is then processed."
            ],
            "x_capec_resources_required": [
                "None: No specialized resources are required to execute this type of attack."
            ],
            "x_capec_status": "Draft",
            "x_capec_typical_severity": "Very High",
            "x_capec_version": "3.9"
        }
    ],
    "type": "bundle"
}