{
    "type": "bundle",
    "id": "bundle--96376143-eabd-4945-8f46-68be8d83dad5",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "x-mitre-asset",
            "id": "x-mitre-asset--bb141168-ae41-4974-8ece-dc9b63e59237",
            "created": "2025-09-24T18:17:26.575Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "external_references": [
                {
                    "source_name": "mitre-attack",
                    "url": "https://attack.mitre.org/assets/A0016",
                    "external_id": "A0016"
                }
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "modified": "2025-10-21T19:34:14.912Z",
            "name": "Firewall",
            "description": "A gateway that limits access between networks in accordance with local security policy.\n\nIn ICS networks, firewalls can exist in multiple locations in the network architecture and  serve a variety of purposes. The first, and often the most important, is the firewall segmenting the ICS network from the business network. This firewall acts as the primary network boundary point that controls the ingress/egress of network traffic between the ICS and business networks. This firewall may also be a single device connected to multiple network segments, where the firewall defines individual zones for the different network segments and can control access to the zones and between the zones. This can limit the ability of an adversary to traverse a network.\n",
            "x_mitre_sectors": [
                "General"
            ],
            "x_mitre_related_assets": [
                {
                    "name": "Boundary Firewall",
                    "related_asset_sectors": [
                        "General"
                    ],
                    "description": "A boundary firewall is used to control the flow of traffic between two different networks. It is typically used to delineate the different levels of the Purdue Model. "
                },
                {
                    "name": "Device Firewall",
                    "related_asset_sectors": [],
                    "description": "A device firewall is used to control the flow of traffic between a network and an individual device. It is used when additional protections are required beyond that of a boundary firewall. For example, a boundary firewall may limit traffic on the network to two protocols, but, a device firewall may further limit traffic to a particular device on that network to a single protocol."
                }
            ],
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_platforms": [
                "Network",
                "Embedded",
                "Windows",
                "Linux"
            ],
            "x_mitre_deprecated": false,
            "x_mitre_domains": [
                "ics-attack"
            ],
            "x_mitre_version": "1.0",
            "x_mitre_attack_spec_version": "3.3.0"
        }
    ]
}