{
    "type": "bundle",
    "id": "bundle--1f8a9750-94b2-4d86-b92f-2dc6105cb1a5",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "relationship",
            "id": "relationship--a0e54774-50e2-4626-a826-5e692ef00a63",
            "created": "2023-08-11T21:06:07.628Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "modified": "2025-04-16T22:36:12.905Z",
            "description": "Monitor network data for uncommon data flows. Processes utilizing the network that do not normally have network communication or have never been seen before are suspicious. Network Analysis frameworks such as Zeek can be used to capture, decode, and alert on network protocols such as SMB that revolve around network shares. Although there may be more native ways to detect detailed SMB events on the host, they can be extracted out of network traffic. With the right protocol decoders, port 445 traffic can be filtered and even the file path (relative to the share) can be retrieved.\n\nLooking at this activity more closely to obtain an adequate sense of situational awareness may make it possible to detect adversaries moving between hosts in a way that deviates from normal activity. Because SMB traffic is heavy in many environments, this analytic may be difficult to turn into something that can be used to quickly detect an APT. In some cases, it may make more sense to run this analytic in a forensic fashion. Looking through and filtering its output after an intrusion has been discovered may be helpful in identifying the scope of compromise.\n",
            "relationship_type": "detects",
            "source_ref": "x-mitre-data-component--a7f22107-02e5-4982-9067-6625d4a1765a",
            "target_ref": "attack-pattern--ae676644-d2d2-41b7-af7e-9bed1b55898c",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_deprecated": false,
            "x_mitre_attack_spec_version": "3.2.0"
        }
    ]
}