{
    "type": "bundle",
    "id": "bundle--d9f21f50-0f83-4d55-92d2-9a43c75cc370",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "relationship",
            "id": "relationship--a7add7de-11f5-44df-b9c3-3cd431b970be",
            "created": "2022-03-30T14:26:51.867Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "modified": "2025-04-16T22:37:58.638Z",
            "description": "Monitor for newly constructed network connections (typically over ports 139 or 445), especially those that are sent or received by abnormal or untrusted hosts. Correlate these network connections with remote login events and associated SMB-related activity such as file transfers and remote process execution.\n\nNote: Event ID is for Zeek but can also be implemented in other Network Analysis Frameworks by parsing & decoding captured SMB2 network traffic. Preference would be to detect smb2_write_response event (instead of smb2_write_request), because it would confirm the file was actually written to the remote destination. Unfortunately, Bro/Zeek does not have an event for that SMB message-type yet. From a network traffic capture standpoint, it’s important to capture the right traffic for this type of detection to function (e.g., all endpoint to endpoint if possible or workstation to server and workstation to workstation). As such, it is helpful to have a centralized server area where it is possible to monitor communications between servers and endpoints.\n\nAnalytic 1 and 2 are very similar, with the key difference being that Implementation 2 is intended to capture multiple attempts at lateral movement originating from the same host within a short time period (5 minutes).\n\n- smb2_write_request, smb1_write_andx_response is indication of an SMB file write to a Windows Admin File Share: ADMIN$ or C$\n\n- smb2_tree_connect_request, smb1_tree_connect_andx_request is observed originating from the same host, regardless of write-attempts and regardless of whether or not any connection is successful —just connection attempts— within a specified period of time (REPEATS 5 TIMES WITHIN 5 MINUTES FROM SAME src_ip).\n\nFrom a network traffic capture standpoint, it’s important to capture the right traffic for this type of detection to function (e.g., all endpoint to endpoint if possible or workstation to server and workstation to workstation). As such, it is helpful to have a centralized server area where it is possible to monitor communications between servers and endpoints.The Service Control Manager (SCM) can be used to copy a file to the ADMIN$ share and execute it as a service. This can be detected by looking for incoming RPC network connections to the Service Control Manager, followed by services.exe spawning a child process.\n\nAnalytic 1 - Basic\n\n<code>sourcetype=\"Zeek:SMB_Files\" EventCode IN (\"smb2_write_request\", \"smb1_write_andx_response\", \"smb2_tree_connect_request\", \"smb1_tree_connect_andx_request\") AND (Path=\"ADMIN$\" OR Path=\"C$\")</code>\n\nAnalytic 2 - Port 445 Monitoring \n\n<code> sourcetype=\"network_connection\"\n| search dest_port=445\n| stats count by src_ip, dest_ip, dest_port, _time\n| eval smb_activity=if(count > threshold AND src_ip NOT IN (\"trusted_sources\"), \"suspicious\", \"normal\")\n| where smb_activity=\"suspicious\"\n| table _time, src_ip, dest_ip, dest_port, smb_activity</code>",
            "relationship_type": "detects",
            "source_ref": "x-mitre-data-component--181a9f8c-c780-4f1f-91a8-edb770e904ba",
            "target_ref": "attack-pattern--4f9ca633-15c5-463c-9724-bdcd54fde541",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_deprecated": false,
            "x_mitre_attack_spec_version": "3.2.0"
        }
    ]
}