{
    "type": "bundle",
    "id": "bundle--4d812108-151f-46e4-b288-150174ebc385",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "relationship",
            "id": "relationship--659dc38a-76ca-419d-9317-d55ba9de5f73",
            "created": "2022-03-30T14:26:51.867Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "modified": "2025-04-16T22:20:07.852Z",
            "description": "Monitor network data for uncommon SMB data flows. Processes utilizing the network that do not normally have network communication or have never been seen before are suspicious. Network Analysis frameworks such as Zeek can be used to capture, decode, and alert on SMB network flows.\n\nNotes:\n\n- The logic for Implementation 1 is based around detecting on SMB write requests, which are often used by adversaries to move laterally to another host. Unlike SMB Reads, SMB Write requests typically require an additional level of access, resulting in less activity. Focusing on SMB Write activity narrows the field to looking at techniques associated with actively changing remote hosts, instead of passively reading files.\n- The logic for Implementation 2 is based around detection of new processes that were created from a file written to an SMB share.  First, a file is remotely written to a host via an SMB share; then, a variety of Execution techniques can be used to remotely establish execution of the file or script. To detect this behavior, look for files that are written to a host over SMB and then later run directly as a process or in the command line arguments. SMB File Writes and Remote Execution may happen normally in an environment, but the combination of the two behaviors is less frequent and more likely to indicate adversarial activity.\n\nAnalytic 1 - SMB Write\n\n<code>sourcetype=\"Zeek:SMB_Files\" port=\"445\" AND protocol=\"smb.write\"</code>",
            "relationship_type": "detects",
            "source_ref": "x-mitre-data-component--a7f22107-02e5-4982-9067-6625d4a1765a",
            "target_ref": "attack-pattern--4f9ca633-15c5-463c-9724-bdcd54fde541",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_deprecated": false,
            "x_mitre_attack_spec_version": "3.2.0"
        }
    ]
}