{
    "type": "bundle",
    "id": "bundle--388f1275-217e-4f97-8a74-dc40e6d18bae",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "relationship",
            "id": "relationship--5a5abca2-6e7c-4714-a7e0-88d05885bb57",
            "created": "2022-03-30T14:26:51.865Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "modified": "2025-04-16T22:17:14.749Z",
            "description": "Monitor for user accounts logged into systems associated with RDP (ex: Windows EID 4624 Logon Type 10). Other factors, such as access patterns (ex: multiple systems over a relatively short period of time) and activity that occurs after a remote login, may indicate suspicious or malicious behavior with RDP.\n\nMonitoring logon and logoff events for hosts on the network is very important for situational awareness. This information can be used as an indicator of unusual activity as well as to corroborate activity seen elsewhere.\n\nCould be applied to a number of different types of monitoring depending on what information is desired. Some use cases include monitoring for all remote connections and building login timelines for users. Logon events are Windows Event Code 4624 for Windows Vista and above, 518 for pre-Vista. Logoff events are 4634 for Windows Vista and above, 538 for pre-Vista.\n\nNote: This analytic looks for user logon events and filters out the top 30 account names to reduce the occurrence of noisy service accounts and the like. It is meant as a starting point for situational awareness around such events. This is liable to be quite noisy and will need tweaking, especially in terms of the number of top users filtered out.\n\nAnalytic 1\n\n<code>sourcetype=\"WinEventLog:Security\" EventCode IN (4624, 4634, 4647, 4778, 4779)\n| search LogonType=10 // RDP Interactive Logon\n| eval is_suspicious=if((user!=\"expected_users\") AND (dest_ip!=\"expected_servers\"), \"True\", \"False\")\n| where is_suspicious=\"True\"</code>",
            "relationship_type": "detects",
            "source_ref": "x-mitre-data-component--9ce98c86-8d30-4043-ba54-0784d478d0b5",
            "target_ref": "attack-pattern--eb062747-2193-45de-8fa2-e62549c37ddf",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_deprecated": false,
            "x_mitre_attack_spec_version": "3.2.0"
        }
    ]
}