{
    "type": "bundle",
    "id": "bundle--14750163-99ec-43d9-ba56-0e88ee47665d",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "relationship",
            "id": "relationship--38f5e690-1ed8-45a8-a6cc-9dfe8e953706",
            "created": "2022-03-30T14:26:51.871Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "modified": "2025-04-16T22:08:05.248Z",
            "description": "Administrators should set up monitoring to trigger automatic alerts when policy criteria are met. For example, using a Cloud Access Security Broker (CASB), admins can create a “High severity app permissions” policy that generates alerts if apps request high severity permissions or send permissions requests for too many users.\n\nSecurity analysts can hunt for malicious apps using the tools available in their CASB, identity provider, or resource provider (depending on platform.) For example, they can filter for apps that are authorized by a small number of users, apps requesting high risk permissions, permissions incongruous with the app’s purpose, or apps with old “Last authorized” fields. A specific app can be investigated using an activity log displaying activities the app has performed, although some activities may be mis-logged as being performed by the user. App stores can be useful resources to further investigate suspicious apps.\n\nAdministrators can set up a variety of logs and leverage audit tools to monitor actions that can be conducted as a result of OAuth 2.0 access. For instance, audit reports enable admins to identify privilege escalation actions such as role creations or policy modifications, which could be actions performed after initial access.\n\nAnalytic 1 - Unauthorized app permissions or unusual activity patterns in app logs.\n\n<code>(index=security sourcetype=\"WinEventLog:Security\" EventCode=4720 OR EventCode=4722 OR EventCode=4738) OR\n(index=azuread sourcetype=\"azure:activity\" operationName IN (\"Add member to role\", \"Update user\", \"Update group\")) OR\n(index=gsuite sourcetype=\"gsuite:admin\" event_type IN (\"UPDATE_USER\", \"ADD_USER_TO_GROUP\")) OR\n(index=o365 sourcetype=\"o365:management:activity\" operation IN (\"Add member to role\", \"Update user\", \"Update group\")) </code>",
            "relationship_type": "detects",
            "source_ref": "x-mitre-data-component--d27b0089-2c39-4b6c-84ff-303e48657e77",
            "target_ref": "attack-pattern--890c9858-598c-401d-a4d5-c67ebcdd703a",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_deprecated": false,
            "x_mitre_attack_spec_version": "3.2.0"
        }
    ]
}