{
    "type": "bundle",
    "id": "bundle--67755830-9f5d-4a2f-90ec-78525786dd5a",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "relationship",
            "id": "relationship--ffa83fe4-ca25-47b7-9d26-cefed3e32e7f",
            "created": "2022-03-30T14:26:51.876Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "modified": "2025-04-16T23:00:44.442Z",
            "description": "Consider enabling file/directory permission change auditing on folders containing key binary/configuration files. For example, Windows Security Log events (Event ID 4670) are created when DACLs are modified.\n\nAdversaries sometimes modify object access rights at the operating system level. There are varying motivations behind this action - they may not want some files/objects to be changed on systems for persistence reasons and therefore provide admin only rights; also, they may want files to be accessible with lower levels of permissions.\n\nWindows environment logs can be noisy, so we take the following into consideration:\n\n- We need to exclude events generated by the local system (subject security ID “NT AUTHORITY\\SYSTEM”) and focus on actual user events.\n- When a permission modification is made for a folder, a new event log is generated for each subfolder and file under that folder. It is advised to group logs based on handle ID or user ID.\n- The Windows security log (event ID 4670) also includes information about the process that modifies the file permissions. It is advised to focus on uncommon process names, and it is also uncommon for real-users to perform this task without a GUI.\n- Pseudocode Event ID is for Windows Security Log (Event ID 4670 - Permissions on an object were changed). \n- Windows Event ID 4719 (An Attempt Was Made to Access An Object) can also be used to alert on changes to Active Directory audit policy for a system.\n\nAnalytic 1 - Access Permission Modification for Windows\n\n<code> (source=\"*WinEventLog:Security\" EventCode IN (4670, 4719)) Object_Type=\"File\" Security_ID!=\"NT AUTHORITY\\\\SYSTEM\" </code>",
            "relationship_type": "detects",
            "source_ref": "x-mitre-data-component--639e87f3-acb6-448a-9645-258f20da4bc5",
            "target_ref": "attack-pattern--34e793de-0274-4982-9c1a-246ed1c19dee",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_deprecated": false,
            "x_mitre_attack_spec_version": "3.2.0"
        }
    ]
}