{
    "type": "bundle",
    "id": "bundle--1b2672c4-372e-4707-bc83-b1cd717bc3e0",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "relationship",
            "id": "relationship--3bab7405-b111-4272-a12c-0b1db8dcb5f8",
            "created": "2023-08-11T21:13:52.706Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "modified": "2025-04-16T22:08:47.286Z",
            "description": "Monitor network data for uncommon data flows. Processes utilizing the network that do not normally have network communication or have never been seen before are suspicious. When AT.exe is used to remotely schedule tasks, Windows uses named pipes over SMB to communicate with the API on the remote machine. After authentication over SMB, the Named Pipe <code>ATSVC</code> is opened, over which the JobAdd function is called. On the remote host, the job files are created by the Task Scheduler and follow the convention <code>C:\\Windows\\System32\\AT<job\\_id></code>.\n\nThis pipe activity could be discovered with a network decoder, such as that in wireshark, that can inspect SMB traffic to identify the use of pipes. It could also be detected by looking for raw packet capture streams or from a custom sensor on the host that hooks the appropriate API functions. If no network or API level of visibility is possible, this traffic may inferred by looking at SMB connections over 445/tcp followed by the creation of files matching the pattern <code>C:\\Windows\\System32\\AT\\<job_id\\></code>.\n\nTo detect AT via network traffic, a sensor is needed that has the ability to extract and decode PCAP information. Specifically, it needs to properly decode SMB and the functions that are implemented over it via NamedPipes. If a sensor meets these criteria, then the PCAP data needs to search for instances of the command <code>JobAdd</code> over the pipe <code>ATSVC</code>, which is all implemented over Windows SMB 445/tcp.\n\nAnalytic 1 - Remotely Scheduled Tasks via AT\n\n<code>index=network dest_port=445 protocol=\"smb\" pipe=\"ATSVC\" command=\"JobAdd\"</code>\n",
            "relationship_type": "detects",
            "source_ref": "x-mitre-data-component--a7f22107-02e5-4982-9067-6625d4a1765a",
            "target_ref": "attack-pattern--f3d95a1f-bba2-44ce-9af7-37866cd63fd0",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_deprecated": false,
            "x_mitre_attack_spec_version": "3.2.0"
        }
    ]
}