{
    "type": "bundle",
    "id": "bundle--957a0aaa-5cea-4c58-9287-5240d8df3dd3",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "relationship",
            "id": "relationship--ade72853-1a09-417f-ad84-db50280c326c",
            "created": "2022-03-30T14:26:51.844Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "external_references": [
                {
                    "source_name": "Data Driven Security DGA",
                    "description": "Jacobs, J. (2014, October 2). Building a DGA Classifier: Part 2, Feature Engineering. Retrieved February 18, 2019.",
                    "url": "https://datadrivensecurity.info/blog/posts/2014/Oct/dga-part2/"
                },
                {
                    "source_name": "Pace University Detecting DGA May 2017",
                    "description": "Chen, L., Wang, T.. (2017, May 5). Detecting Algorithmically Generated Domains Using Data Visualization and N-Grams Methods . Retrieved April 26, 2019.",
                    "url": "http://csis.pace.edu/~ctappert/srd2017/2017PDF/d4.pdf"
                },
                {
                    "source_name": "Elastic Predicting DGA",
                    "description": "Ahuja, A., Anderson, H., Grant, D., Woodbridge, J.. (2016, November 2). Predicting Domain Generation Algorithms with Long Short-Term Memory Networks. Retrieved April 26, 2019.",
                    "url": "https://arxiv.org/pdf/1611.00791.pdf"
                }
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "modified": "2025-04-28T16:05:07.009Z",
            "description": "Detecting dynamically generated domains can be challenging due to the number of different DGA algorithms, constantly evolving malware families, and the increasing complexity of the algorithms. There is a myriad of approaches for detecting a pseudo-randomly generated domain name, including using frequency analysis, Markov chains, entropy, proportion of dictionary words, ratio of vowels to other characters, and more. (Citation: Data Driven Security DGA) CDN domains may trigger these detections due to the format of their domain names. In addition to detecting a DGA domain based on the name, another more general approach for detecting a suspicious domain is to check for recently registered names or for rarely visited domains.\nMachine learning approaches to detecting DGA domains have been developed and have seen success in applications. One approach is to use N-Gram methods to determine a randomness score for strings used in the domain name. If the randomness score is high, and the domains are not whitelisted (CDN, etc), then it may be determined if a domain is related to a legitimate host or DGA. (Citation: Pace University Detecting DGA May 2017) Another approach is to use deep learning to classify domains as DGA-generated(Citation: Elastic Predicting DGA)]",
            "relationship_type": "detects",
            "source_ref": "x-mitre-data-component--a7f22107-02e5-4982-9067-6625d4a1765a",
            "target_ref": "attack-pattern--118f61a5-eb3e-4fb6-931f-2096647f4ecd",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_deprecated": false,
            "x_mitre_attack_spec_version": "3.2.0"
        }
    ]
}