{
    "type": "bundle",
    "id": "bundle--b82ad42a-3e62-4909-bbfb-81a950afea40",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "relationship",
            "id": "relationship--83665c9e-6fea-4666-a45e-929fa0906cea",
            "created": "2023-09-18T22:33:57.489Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "external_references": [
                {
                    "source_name": "def_ev_win_event_logging",
                    "description": "Chandel, R. (2021, April 22). Defense Evasion: Windows Event Logging (T1562.002). Retrieved September 14, 2021.",
                    "url": "https://www.hackingarticles.in/defense-evasion-windows-event-logging-t1562-002/"
                }
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "modified": "2025-04-16T22:28:15.813Z",
            "description": "Monitor the addition of the MiniNT registry key in HKEY_LOCAL_MACHINE\\\\SYSTEM\\\\CurrentControlSet\\\\Control, which may disable Event Viewer.(Citation: def_ev_win_event_logging)\n\nAdversaries may disable Windows event logging to limit data that can be leveraged for detections and audits. There are different ways to perform this attack.\n1. The first one is to create the Registry Key HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\MiniNt. This action will not generate Security EventLog 4657 or Sysmon EventLog 13 because the value of the key remains empty. However, if an attacker uses powershell to perform this attack (and not cmd), a Security EventLog 4663 will be generated (but 4663 generates a lot of noise).\n2. The second way is to disable the service EventLog (display name Windows Event Log). After disabed, attacker must reboot the system. The action of disabling or put in manual the service will modify the Registry Key value HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\EventLog\\start, therefore Security EventLog 4657 or Sysmon EventLog 13 will be generated on the system.\n3. The third way is linked with the second. By default, the EventLog service cannot be stopped. If an attacker tries to stop the service, this one will restart immediately. Why ? Because to stop completely, this service must stop others, one in particular called netprofm (display name Network List Service). This service remains running until it is disabled. So Attacker must either disable EventLog and after to stop it or disable netprofm and after stop EventLog. Only stopping the service (even as admin) will not have an effect on the EventLog service because of the link with netprofm. Security EventLog 1100 will log the stop of the EventLog service (but also generates a lot of noise because it will generate a log everytime the system shutdown).\n4. The fourth way is to use auditpol.exe to modify the audit configuration and disable/modify important parameters that will lead to disable the creation of EventLog.\n5. The last one is to modify the Registry Key value HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\EventLog\\Security\\file (or other kind of log) to modify the path where the EventLog are stocked. Importantly, with this technique, the EventViewer will use the value of the Registry Key “file” to know where to find the Log. Thus, using the EventViewer will always show the current event logs, but the old one will be stocked in another evtx. Also, the path must be in a folder that the Eventlog process has access (like it doesn’t work if attacker set up the new path in the Desktop). Attacker can also decrease the maxsize value of the Log to force the system to rewrite on the older EventLog (but the minimum cannot be less than 1028 KB). As the Registry key is modified, Security EventLog 4657 or Sysmon EventLog 13 will be generated on the system. All of these attacks required administrative right. Attacks number three, four and five do not require a system reboot to be effective immediately.\n\nAnalytic 1 - Disable Windows Event Logging\n\n<code>(source=\"*WinEventLog:Security\" EventCode IN (4657, 4719) OR source=\"*WinEventLog:Microsoft-Windows-Sysmon/Operational\" EventCode=\"13\") \n\t(ObjectName=\"*EventLog*\") \n\t(ObjectValueName=\"Start\" OR ObjectValueName=\"File\" OR ObjectValueName=\"MaxSize\")</code>",
            "relationship_type": "detects",
            "source_ref": "x-mitre-data-component--da85d358-741a-410d-9433-20d6269a6170",
            "target_ref": "attack-pattern--4eb28bed-d11a-4641-9863-c2ac017d910a",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_deprecated": false,
            "x_mitre_attack_spec_version": "3.2.0"
        }
    ]
}