{
    "type": "bundle",
    "id": "bundle--24e71e40-bec6-4443-b308-0191f782eb53",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "relationship",
            "id": "relationship--97b6c034-b96c-4532-8dd7-51fedcdcd31f",
            "created": "2022-03-30T14:26:51.870Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "modified": "2025-04-16T22:33:43.162Z",
            "description": "Monitor and analyze traffic patterns and packet inspection associated to protocol(s), leveraging SSL/TLS inspection for encrypted traffic, that do not follow the expected protocol standards and traffic flows (e.g extraneous packets that do not belong to established flows, gratuitous or anomalous traffic patterns, anomalous syntax, or structure). Consider correlation with process monitoring and command line to detect anomalous processes execution and command line arguments associated to traffic patterns (e.g. monitor anomalies in use of files that do not normally initiate connections for respective protocol(s)).\n\nFurthermore, monitor network traffic for homographs via the use of internationalized domain names abusing different character sets (e.g. Cyrillic vs Latin versions of trusted sites). Also monitor and analyze traffic patterns and packet inspection for indicators of cloned websites. For example, if adversaries use HTTrack to clone websites,  <code> Mirrored from (victim URL)</code> may be visible in the HTML section of packets. ",
            "relationship_type": "detects",
            "source_ref": "x-mitre-data-component--3772e279-27d6-477a-9fe3-c6beb363594c",
            "target_ref": "attack-pattern--2d3f5b3c-54ca-4f4d-bb1f-849346d31230",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_deprecated": false,
            "x_mitre_attack_spec_version": "3.2.0"
        }
    ]
}