{
    "type": "bundle",
    "id": "bundle--e28c76e8-c7dc-4e60-8d48-7fdb36b8e9fd",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "relationship",
            "id": "relationship--4ebce143-6b85-4188-a8ea-010045c48bdd",
            "created": "2022-03-30T14:26:51.876Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "revoked": false,
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "modified": "2025-04-16T22:13:59.360Z",
            "description": "Suspicious program execution through services may show up as outlier processes that have not been seen before when compared against historical data. Look for abnormal process call trees from known services and for execution of other commands that could relate to Discovery or other adversary techniques. Data and events should not be viewed in isolation, but as part of a chain of behavior that could lead to other activities, such as network connections made for Command and Control, learning details about the environment through Discovery, and Lateral Movement.\n\nWindows runs the Service Control Manager (SCM) within the process services.exe. Windows launches services as independent processes or DLL loads within a svchost.exe group. To be a legitimate service, a process (or DLL) must have the appropriate service entry point SvcMain. If an application does not have the entry point, then it will timeout (default is 30 seconds) and the process will be killed.\n\nTo survive the timeout, adversaries and red teams can create services that direct to cmd.exe with the flag /c, followed by the desired command. The /c flag causes the command shell to run a command and immediately exit. As a result, the desired program will remain running and it will report an error starting the service. This analytic will catch that command prompt instance that is used to launch the actual malicious executable. Additionally, the children and descendants of services.exe will run as a SYSTEM user by default. \n\nNote: Create a baseline of services seen over the last 30 days and a list of services seen today. Remove services in the baseline from services seen today, leaving a list of new services. Returns all processes named cmd.exe that have services.exe as a parent process. Because this should never happen, the /c flag is redundant in the search.\n\nAnalytic 2 - Services launching CMD\n \n<code>  (sourcetype=WinEventLog:Microsoft-Windows-Sysmon/Operational EventCode=\"1\") OR (sourcetype=WinEventLog:Security EventCode=\"4688\") Image=\"*cmd.exe\" and ParentImage=\"*services.exe\"</code>",
            "relationship_type": "detects",
            "source_ref": "x-mitre-data-component--3d20385b-24ef-40e1-9f56-f39750379077",
            "target_ref": "attack-pattern--2959d63f-73fd-46a1-abd2-109d7dcede32",
            "x_mitre_modified_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_deprecated": false,
            "x_mitre_attack_spec_version": "3.2.0"
        }
    ]
}