{
    "type": "bundle",
    "id": "bundle--5c4ebf8b-e344-40e0-be39-39c114d79431",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "name": "Unauthorized Command Message",
            "description": "Adversaries may send unauthorized command messages to instruct control systems devices to perform actions outside their expected functionality for process control. Command messages are used in ICS networks to give direct instructions to control systems devices. If an adversary can send an unauthorized command message to a control system, then it can instruct the control systems device to perform an action outside the normal bounds of the device's actions. An adversary could potentially instruct a control systems device to perform an action that will cause an Impact. (Citation: Research - Research - Taxonomy Cyber Attacks on SCADA)\n\nIn the Maroochy Attack, the adversary used a dedicated analog two-way radio system to send false data and instructions to pumping stations and the central computer. (Citation: Maroochy - MITRE - 200808)\n\nIn the 2015 attack on the Ukranian power grid, the adversaries gained access to the control networks of three different energy companies. The adversaries used valid credentials to seize control of operator workstations and access a distribution management system (DMS) client application via a VPN. The adversaries used these tools to issue unauthorized commands to breakers at substations which caused a loss of power to over 225,000 customers over various areas. (Citation: Ukraine15 - EISAC - 201603)\n\nData Sources: Alarm history, Sequential event recorder, Netflow/Enclave netflow, Packet capture, Network protocol analysis",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-ics-attack",
                    "phase_name": "impair-process-control"
                }
            ],
            "x_mitre_platforms": [
                "Windows",
                "Field Controller/RTU/PLC/IED"
            ],
            "external_references": [
                {
                    "url": "https://collaborate.mitre.org/attackics/index.php/Technique/T855",
                    "source_name": "mitre-ics-attack",
                    "external_id": "T0855"
                },
                {
                    "description": "Bonnie Zhu, Anthony Joseph, Shankar Sastry. (2011). A Taxonomy of Cyber Attacks on SCADA Systems. Retrieved January 12, 2018.",
                    "source_name": "Research - Research - Taxonomy Cyber Attacks on SCADA",
                    "url": "http://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=6142258"
                },
                {
                    "description": "Electricity Information Sharing and Analysis Center; SANS Industrial Control Systems. (2016, March 18). Analysis of the Cyber Attack on the Ukranian Power Grid: Defense Use Case. Retrieved March 27, 2018.",
                    "source_name": "Ukraine15 - EISAC - 201603",
                    "url": "https://ics.sans.org/media/E-ISAC%20SANS%20Ukraine%20DUC%205.pdf"
                },
                {
                    "description": "Marshall Abrams. (2008, July 23). Malicious Control System Cyber Security Attack Case Study– Maroochy Water Services, Australia. Retrieved March 27, 2018.",
                    "source_name": "Maroochy - MITRE - 200808",
                    "url": "https://www.mitre.org/sites/default/files/pdf/08%201145.pdf"
                }
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "created": "2020-05-21T17:43:26.506Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_data_sources": [
                "Alarm history",
                "Sequential event recorder",
                "Netflow/Enclave netflow",
                "Packet capture",
                "Network protocol analysis"
            ],
            "modified": "2020-05-21T17:43:26.506Z",
            "id": "attack-pattern--40b300ba-f553-48bf-862e-9471b220d455"
        }
    ]
}        