{
    "type": "bundle",
    "id": "bundle--f0e48989-0c13-464b-a372-af44b589f6ff",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "name": "Data Destruction",
            "description": "Adversaries may perform data destruction over the course of an operation. The adversary may drop or create malware, tools, or other non-native files on a target system to accomplish this, potentially leaving behind traces of malicious activities. Such non-native files and other data may be removed over the course of an intrusion to maintain a small footprint or as a standard part of the post-intrusion cleanup process. (Citation: EAttack File Deletion) \n\nData destruction may also be used to render operator interfaces unable to respond and to disrupt response functions from occurring as expected. An adversary may also destroy data backups that are vital to recovery after an incident.\n\nStandard file deletion commands are available on most operating system and device interfaces to perform cleanup, but adversaries may use other tools as well. Two examples are Windows Sysinternals SDelete and Active@ Killdisk.\n\nDetection: It may be uncommon for events related to benign command-line functions such as DEL or third-party utilities or tools to be found in an environment, depending on the user base and how systems are typically used. Monitoring for command-line deletion functions to correlate with binaries or other files that an adversary may drop and remove may lead to detection of malicious activity. Another good practice is monitoring for known deletion and secure deletion tools that are not already on systems within an enterprise network that an adversary could introduce. Some monitoring tools may collect command-line arguments, but may not capture DEL commands since DEL is a native function within cmd.exe.",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-ics-attack",
                    "phase_name": "inhibit-response-function"
                }
            ],
            "x_mitre_platforms": [
                "Control Server",
                "Human-Machine Interface",
                "Field Controller/RTU/PLC/IED"
            ],
            "external_references": [
                {
                    "url": "https://collaborate.mitre.org/attackics/index.php/Technique/T0809",
                    "source_name": "mitre-ics-attack",
                    "external_id": "T0809"
                },
                {
                    "description": "Enterprise ATT&CK. (2018, January 11). File Deletion. Retrieved May 17, 2018.",
                    "source_name": "EAttack File Deletion",
                    "url": "https://attack.mitre.org/wiki/Technique/T1107"
                }
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "created": "2020-05-21T17:43:26.506Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_data_sources": [
                "Command: Command Execution",
                "File: File Deletion",
                "File: File Modification",
                "Process: Process Creation"
            ],
            "x_mitre_contributors": [
                "Matan Dobrushin - Otorio"
            ],
            "modified": "2021-10-08T13:04:01.612Z",
            "id": "attack-pattern--493832d9-cea6-4b63-abe7-9a65a6473675"
        }
    ]
}