{
    "type": "bundle",
    "id": "bundle--70360ad7-3079-4790-81b5-10d632ea1961",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "name": "Wireless Sniffing",
            "description": "Adversaries may seek to capture radio frequency (RF) communication used for remote control and reporting in distributed environments. RF communication frequencies vary between 3 kHz to 300 GHz, although are commonly between 300 MHz to 6 GHz. The wavelength and frequency of the signal affect how the signal propagates through open air, obstacles (e.g. walls and trees) and the type of radio required to capture them. These characteristics are often standardized in the protocol and hardware and may have an effect on how the signal is captured. Some examples of wireless protocols that may be found in cyber-physical environments are: WirelessHART, Zigbee, WIA-FA, and 700 MHz Public Safety Spectrum. Adversaries may capture RF communications by using specialized hardware, such as software defined radio (SDR), handheld radio, or a computer with radio demodulator tuned to the communication frequency. Information transmitted over a wireless medium may be captured in-transit whether the sniffing device is the intended destination or not. This technique may be particularly useful to an adversary when the communications are not encrypted. In the 2017 Dallas Siren incident, it is suspected that adversaries likely captured wireless command message broadcasts on a 700 MHz frequency during a regular test of the system. These messages were later replayed to trigger the alarm systems.",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-ics-attack",
                    "phase_name": "discovery-ics"
                },
                {
                    "kill_chain_name": "mitre-ics-attack",
                    "phase_name": "collection-ics"
                }
            ],
            "x_mitre_platforms": [
                "None"
            ],
            "external_references": [
                {
                    "url": "https://collaborate.mitre.org/attackics/index.php/Technique/T0887",
                    "source_name": "mitre-ics-attack",
                    "external_id": "T0887"
                },
                {
                    "description": "Candell, R., Hany, M., Lee, K. B., Liu,Y., Quimby, J., Remley, K.. (2018, April). Guide to Industrial Wireless Systems Deployments. Retrieved December 1, 2020.",
                    "source_name": "NIST AMS 300-4 April 2018",
                    "url": "https://nvlpubs.nist.gov/nistpubs/ams/NIST.AMS.300-4.pdf"
                },
                {
                    "description": "Bastille. (2017, April 17). Dallas Siren Attack. Retrieved November 6, 2020.",
                    "source_name": "Bastille Dallas April 2017",
                    "url": "https://www.bastille.net/blogs/2017/4/17/dallas-siren-attack"
                },
                {
                    "description": "Gallagher, S.. (2017, April 12). Pirate radio: Signal spoof set off Dallas emergency sirens, not network hack. Retrieved December 1, 2020.",
                    "source_name": "Ars Technica Dallas April 2017",
                    "url": "https://arstechnica.com/information-technology/2017/04/dallas-siren-hack-used-radio-signals-to-spoof-alarm-says-city-manager/"
                }
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "created": "2020-05-21T17:43:26.506Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_contributors": [
                "ICSCoE Japan"
            ],
            "modified": "2021-04-12T19:03:26.506Z",
            "id": "attack-pattern--0fe075d5-beac-4d02-b93e-0f874997db72"
        }
    ]
}