{
    "type": "bundle",
    "id": "bundle--7efcdae7-526a-4df9-bbbc-a40af0eb0139",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "name": "Loss of Safety",
            "description": "Adversaries may cause loss of safety whether on purpose or as a consequence of actions taken to accomplish an operation. The loss of safety can describe a physical impact and threat, or the potential for unsafe conditions and activity in terms of control systems environments, devices, or processes. For instance, an adversary may issue commands or influence and possibly inhibit safety mechanisms that allow the injury of and possible loss of life. This can also encompass scenarios resulting in the failure of a safety mechanism or control, that may lead to unsafe and dangerous execution and outcomes of physical processes and related systems. (Citation: Reference - Corero) (Citation: Reference - SANS - 201510) (Citation: Reference - RIoT)\n\nThe German Federal Office for Information Security (BSI) reported a targeted attack on a steel mill in its 2014 IT Security Report. (Citation: German Steel Mill - German Federal Office for Information Security - 2014) These targeted attacks affected industrial operations and resulted in breakdowns of control system components and even entire installations. As a result of these breakdowns, massive impact resulted in damage and unsafe conditions from the uncontrolled shutdown of a blast furnace. \n\nA Polish student used a remote controller device to interface with the Lodz city tram system in Poland. (Citation: LodzTram-LondonReconnections-2017-12) (Citation: LodzTram-InHomelandSecurity-2008-02) (Citation: LodzTram-Schneier-2008-01) Using this remote, the student was able to capture and replay legitimate tram signals. As a consequence, four trams were derailed and twelve people injured due to resulting emergency stops. (Citation: LodzTram-InHomelandSecurity-2008-02) The track controlling commands issued may have also resulted in tram collisions, a further risk to those on board and nearby the areas of impact. (Citation: LodzTram-Schneier-2008-01)",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-ics-attack",
                    "phase_name": "impact-ics"
                }
            ],
            "x_mitre_platforms": [
                "Windows"
            ],
            "external_references": [
                {
                    "url": "https://collaborate.mitre.org/attackics/index.php/Technique/T880",
                    "source_name": "mitre-ics-attack",
                    "external_id": "T0880"
                },
                {
                    "description": "John Bill. (2017, May 12). Hacked Cyber Security Railways. Retrieved October 17, 2019.",
                    "source_name": "LodzTram-LondonReconnections-2017-12",
                    "url": "https://www.londonreconnections.com/2017/hacked-cyber-security-railways/"
                },
                {
                    "description": "Shelley Smith. (2008, February 12). Teen Hacker in Poland Plays Trains and Derails City Tram System. Retrieved October 17, 2019.",
                    "source_name": "LodzTram-InHomelandSecurity-2008-02",
                    "url": "https://inhomelandsecurity.com/teen%20hacker%20in%20poland%20plays%20tr/"
                },
                {
                    "description": "Bruce Schneier. (2008, January 17). Hacking Polish Trams. Retrieved October 17, 2019.",
                    "source_name": "LodzTram-Schneier-2008-01",
                    "url": "https://www.schneier.com/blog/archives/2008/01/hacking%20the%20pol.html"
                },
                {
                    "description": "Bundesamt für Sicherheit in der Informationstechnik (BSI) (German Federal Office for Information Security). (2014). Die Lage der IT-Sicherheit in Deutschland 2014 (The State of IT Security in Germany). Retrieved October 30, 2019.",
                    "source_name": "German Steel Mill - German Federal Office for Information Security - 2014",
                    "url": "https://www.bsi.bund.de/SharedDocs/Downloads/EN/BSI/Publications/Securitysituation/IT-Security-Situation-in-Germany-2014.pdf?%20blob=publicationFile&v=3"
                },
                {
                    "description": "Corero. (n.d.). Industrial Control System (ICS) Security. Retrieved November 4, 2019.",
                    "source_name": "Reference - Corero",
                    "url": "https://www.corero.com/resources/files/whitepapers/cns%20whitepaper%20ics.pdf"
                },
                {
                    "description": "Michael J. Assante and Robert M. Lee. (n.d.). The Industrial Control System Cyber Kill Chain. Retrieved November 4, 2019.",
                    "source_name": "Reference - SANS - 201510",
                    "url": "https://www.sans.org/reading-room/whitepapers/ICS/industrial-control-system-cyber-kill-chain-36297"
                },
                {
                    "description": "Tyson Macaulay. (n.d.). RIoT Control: Understanding and Managing Risks and the Internet of Things. Retrieved November 4, 2019.",
                    "source_name": "Reference - RIoT"
                }
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "created": "2020-05-21T17:43:26.506Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "modified": "2020-05-21T17:43:26.506Z",
            "id": "attack-pattern--5fa00fdd-4a55-4191-94a0-564181d7fec2"
        }
    ]
}        