{
    "type": "bundle",
    "id": "bundle--ee1a1cec-9a7a-4200-a209-c5b04b7ef198",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "name": "Modify Controller Tasking",
            "description": "Adversaries may modify the tasking of a controller to allow for the execution of their own programs. This can allow an adversary to manipulate the execution flow and behavior of a controller. According to 61131-3, the association of a Task with a Program Organization Unit (POU) defines a task association. An adversary may modify these associations or create new ones to manipulate the execution flow of a controller. Modification of controller tasking can be accomplished using a Program Download in addition to other types of program modification such as online edit and program append. Tasks have properties, such as interval, frequency and priority to meet the requirements of program execution. Some controller vendors implement tasks with implicit, pre-defined properties whereas others allow for these properties to be formulated explicitly. An adversary may associate their program with tasks that have a higher priority or execute associated programs more frequently. For instance, to ensure cyclic execution of their program on a Siemens controller, an adversary may add their program to the “task”, Organization Block 1 (OB1).",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-ics-attack",
                    "phase_name": "execution-ics"
                }
            ],
            "x_mitre_platforms": [
                "Field Controller/RTU/PLC/IED"
            ],
            "external_references": [
                {
                    "url": "https://collaborate.mitre.org/attackics/index.php/Technique/T0821",
                    "source_name": "mitre-ics-attack",
                    "external_id": "T0821"
                }
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "created": "2021-04-13T11:15:26.506Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_data_sources": [
                "File: File Modification",
                "Asset: Software/Firmware"
            ],
            "modified": "2021-10-08T15:25:32.143Z",
            "id": "attack-pattern--09a61657-46e1-439e-b3ed-3e4556a78243"
        }
    ]
}