{
    "type": "bundle",
    "id": "bundle--baf381a5-d225-41d0-9f61-c4aca6d03e2f",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "name": "Rootkit",
            "description": "Adversaries may deploy rootkits to hide the presence of programs, files, network connections, services, drivers, and other system components. Rootkits are programs that hide the existence of malware by intercepting and modifying operating-system API calls that supply system information. Rootkits or rootkit-enabling functionality may reside at the user or kernel level in the operating system, or lower. (Citation: EAttack Rootkit) \n\nFirmware rootkits that affect the operating system yield nearly full control of the system. While firmware rootkits are normally developed for the main processing board, they can also be developed for I/O  that can be attached to the asset. Compromise of this firmware allows the modification of all of the process variables and functions the module engages in. This may result in commands being disregarded and false information being fed to the main device. By tampering with device processes, an adversary may inhibit its expected response functions and possibly enable Impact.\n\nDetection: Some rootkit protections may be built into anti-virus or operating system software. There are dedicated rootkit detection tools that look for specific types of rootkit behavior. Monitor for the existence of unrecognized DLLs, devices, services, and changes to the MBR.Reference - Rootkit",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-ics-attack",
                    "phase_name": "evasion-ics"
                },
                {
                    "kill_chain_name": "mitre-ics-attack",
                    "phase_name": "inhibit-response-function"
                }
            ],
            "x_mitre_platforms": [
                "Field Controller/RTU/PLC/IED"
            ],
            "external_references": [
                {
                    "url": "https://collaborate.mitre.org/attackics/index.php/Technique/T0851",
                    "source_name": "mitre-ics-attack",
                    "external_id": "T0851"
                },
                {
                    "description": "Enterprise ATT&CK. (2018, January 11). Rootkit. Retrieved May 16, 2018.",
                    "source_name": "EAttack Rootkit",
                    "url": "https://attack.mitre.org/wiki/Technique/T1014"
                }
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "created": "2020-05-21T17:43:26.506Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_data_sources": [
                "Drive: Drive Modification",
                "Firmware: Firmware Modification",
                "Module: Module Load"
            ],
            "modified": "2021-10-08T15:25:32.143Z",
            "id": "attack-pattern--3b6b9246-43f8-4c69-ad7a-2b11cfe0a0d9"
        }
    ]
}