{
    "type": "bundle",
    "id": "bundle--3f354bf5-62c1-4b61-b330-2e9289b8d3db",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "name": "Valid Accounts",
            "description": "Adversaries may steal the credentials of a specific user or service account using credential access techniques. In some cases, default credentials for control system devices may be publicly available. Compromised credentials may be used to bypass access controls placed on various resources on hosts and within the network, and may even be used for persistent access to remote systems. Compromised and default credentials may also grant an adversary increased privilege to specific systems and devices or access to restricted areas of the network. Adversaries may choose not to use malware or tools, in conjunction with the legitimate access those credentials provide, to make it harder to detect their presence or to control devices and send legitimate commands in an unintended way. Adversaries may also create accounts, sometimes using predefined account names and passwords, to provide a means of backup access for persistence.(Citation: BlackEnergy - Booz Allen Hamilton) The overlap of credentials and permissions across a network of systems is of concern because the adversary may be able to pivot across accounts and systems to reach a high level of access (i.e., domain or enterprise administrator) and possibly between the enterprise and operational technology environments. Adversaries may be able to leverage valid credentials from one system to gain access to another system.",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-ics-attack",
                    "phase_name": "persistence-ics"
                },
                {
                    "kill_chain_name": "mitre-ics-attack",
                    "phase_name": "lateral-movement-ics"
                }
            ],
            "x_mitre_platforms": [
                "Control Server",
                "Data Historian",
                "Engineering Workstation",
                "Field Controller/RTU/PLC/IED",
                "Human-Machine Interface",
                "Input/Output Server",
                "Safety Instrumented System/Protection Relay"
            ],
            "external_references": [
                {
                    "url": "https://collaborate.mitre.org/attackics/index.php/Technique/T0859",
                    "source_name": "mitre-ics-attack",
                    "external_id": "T0859"
                },
                {
                    "description": "Electricity Information Sharing and Analysis Center; SANS Industrial Control Systems. (2016, March 18). Analysis of the Cyber Attack on the Ukranian Power Grid: Defense Use Case. Retrieved March 27, 2018.",
                    "source_name": "Ukraine15 - EISAC - 201603",
                    "url": "https://ics.sans.org/media/E-ISAC%20SANS%20Ukraine%20DUC%205.pdf"
                },
                {
                    "description": "Booz Allen Hamilton. (n.d.). When The Lights Went Out. Retrieved October 22, 2019.",
                    "source_name": "BlackEnergy - Booz Allen Hamilton",
                    "url": "https://www.boozallen.com/content/dam/boozallen/documents/2016/09/ukraine-report-when-the-lights-went-out.pdf"
                }
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "created": "2020-05-21T17:43:26.506Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_data_sources": [
                "Logon Session: Logon Session Creation",
                "User Account: User Account Authentication"
            ],
            "modified": "2021-10-08T15:25:32.143Z",
            "id": "attack-pattern--cd2c76a4-5e23-4ca5-9c40-d5e0604f7101"
        }
    ]
}