{
    "type": "bundle",
    "id": "bundle--d7130634-a0cb-4b0c-b72b-2ab37a5cc6e0",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "name": "Utilize/Change Operating Mode",
            "description": "Adversaries may place controllers into an alternate mode of operation to enable configuration setting changes for evasive code execution or to inhibit device functionality. Programmable controllers typically have several modes of operation. These modes can be broken down into three main categories: program run, program edit, and program write.  Each of these modes puts the device in a state in which certain functions are available.  For instance, the program edit mode allows alterations to be made to the user program while the device is still online.\n\t\t\t\nBy driving a device into an alternate mode of operation, an adversary has the ability to change configuration settings in such a way to cause a Impact to equipment and/or industrial process associated with the targeted device. An adversary may also use this alternate mode to execute arbitrary code which could be used to evade defenses.\n\nPlatforms: Linux, SCADA/ICS device, Windows 7, Windows 8, Windows 8.1, Windows Server 2003, Windows Server 2003 R2, Windows Server 2008, Windows Server 2008 R2, Windows Server 2012, Windows Server 2012 R2, Windows Vista, Windows XP\n\nData Sources: Alarm history, Sequential event recorder, Network protocol analysis, Packet capture",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-ics-attack",
                    "phase_name": "evasion-ics"
                },
                {
                    "kill_chain_name": "mitre-ics-attack",
                    "phase_name": "inhibit-response-function"
                }
            ],
            "x_mitre_platforms": [
                "Windows",
                "Safety Instrumented System/Protection Relay", 
                "Field Controller/RTU/PLC/IED"
            ],
            "external_references": [
                {
                    "url": "https://collaborate.mitre.org/attackics/index.php/Technique/T858",
                    "source_name": "mitre-ics-attack",
                    "external_id": "T0858"
                }
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "created": "2020-05-21T17:43:26.506Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_data_sources": [
                "Alarm history",
                "Sequential event recorder",
                "Network protocol analysis",
                "Packet capture"
            ],
            "modified": "2020-05-21T17:43:26.506Z",
            "id": "attack-pattern--2883c520-7957-46ca-89bd-dab1ad53b601"
        }
    ]
}        