{
    "type": "bundle",
    "id": "bundle--943b09f3-6614-44f2-b248-f4270a909d11",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--57340c81-c025-4189-8fa0-fc7ede51bae4",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "created": "2017-05-31T21:31:23.587Z",
            "modified": "2017-12-14T16:55:59.600Z",
            "name": "Modify Registry",
            "description": "Adversaries may interact with the Windows Registry to hide configuration information within Registry keys, remove information as part of cleaning up, or as part of other techniques to aid in Persistence and Execution.\n\nAccess to specific areas of the Registry depends on account permissions, some requiring administrator-level access. The built-in Windows command-line utility Reg may be used for local or remote Registry modification. (Citation: Microsoft Reg) Other tools may also be used, such as a remote access tool, which may contain functionality to interact with the Registry through the Windows API (see examples).\n\nThe Registry of a remote system may be modified to aid in execution of files as part of Lateral Movement. It requires the remote Registry service to be running on the target system. (Citation: Microsoft Remote) Often Valid Accounts are required, along with access to the remote system's Windows Admin Shares for RPC communication.\n\nDetection: Modifications to the Registry are normal and occur throughout typical use of the Windows operating system. Changes to Registry entries that load software on Windows startup that do not correlate with known software, patch cycles, etc., are suspicious, as are additions or changes to files within the startup folder. Changes could also include new services and modification of existing binary paths to point to malicious files. If a change to a service-related entry occurs, then it will likely be followed by a local or remote service start or restart to execute the file.\n\nMonitor processes and command-line arguments for actions that could be taken to change or delete information in the Registry. Remote access tools with built-in features may interact directly with the Windows API to gather information. Information may also be acquired through Windows system management tools such as Windows Management Instrumentation and PowerShell, which may require additional logging features to be configured in the operating system to collect necessary information for analysis.\n\nPlatforms: Windows Server 2003, Windows Server 2008, Windows Server 2012, Windows XP, Windows 7, Windows 8, Windows Server 2003 R2, Windows Server 2008 R2, Windows Server 2012 R2, Windows Vista, Windows 8.1, Windows 10\n\nData Sources: Windows Registry, File monitoring, Process monitoring, Process command-line parameters\n\nDefense Bypassed: Host forensic analysis\n\nPermissions Required: User, Administrator, SYSTEM\n\nContributors: Bartosz Jerzman",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-attack",
                    "phase_name": "defense-evasion"
                }
            ],
            "external_references": [
                {
                    "source_name": "mitre-attack",
                    "url": "https://attack.mitre.org/wiki/Technique/T1112",
                    "external_id": "T1112"
                },
                {
                    "source_name": "Microsoft Reg",
                    "description": "Microsoft. (2012, April 17). Reg. Retrieved May 1, 2015.",
                    "url": "https://technet.microsoft.com/en-us/library/cc732643.aspx"
                },
                {
                    "source_name": "Microsoft Remote",
                    "description": "Microsoft. (n.d.). Enable the Remote Registry Service. Retrieved May 1, 2015.",
                    "url": "https://technet.microsoft.com/en-us/library/cc754820.aspx"
                }
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "x_mitre_contributors": [
                "Bartosz Jerzman"
            ],
            "x_mitre_data_sources": [
                "Windows Registry",
                "File monitoring",
                "Process monitoring",
                "Process command-line parameters"
            ],
            "x_mitre_defense_bypassed": [
                "Host forensic analysis"
            ],
            "x_mitre_permissions_required": [
                "User",
                "Administrator",
                "SYSTEM"
            ],
            "x_mitre_platforms": [
                "Windows Server 2003",
                "Windows Server 2008",
                "Windows Server 2012",
                "Windows XP",
                "Windows 7",
                "Windows 8",
                "Windows Server 2003 R2",
                "Windows Server 2008 R2",
                "Windows Server 2012 R2",
                "Windows Vista",
                "Windows 8.1",
                "Windows 10"
            ]
        }
    ]
}