{
    "type": "bundle",
    "id": "bundle--c991cdd4-8d68-4196-91b5-c1e90db53996",
    "spec_version": "2.0",
    "objects": [
        {
            "x_mitre_permissions_required": [
                "Administrator",
                "SYSTEM"
            ],
            "x_mitre_data_sources": [
                "Authentication logs",
                "Packet capture",
                "Process monitoring",
                "API monitoring"
            ],
            "name": "Man in the Browser",
            "description": "Adversaries can take advantage of security vulnerabilities and inherent functionality in browser software to change content, modify behavior, and intercept information as part of various man in the browser techniques. (Citation: Wikipedia Man in the Browser)\n\nA specific example is when an adversary injects software into a browser that allows an them to inherit cookies, HTTP sessions, and SSL client certificates of a user and use the browser as a way to pivot into an authenticated intranet. (Citation: Cobalt Strike Browser Pivot) (Citation: ICEBRG Chrome Extensions)\n\nBrowser pivoting requires the SeDebugPrivilege and a high-integrity process to execute. Browser traffic is pivoted from the adversary's browser through the user's browser by setting up an HTTP proxy which will redirect any HTTP and HTTPS traffic. This does not alter the user's traffic in any way. The proxy connection is severed as soon as the browser is closed. Whichever browser process the proxy is injected into, the adversary assumes the security context of that process. Browsers typically create a new process for each tab that is opened and permissions and certificates are separated accordingly. With these permissions, an adversary could browse to any resource on an intranet that is accessible through the browser and which the browser has sufficient permissions, such as Sharepoint or webmail. Browser pivoting also eliminates the security provided by 2-factor authentication. (Citation: cobaltstrike manual)",
            "id": "attack-pattern--544b0346-29ad-41e1-a808-501bb4193f47",
            "x_mitre_platforms": [
                "Windows"
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "x_mitre_version": "1.0",
            "type": "attack-pattern",
            "x_mitre_detection": "This is a difficult technique to detect because adversary traffic would be masked by normal user traffic. No new processes are created and no additional software touches disk. Authentication logs can be used to audit logins to specific web applications, but determining malicious logins versus benign logins may be difficult if activity matches typical user behavior. Monitor for process injection against browser applications",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_contributors": [
                "Justin Warner, ICEBRG"
            ],
            "created": "2018-01-16T16:13:52.465Z",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-attack",
                    "phase_name": "collection"
                }
            ],
            "external_references": [
                {
                    "external_id": "T1185",
                    "source_name": "mitre-attack",
                    "url": "https://attack.mitre.org/techniques/T1185"
                },
                {
                    "source_name": "Wikipedia Man in the Browser",
                    "description": "Wikipedia. (2017, October 28). Man-in-the-browser. Retrieved January 10, 2018.",
                    "url": "https://en.wikipedia.org/wiki/Man-in-the-browser"
                },
                {
                    "source_name": "Cobalt Strike Browser Pivot",
                    "description": "Mudge, R. (n.d.). Browser Pivoting. Retrieved January 10, 2018.",
                    "url": "https://www.cobaltstrike.com/help-browser-pivoting"
                },
                {
                    "source_name": "ICEBRG Chrome Extensions",
                    "description": "De Tore, M., Warner, J. (2018, January 15). MALICIOUS CHROME EXTENSIONS ENABLE CRIMINALS TO IMPACT OVER HALF A MILLION USERS AND GLOBAL BUSINESSES. Retrieved January 17, 2018.",
                    "url": "https://www.icebrg.io/blog/malicious-chrome-extensions-enable-criminals-to-impact-over-half-a-million-users-and-global-businesses"
                },
                {
                    "source_name": "cobaltstrike manual",
                    "description": "Strategic Cyber LLC. (2017, March 14). Cobalt Strike Manual. Retrieved May 24, 2017.",
                    "url": "https://cobaltstrike.com/downloads/csmanual38.pdf"
                }
            ],
            "modified": "2019-07-18T15:36:27.346Z"
        }
    ]
}