{
    "type": "bundle",
    "id": "bundle--2214c1a0-4b78-4333-ba7a-d70998fe4ae8",
    "spec_version": "2.0",
    "objects": [
        {
            "x_mitre_permissions_required": [
                "Administrator",
                "SYSTEM",
                "User"
            ],
            "x_mitre_data_sources": [
                "Netflow/Enclave netflow",
                "Network protocol analysis",
                "Packet capture",
                "Process command-line parameters",
                "Process use of network"
            ],
            "name": "Network Service Scanning",
            "description": "Adversaries may attempt to get a listing of services running on remote hosts, including those that may be vulnerable to remote software exploitation. Methods to acquire this information include port scans and vulnerability scans using tools that are brought onto a system. \n\nWithin cloud environments, adversaries may attempt to discover services running on other cloud hosts or cloud services enabled within the environment. Additionally, if the cloud environment is connected to a on-premises environment, adversaries may be able to identify services running on non-cloud systems.",
            "id": "attack-pattern--e3a12395-188d-4051-9a16-ea8e14d07b88",
            "x_mitre_platforms": [
                "Linux",
                "Windows",
                "macOS",
                "AWS",
                "GCP",
                "Azure"
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "x_mitre_version": "2",
            "type": "attack-pattern",
            "x_mitre_detection": "System and network discovery techniques normally occur throughout an operation as an adversary learns the environment. Data and events should not be viewed in isolation, but as part of a chain of behavior that could lead to other activities, such as Lateral Movement, based on the information obtained.\n\nNormal, benign system and network events from legitimate remote service scanning may be uncommon, depending on the environment and how they are used. Legitimate open port and vulnerability scanning may be conducted within the environment and will need to be deconflicted with any detection capabilities developed. Network intrusion detection systems can also be used to identify scanning activity. Monitor for process use of the networks and inspect intra-network flows to detect port scans.",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_contributors": [
                "Praetorian"
            ],
            "created": "2017-05-31T21:30:43.915Z",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-attack",
                    "phase_name": "discovery"
                }
            ],
            "external_references": [
                {
                    "external_id": "T1046",
                    "source_name": "mitre-attack",
                    "url": "https://attack.mitre.org/techniques/T1046"
                },
                {
                    "source_name": "capec",
                    "external_id": "CAPEC-300",
                    "url": "https://capec.mitre.org/data/definitions/300.html"
                }
            ],
            "modified": "2019-10-23T14:20:49.573Z"
        }
    ]
}