{
    "type": "bundle",
    "id": "bundle--58a28ae4-903c-4d7e-91e2-cbc220c73829",
    "spec_version": "2.0",
    "objects": [
        {
            "x_mitre_data_sources": [
                "Network device logs",
                "Host network interface",
                "Netflow/Enclave netflow",
                "Process monitoring"
            ],
            "x_mitre_permissions_required": [
                "Administrator",
                "SYSTEM"
            ],
            "name": "Network Sniffing",
            "description": "Network sniffing refers to using the network interface on a system to monitor or capture information sent over a wired or wireless connection. An adversary may place a network interface into promiscuous mode to passively access data in transit over the network, or use span ports to capture a larger amount of data.\n\nData captured via this technique may include user credentials, especially those sent over an insecure, unencrypted protocol. Techniques for name service resolution poisoning, such as [LLMNR/NBT-NS Poisoning and Relay](https://attack.mitre.org/techniques/T1171), can also be used to capture credentials to websites, proxies, and internal systems by redirecting traffic to an adversary.\n\nNetwork sniffing may also reveal configuration details, such as running services, version numbers, and other network characteristics (ex: IP addressing, hostnames, VLAN IDs) necessary for follow-on Lateral Movement and/or Defense Evasion activities.",
            "id": "attack-pattern--3257eb21-f9a7-4430-8de1-d8b6e288f529",
            "x_mitre_platforms": [
                "Linux",
                "macOS",
                "Windows"
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "x_mitre_version": "1.0",
            "x_mitre_system_requirements": [
                "Network interface access and packet capture driver"
            ],
            "type": "attack-pattern",
            "x_mitre_detection": "Detecting the events leading up to sniffing network traffic may be the best method of detection. From the host level, an adversary would likely need to perform a man-in-the-middle attack against other devices on a wired network in order to capture traffic that was not to or from the current compromised system. This change in the flow of information is detectable at the enclave network level. Monitor for ARP spoofing and gratuitous ARP broadcasts. Detecting compromised network devices is a bit more challenging. Auditing administrator logins, configuration changes, and device images is required to detect malicious changes.",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "created": "2017-05-31T21:30:41.399Z",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-attack",
                    "phase_name": "credential-access"
                },
                {
                    "kill_chain_name": "mitre-attack",
                    "phase_name": "discovery"
                }
            ],
            "external_references": [
                {
                    "external_id": "T1040",
                    "source_name": "mitre-attack",
                    "url": "https://attack.mitre.org/techniques/T1040"
                },
                {
                    "source_name": "capec",
                    "external_id": "CAPEC-158",
                    "url": "https://capec.mitre.org/data/definitions/158.html"
                }
            ],
            "modified": "2019-07-18T16:42:21.548Z"
        }
    ]
}