{
    "type": "bundle",
    "id": "bundle--21e8b0dc-c09f-4d25-b2f8-c3f939816882",
    "spec_version": "2.0",
    "objects": [
        {
            "x_mitre_data_sources": [
                "Network protocol analysis",
                "Process monitoring",
                "Process use of network",
                "Process command-line parameters"
            ],
            "x_mitre_permissions_required": [
                "User",
                "Administrator",
                "SYSTEM"
            ],
            "name": "Remote System Discovery",
            "description": "Adversaries will likely attempt to get a listing of other systems by IP address, hostname, or other logical identifier on a network that may be used for Lateral Movement from the current system. Functionality could exist within remote access tools to enable this, but utilities available on the operating system could also be used. Adversaries may also use local host files in order to discover the hostname to IP address mappings of remote systems. \n\n### Windows\n\nExamples of tools and commands that acquire this information include \"ping\" or \"net view\" using [Net](https://attack.mitre.org/software/S0039). The contents of the <code>C:\\Windows\\System32\\Drivers\\etc\\hosts</code> file can be viewed to gain insight into the existing hostname to IP mappings on the system.\n\n### Mac\n\nSpecific to Mac, the <code>bonjour</code> protocol to discover additional Mac-based systems within the same broadcast domain. Utilities such as \"ping\" and others can be used to gather information about remote systems. The contents of the <code>/etc/hosts</code> file can be viewed to gain insight into existing hostname to IP mappings on the system.\n\n### Linux\n\nUtilities such as \"ping\" and others can be used to gather information about remote systems. The contents of the <code>/etc/hosts</code> file can be viewed to gain insight into existing hostname to IP mappings on the system.\n\n### Cloud\n\nIn cloud environments, the above techniques may be used to discover remote systems depending upon the host operating system. In addition, cloud environments often provide APIs with information about remote systems and services.\n",
            "id": "attack-pattern--e358d692-23c0-4a31-9eb6-ecc13a8d7735",
            "x_mitre_platforms": [
                "Linux",
                "macOS",
                "Windows",
                "GCP",
                "Azure",
                "AWS"
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "x_mitre_version": "2.0",
            "type": "attack-pattern",
            "x_mitre_detection": "System and network discovery techniques normally occur throughout an operation as an adversary learns the environment. Data and events should not be viewed in isolation, but as part of a chain of behavior that could lead to other activities, such as Lateral Movement, based on the information obtained.\n\nNormal, benign system and network events related to legitimate remote system discovery may be uncommon, depending on the environment and how they are used. Monitor processes and command-line arguments for actions that could be taken to gather system and network information. Remote access tools with built-in features may interact directly with the Windows API to gather information. Information may also be acquired through Windows system management tools such as [Windows Management Instrumentation](https://attack.mitre.org/techniques/T1047) and [PowerShell](https://attack.mitre.org/techniques/T1086). ",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_contributors": [
                "Praetorian",
                "RedHuntLabs (@redhuntlabs)"
            ],
            "created": "2017-05-31T21:30:28.187Z",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-attack",
                    "phase_name": "discovery"
                }
            ],
            "external_references": [
                {
                    "external_id": "T1018",
                    "source_name": "mitre-attack",
                    "url": "https://attack.mitre.org/techniques/T1018"
                },
                {
                    "source_name": "capec",
                    "external_id": "CAPEC-292",
                    "url": "https://capec.mitre.org/data/definitions/292.html"
                }
            ],
            "modified": "2019-10-08T20:36:57.696Z"
        }
    ]
}