{
    "type": "bundle",
    "id": "bundle--b97dd653-be4a-4e39-815c-057ab2ee1323",
    "spec_version": "2.0",
    "objects": [
        {
            "x_mitre_permissions_required": [
                "User"
            ],
            "x_mitre_data_sources": [
                "SSL/TLS inspection",
                "DNS records",
                "Anti-virus",
                "Web proxy",
                "File monitoring",
                "Mail server",
                "Office 365 trace logs"
            ],
            "name": "Internal Spearphishing",
            "description": "Adversaries may use internal spearphishing to gain access to additional information or exploit other users within the same organization after they already have access to accounts or systems within the environment. Internal spearphishing is multi-staged attack where an email account is owned either by controlling the user's device with previously installed malware or by compromising the account credentials of the user. Adversaries attempt to take advantage of a trusted internal account to increase the likelihood of tricking the target into falling for the phish attempt.(Citation: Trend Micro When Phishing Starts from the Inside 2017)\n\nAdversaries may leverage [Spearphishing Attachment](https://attack.mitre.org/techniques/T1193) or [Spearphishing Link](https://attack.mitre.org/techniques/T1192) as part of internal spearphishing to deliver a payload or redirect to an external site to capture credentials through [Input Capture](https://attack.mitre.org/techniques/T1056) on sites that mimic email login interfaces.\n\nThere have been notable incidents where internal spearphishing has been used. The Eye Pyramid campaign used phishing emails with malicious attachments for lateral movement between victims, compromising nearly 18,000 email accounts in the process.(Citation: Trend Micro When Phishing Starts from the Inside 2017) The Syrian Electronic Army (SEA) compromised email accounts at the Financial Times (FT) to steal additional account credentials. Once FT learned of the attack and began warning employees of the threat, the SEA sent phishing emails mimicking the Financial Times IT department and were able to compromise even more users.(Citation: THE FINANCIAL TIMES LTD 2019.)",
            "id": "attack-pattern--9e7452df-5144-4b6e-b04a-b66dd4016747",
            "x_mitre_platforms": [
                "Windows",
                "macOS",
                "Linux",
                "Office 365",
                "SaaS"
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "x_mitre_version": "1.0",
            "type": "attack-pattern",
            "x_mitre_detection": "Network intrusion detection systems and email gateways usually do not scan internal email, but an organization can leverage the journaling-based solution which sends a copy of emails to a security service for offline analysis or incorporate service-integrated solutions using on-premise or API-based integrations to help detect internal spearphishing attacks.(Citation: Trend Micro When Phishing Starts from the Inside 2017)",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_contributors": [
                "Tim MalcomVetter",
                "Swetha Prabakaran, Microsoft Threat Intelligence Center (MSTIC)"
            ],
            "created": "2019-09-04T19:26:12.441Z",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-attack",
                    "phase_name": "lateral-movement"
                }
            ],
            "external_references": [
                {
                    "source_name": "mitre-attack",
                    "external_id": "T1534",
                    "url": "https://attack.mitre.org/techniques/T1534"
                },
                {
                    "source_name": "Trend Micro When Phishing Starts from the Inside 2017",
                    "description": "Chris Taylor. (2017, October 5). When Phishing Starts from the Inside. Retrieved October 8, 2019.",
                    "url": "https://blog.trendmicro.com/phishing-starts-inside/"
                },
                {
                    "source_name": "THE FINANCIAL TIMES LTD 2019.",
                    "description": "THE FINANCIAL TIMES. (2019, September 2). A sobering day. Retrieved October 8, 2019.",
                    "url": " https://labs.ft.com/2013/05/a-sobering-day/?mhq5j=e6 "
                }
            ],
            "modified": "2019-10-22T21:37:05.004Z"
        }
    ]
}