{
    "id": "bundle--febf1da9-f480-4ac1-ab65-39d7233dcd54",
    "type": "bundle",
    "spec_version": "2.0",
    "objects": [
        {
            "external_references": [
                {
                    "url": "https://attack.mitre.org/techniques/T1090",
                    "source_name": "mitre-attack",
                    "external_id": "T1090"
                },
                {
                    "url": "https://arxiv.org/ftp/arxiv/papers/1408/1408.1136.pdf",
                    "source_name": "University of Birmingham C2",
                    "description": "Gardiner, J.,  Cova, M., Nagaraja, S. (2014, February). Command & Control Understanding, Denying and Detecting. Retrieved April 20, 2016."
                },
                {
                    "url": "http://blog.trendmicro.com/trendlabs-security-intelligence/in-depth-look-apt-attack-tools-of-the-trade/",
                    "source_name": "Trend Micro APT Attack Tools",
                    "description": "Wilhoit, K. (2013, March 4). In-Depth Look: APT Attack Tools of the Trade. Retrieved December 2, 2015."
                }
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "x_mitre_detection": "Processes utilizing the network that do not normally have network communication or have never been seen before are suspicious. Network activities disassociated from user-driven actions from processes that normally require user direction are suspicious.\n\nAnalyze network data for uncommon data flows (e.g., a client sending significantly more data than it receives from a server or between clients that should not or often do not communicate with one another). Processes utilizing the network that do not normally have network communication or have never been seen before are suspicious. Analyze packet contents to detect communications that do not follow the expected protocol behavior for the port that is being used. (Citation: University of Birmingham C2)",
            "x_mitre_contributors": [
                "Walker Johnson"
            ],
            "x_mitre_data_sources": [
                "Process use of network",
                "Process monitoring",
                "Netflow/Enclave netflow",
                "Packet capture"
            ],
            "modified": "2018-12-05T17:37:12.426Z",
            "x_mitre_network_requirements": true,
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_platforms": [
                "Linux",
                "macOS",
                "Windows"
            ],
            "kill_chain_phases": [
                {
                    "phase_name": "command-and-control",
                    "kill_chain_name": "mitre-attack"
                }
            ],
            "id": "attack-pattern--731f4f55-b6d0-41d1-a7a9-072a66389aea",
            "name": "Connection Proxy",
            "created": "2017-05-31T21:31:08.479Z",
            "x_mitre_version": "1.0",
            "type": "attack-pattern",
            "description": "A connection proxy is used to direct network traffic between systems or act as an intermediary for network communications. Many tools exist that enable traffic redirection through proxies or port redirection, including [HTRAN](https://attack.mitre.org/software/S0040), ZXProxy, and ZXPortMap. (Citation: Trend Micro APT Attack Tools)\n\nThe definition of a proxy can also be expanded out to encompass trust relationships between networks in peer-to-peer, mesh, or trusted connections between networks consisting of hosts or systems that regularly communicate with each other.\n\nThe network may be within a single organization or across organizations with trust relationships. Adversaries could use these types of relationships to manage command and control communications, to reduce the number of simultaneous outbound network connections, to provide resiliency in the face of connection loss, or to ride over existing trusted communications paths between victims to avoid suspicion."
        }
    ]
}