{
    "type": "bundle",
    "id": "bundle--961b4334-da86-41b4-a730-5001156602af",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "modified": "2021-03-08T10:33:01.045Z",
            "name": "Trusted Relationship",
            "x_mitre_data_sources": [
                "Application Log: Application Log Content",
                "Logon Session: Logon Session Metadata",
                "Logon Session: Logon Session Creation"
            ],
            "x_mitre_version": "2.2",
            "created": "2018-04-18T17:59:24.739Z",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-attack",
                    "phase_name": "initial-access"
                }
            ],
            "x_mitre_platforms": [
                "Windows",
                "SaaS",
                "IaaS",
                "Linux",
                "macOS"
            ],
            "x_mitre_is_subtechnique": false,
            "id": "attack-pattern--9fa07bef-9c81-421e-a8e5-ad4366c5a925",
            "description": "Adversaries may breach or otherwise leverage organizations who have access to intended victims. Access through trusted third party relationship exploits an existing connection that may not be protected or receives less scrutiny than standard mechanisms of gaining access to a network.\n\nOrganizations often grant elevated access to second or third-party external providers in order to allow them to manage internal systems as well as cloud-based environments. Some examples of these relationships include IT services contractors, managed security providers, infrastructure contractors (e.g. HVAC, elevators, physical security). The third-party provider's access may be intended to be limited to the infrastructure being maintained, but may exist on the same network as the rest of the enterprise. As such, [Valid Accounts](https://attack.mitre.org/techniques/T1078) used by the other party for access to internal network systems may be compromised and used.(Citation: CISA IT Service Providers)",
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "x_mitre_contributors": [
                "Praetorian"
            ],
            "x_mitre_detection": "Establish monitoring for activity conducted by second and third party providers and other trusted entities that may be leveraged as a means to gain access to the network. Depending on the type of relationship, an adversary may have access to significant amounts of information about the target before conducting an operation, especially if the trusted relationship is based on IT services. Adversaries may be able to act quickly towards an objective, so proper monitoring for behavior related to Credential Access, Lateral Movement, and Collection will be important to detect the intrusion.",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "external_references": [
                {
                    "url": "https://attack.mitre.org/techniques/T1199",
                    "external_id": "T1199",
                    "source_name": "mitre-attack"
                },
                {
                    "url": "https://us-cert.cisa.gov/APTs-Targeting-IT-Service-Provider-Customers",
                    "description": "CISA. (n.d.). APTs Targeting IT Service Provider Customers. Retrieved November 16, 2020.",
                    "source_name": "CISA IT Service Providers"
                }
            ]
        }
    ]
}