{
    "type": "bundle",
    "id": "bundle--97db56ec-fefa-4bbb-b924-591f8910b313",
    "spec_version": "2.0",
    "objects": [
        {
            "id": "attack-pattern--1608f3e1-598a-42f4-a01a-2e252e81728f",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "name": "Email Collection",
            "description": "Adversaries may target user email to collect sensitive information from a target.\n\nFiles containing email data can be acquired from a user's system, such as Outlook storage or cache files .pst and .ost.\n\nAdversaries may leverage a user's credentials and interact directly with the Exchange server to acquire information from within a network.\n\nSome adversaries may acquire user credentials and access externally facing webmail applications, such as Outlook Web Access.",
            "external_references": [
                {
                    "external_id": "T1114",
                    "url": "https://attack.mitre.org/techniques/T1114",
                    "source_name": "mitre-attack"
                }
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "x_mitre_version": "1.0",
            "x_mitre_data_sources": [
                "Authentication logs",
                "File monitoring",
                "Process monitoring",
                "Process use of network"
            ],
            "x_mitre_detection": "There are likely a variety of ways an adversary could collect email from a target, each with a different mechanism for detection.\n\nFile access of local system email files for Exfiltration, unusual processes connecting to an email server within a network, or unusual access patterns or authentication attempts on a public-facing webmail server may all be indicators of malicious activity.\n\nMonitor processes and command-line arguments for actions that could be taken to gather local email files. Remote access tools with built-in features may interact directly with the Windows API to gather information. Information may also be acquired through Windows system management tools such as [Windows Management Instrumentation](https://attack.mitre.org/techniques/T1047) and [PowerShell](https://attack.mitre.org/techniques/T1086).",
            "x_mitre_platforms": [
                "Windows"
            ],
            "type": "attack-pattern",
            "kill_chain_phases": [
                {
                    "phase_name": "collection",
                    "kill_chain_name": "mitre-attack"
                }
            ],
            "modified": "2018-10-17T00:14:20.652Z",
            "created": "2017-05-31T21:31:25.454Z"
        }
    ]
}