{
    "type": "bundle",
    "id": "bundle--c40dd468-88b2-4b22-a059-59718cefc275",
    "spec_version": "2.0",
    "objects": [
        {
            "type": "attack-pattern",
            "id": "attack-pattern--7fd87010-3a00-4da3-b905-410525e8ec44",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "created": "2017-05-31T21:30:51.733Z",
            "modified": "2017-12-14T16:55:59.600Z",
            "name": "Scripting",
            "description": "Adversaries may use scripts to aid in operations and perform multiple actions that would otherwise be manual. Scripting is useful for speeding up operational tasks and reducing the time required to gain access to critical resources. Some scripting languages may be used to bypass process monitoring mechanisms by directly interacting with the operating system at an API level instead of calling other programs. Common scripting languages for Windows include VBScript and PowerShell but could also be in the form of command-line batch scripts.\n\nMany popular offensive frameworks exist which use forms of scripting for security testers and adversaries alike.  (Citation: Metasploit) (Citation: Metasploit),  (Citation: Veil) (Citation: Veil), and PowerSploit (Citation: Powersploit) are three examples that are popular among penetration testers for exploit and post-compromise operations and include many features for evading defenses. Some adversaries are known to use PowerShell. (Citation: Alperovitch 2014)\n\nDetection: Scripting may be common on admin, developer, or power user systems, depending on job function. If scripting is restricted for normal users, then any attempts to enable scripts running on a system would be considered suspicious. If scripts are not commonly used on a system, but enabled, scripts running out of cycle from patching or other administrator functions are suspicious. Scripts should be captured from the file system when possible to determine their actions and intent.\n\nScripts are likely to perform actions with various effects on a system that may generate events, depending on the types of monitoring used. Monitor processes and command-line arguments for script execution and subsequent behavior. Actions may be related to network and system information Discovery, Collection, or other scriptable post-compromise behaviors and could be used as indicators of detection leading back to the source script.\n\nPlatforms: Windows Server 2003, Windows Server 2008, Windows Server 2012, Windows XP, Windows 7, Windows 8, Windows Server 2003 R2, Windows Server 2008 R2, Windows Server 2012 R2, Windows Vista, Windows 8.1, Linux, Windows 10, MacOS, OS X\n\nData Sources: Process monitoring, File monitoring, Process command-line parameters\n\nDefense Bypassed: Process whitelisting",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-attack",
                    "phase_name": "defense-evasion"
                },
                {
                    "kill_chain_name": "mitre-attack",
                    "phase_name": "execution"
                }
            ],
            "external_references": [
                {
                    "source_name": "mitre-attack",
                    "url": "https://attack.mitre.org/wiki/Technique/T1064",
                    "external_id": "T1064"
                },
                {
                    "source_name": "Metasploit",
                    "description": "Metasploit. (n.d.).  Retrieved December 4, 2014.",
                    "url": "http://www.metasploit.com"
                },
                {
                    "source_name": "Veil",
                    "description": "Veil Framework. (n.d.).  Retrieved December 4, 2014.",
                    "url": "https://www.veil-framework.com/framework/"
                },
                {
                    "source_name": "Powersploit",
                    "description": "PowerSploit. (n.d.).  Retrieved December 4, 2014.",
                    "url": "https://github.com/mattifestation/PowerSploit"
                },
                {
                    "source_name": "Alperovitch 2014",
                    "description": "Alperovitch, D. (2014, July 7). Deep in Thought: Chinese Targeting of National Security Think Tanks. Retrieved November 12, 2014.",
                    "url": "http://blog.crowdstrike.com/deep-thought-chinese-targeting-national-security-think-tanks/"
                }
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "x_mitre_data_sources": [
                "Process monitoring",
                "File monitoring",
                "Process command-line parameters"
            ],
            "x_mitre_defense_bypassed": [
                "Process whitelisting"
            ],
            "x_mitre_platforms": [
                "Windows Server 2003",
                "Windows Server 2008",
                "Windows Server 2012",
                "Windows XP",
                "Windows 7",
                "Windows 8",
                "Windows Server 2003 R2",
                "Windows Server 2008 R2",
                "Windows Server 2012 R2",
                "Windows Vista",
                "Windows 8.1",
                "Linux",
                "Windows 10",
                "MacOS",
                "OS X"
            ]
        }
    ]
}