{
    "type": "bundle",
    "id": "bundle--7bba2913-9596-435a-a669-0ee75bb1e41b",
    "spec_version": "2.0",
    "objects": [
        {
            "x_mitre_data_sources": [
                "File monitoring",
                "Data loss prevention"
            ],
            "x_mitre_permissions_required": [
                "User"
            ],
            "name": "Replication Through Removable Media",
            "description": "Adversaries may move onto systems, possibly those on disconnected or air-gapped networks, by copying malware to removable media and taking advantage of Autorun features when the media is inserted into a system and executes. In the case of Lateral Movement, this may occur through modification of executable files stored on removable media or by copying malware and renaming it to look like a legitimate file to trick users into executing it on a separate system. In the case of Initial Access, this may occur through manual manipulation of the media, modification of systems used to initially format the media, or modification to the media's firmware itself.",
            "id": "attack-pattern--3b744087-9945-4a6f-91e8-9dbceda417a4",
            "x_mitre_platforms": [
                "Windows"
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "x_mitre_version": "1.0",
            "x_mitre_system_requirements": [
                "Removable media allowed, Autorun enabled or vulnerability present that allows for code execution"
            ],
            "type": "attack-pattern",
            "x_mitre_detection": "Monitor file access on removable media. Detect processes that execute from removable media after it is mounted or when initiated by a user. If a remote access tool is used in this manner to move laterally, then additional actions are likely to occur after execution, such as opening network connections for Command and Control and system and network information Discovery.",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "created": "2017-05-31T21:31:08.977Z",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-attack",
                    "phase_name": "lateral-movement"
                },
                {
                    "kill_chain_name": "mitre-attack",
                    "phase_name": "initial-access"
                }
            ],
            "external_references": [
                {
                    "external_id": "T1091",
                    "source_name": "mitre-attack",
                    "url": "https://attack.mitre.org/techniques/T1091"
                }
            ],
            "modified": "2019-07-18T17:52:28.429Z"
        }
    ]
}