{
    "type": "bundle",
    "id": "bundle--115e832e-4a6f-49cf-b099-68287a8dd6dc",
    "spec_version": "2.0",
    "objects": [
        {
            "x_mitre_data_sources": [
                "File monitoring",
                "Packet capture",
                "Network intrusion detection system",
                "Detonation chamber",
                "Email gateway",
                "Mail server"
            ],
            "name": "Spearphishing Attachment",
            "description": "Spearphishing attachment is a specific variant of spearphishing. Spearphishing attachment is different from other forms of spearphishing in that it employs the use of malware attached to an email. All forms of spearphishing are electronically delivered social engineering targeted at a specific individual, company, or industry. In this scenario, adversaries attach a file to the spearphishing email and usually rely upon [User Execution](https://attack.mitre.org/techniques/T1204) to gain execution.\n\nThere are many options for the attachment such as Microsoft Office documents, executables, PDFs, or archived files. Upon opening the attachment (and potentially clicking past protections), the adversary's payload exploits a vulnerability or directly executes on the user's system. The text of the spearphishing email usually tries to give a plausible reason why the file should be opened, and may explain how to bypass system protections in order to do so. The email may also contain instructions on how to decrypt an attachment, such as a zip file password, in order to evade email boundary defenses. Adversaries frequently manipulate file extensions and icons in order to make attached executables appear to be document files, or files exploiting one application appear to be a file for a different one.",
            "id": "attack-pattern--6aac77c4-eaf2-4366-8c13-ce50ab951f38",
            "x_mitre_platforms": [
                "Windows",
                "macOS",
                "Linux"
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "x_mitre_version": "1.0",
            "type": "attack-pattern",
            "x_mitre_detection": "Network intrusion detection systems and email gateways can be used to detect spearphishing with malicious attachments in transit. Detonation chambers may also be used to identify malicious attachments. Solutions can be signature and behavior based, but adversaries may construct attachments in a way to avoid these systems.\n\nAnti-virus can potentially detect malicious documents and attachments as they're scanned to be stored on the email server or on the user's computer. Endpoint sensing or network sensing can potentially detect malicious events once the attachment is opened (such as a Microsoft Word document or PDF reaching out to the internet or spawning Powershell.exe) for techniques such as [Exploitation for Client Execution](https://attack.mitre.org/techniques/T1203) and [Scripting](https://attack.mitre.org/techniques/T1064).",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "created": "2018-04-18T17:59:24.739Z",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-attack",
                    "phase_name": "initial-access"
                }
            ],
            "external_references": [
                {
                    "external_id": "T1193",
                    "source_name": "mitre-attack",
                    "url": "https://attack.mitre.org/techniques/T1193"
                },
                {
                    "source_name": "capec",
                    "external_id": "CAPEC-163",
                    "url": "https://capec.mitre.org/data/definitions/163.html"
                }
            ],
            "modified": "2019-06-24T11:14:19.994Z"
        }
    ]
}