{
    "objects": [
        {
            "name": "Exploitation for Defense Evasion",
            "description": "Exploitation of a software vulnerability occurs when an adversary takes advantage of a programming error in a program, service, or within the operating system software or kernel itself to execute adversary-controlled code. Vulnerabilities may exist in defensive security software that can be used to disable or circumvent them.\n\nAdversaries may have prior knowledge through reconnaissance that security software exists within an environment or they may perform checks during or shortly after the system is compromised for Security Software Discovery. The security software will likely be targeted directly for exploitation. There are examples of antivirus software being targeted by persistent threat groups to avoid detection.\n\nDetection: Exploitation for defense evasion may happen shortly after the system has been compromised to prevent detection during later actions for for additional tools that may be brought in and used. Detecting software exploitation may be difficult depending on the tools available. Software exploits may not always succeed or may cause the exploited process to become unstable or crash. Also look for behavior on the system that might indicate successful compromise, such as abnormal behavior of processes. This could include suspicious files written to disk, evidence of Process Injection for attempts to hide execution or evidence of Discovery.\n\nPlatforms: Linux, Windows, macOS\n\nData Sources: Windows Error Reporting, Process Monitoring, File monitoring\n\nDefense Bypassed: Anti-virus, System access controls\n\nPermissions Required: User\n\nContributors: John Lambert, Microsoft Threat Intelligence Center",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-attack",
                    "phase_name": "defense-evasion"
                }
            ],
            "external_references": [
                {
                    "url": "https://attack.mitre.org/wiki/Technique/T1211",
                    "source_name": "mitre-attack",
                    "external_id": "T1211"
                }
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "created": "2018-04-13T16:49:59.881Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_platforms": [
                "Linux",
                "Windows",
                "macOS"
            ],
            "x_mitre_data_sources": [
                "Windows Error Reporting",
                "Process Monitoring",
                "File monitoring"
            ],
            "x_mitre_defense_bypassed": [
                "Anti-virus",
                "System access controls"
            ],
            "x_mitre_permissions_required": [
                "User"
            ],
            "x_mitre_contributors": [
                "John Lambert, Microsoft Threat Intelligence Center"
            ],
            "modified": "2018-04-13T16:49:59.881Z",
            "type": "attack-pattern",
            "id": "attack-pattern--483ec910-da9c-4b43-9173-fb2784df2d71"
        }
    ],
    "type": "bundle",
    "id": "bundle--55c72013-96ea-4853-a1b9-a7769bad9a3f",
    "spec_version": "2.0"
}