{
    "objects": [
        {
            "name": "Brute Force",
            "description": "Adversaries may use brute force techniques to attempt access to accounts when passwords are unknown or when password hashes are obtained.\n\nCredential Dumping to obtain password hashes may only get an adversary so far when Pass the Hash is not an option. Techniques to systematically guess the passwords used to compute hashes are available, or the adversary may use a pre-computed rainbow table. Cracking hashes is usually done on adversary-controlled systems outside of the target network. (Citation: Wikipedia Password cracking)\n\nAdversaries may attempt to brute force logins without knowledge of passwords or hashes during an operation either with zero knowledge or by attempting a list of known or possible passwords. This is a riskier option because it could cause numerous authentication failures and account lockouts, depending on the organization's login failure policies. (Citation: Cylance Cleaver)\n\nA related technique called password spraying uses one password, or a small list of passwords, that matches the complexity policy of the domain and may be a commonly used password. Logins are attempted with that password and many different accounts on a network to avoid account lockouts that would normally occur when brute forcing a single account with many passwords. (Citation: BlackHillsInfosec Password Spraying)\n\nDetection: It is difficult to detect when hashes are cracked, since this is generally done outside the scope of the target network. \n\nMonitor authentication logs for system and application login failures of Valid Accounts. If authentication failures are high, then there may be a brute force attempt to gain access to a system using legitimate credentials.\n\nAlso monitor for many failed authentication attempts across various accounts that may result from password spraying attempts.\n\nPlatforms: Linux, macOS, Windows\n\nData Sources: Authentication logs\n\nPermissions Required: User\n\nContributors: John Strand",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-attack",
                    "phase_name": "credential-access"
                }
            ],
            "external_references": [
                {
                    "url": "https://attack.mitre.org/wiki/Technique/T1110",
                    "source_name": "mitre-attack",
                    "external_id": "T1110"
                },
                {
                    "description": "Wikipedia. (n.d.). Password cracking. Retrieved December 23, 2015.",
                    "source_name": "Wikipedia Password cracking",
                    "url": "https://en.wikipedia.org/wiki/Password%20cracking"
                },
                {
                    "description": "Cylance. (2014, December). Operation Cleaver. Retrieved September 14, 2017.",
                    "source_name": "Cylance Cleaver",
                    "url": "https://www.cylance.com/content/dam/cylance/pages/operation-cleaver/Cylance%20Operation%20Cleaver%20Report.pdf"
                },
                {
                    "description": "Thyer, J. (2015, October 30). Password Spraying & Other Fun with RPCCLIENT. Retrieved April 25, 2017.",
                    "source_name": "BlackHillsInfosec Password Spraying",
                    "url": "http://www.blackhillsinfosec.com/?p=4645"
                }
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "created": "2017-05-31T21:31:22.767Z",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "x_mitre_platforms": [
                "Linux",
                "macOS",
                "Windows"
            ],
            "x_mitre_data_sources": [
                "Authentication logs"
            ],
            "x_mitre_permissions_required": [
                "User"
            ],
            "x_mitre_contributors": [
                "John Strand"
            ],
            "id": "attack-pattern--a93494bb-4b80-4ea1-8695-3236a49916fd",
            "modified": "2018-04-13T17:05:30.756Z",
            "type": "attack-pattern"
        }
    ],
    "type": "bundle",
    "id": "bundle--9e1f5346-6112-451e-89c9-eeda57cbfd51",
    "spec_version": "2.0"
}