{
    "type": "bundle",
    "id": "bundle--dae2c096-daca-4d7a-8eb8-639d0841817b",
    "spec_version": "2.0",
    "objects": [
        {
            "x_mitre_data_sources": [
                "Windows Error Reporting",
                "Process monitoring",
                "Application logs"
            ],
            "x_mitre_permissions_required": [
                "User"
            ],
            "name": "Exploitation for Privilege Escalation",
            "description": "Exploitation of a software vulnerability occurs when an adversary takes advantage of a programming error in a program, service, or within the operating system software or kernel itself to execute adversary-controlled code. Security constructs such as permission levels will often hinder access to information and use of certain techniques, so adversaries will likely need to perform Privilege Escalation to include use of software exploitation to circumvent those restrictions.\n\nWhen initially gaining access to a system, an adversary may be operating within a lower privileged process which will prevent them from accessing certain resources on the system. Vulnerabilities may exist, usually in operating system components and software commonly running at higher permissions, that can be exploited to gain higher levels of access on the system. This could enable someone to move from unprivileged or user level permissions to SYSTEM or root permissions depending on the component that is vulnerable. This may be a necessary step for an adversary compromising a endpoint system that has been properly configured and limits other privilege escalation methods.",
            "id": "attack-pattern--b21c3b2d-02e6-45b1-980b-e69051040839",
            "x_mitre_platforms": [
                "Linux",
                "macOS",
                "Windows"
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "x_mitre_version": "1.1",
            "x_mitre_system_requirements": [
                "In the case of privilege escalation, the adversary likely already has user permissions on the target system."
            ],
            "type": "attack-pattern",
            "x_mitre_detection": "Detecting software exploitation may be difficult depending on the tools available. Software exploits may not always succeed or may cause the exploited process to become unstable or crash. Also look for behavior on the endpoint system that might indicate successful compromise, such as abnormal behavior of the processes. This could include suspicious files written to disk, evidence of [Process Injection](https://attack.mitre.org/techniques/T1055) for attempts to hide execution or evidence of Discovery.\n\nHigher privileges are often necessary to perform additional actions such as some methods of [Credential Dumping](https://attack.mitre.org/techniques/T1003). Look for additional activity that may indicate an adversary has gained higher privileges.",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "created": "2017-05-31T21:30:55.066Z",
            "x_mitre_effective_permissions": [
                "User"
            ],
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-attack",
                    "phase_name": "privilege-escalation"
                }
            ],
            "external_references": [
                {
                    "external_id": "T1068",
                    "source_name": "mitre-attack",
                    "url": "https://attack.mitre.org/techniques/T1068"
                }
            ],
            "modified": "2019-07-26T19:55:06.358Z"
        }
    ]
}