{
    "type": "bundle",
    "id": "bundle--cf3ca1b9-141b-476e-9ceb-f0dd66de14e5",
    "spec_version": "2.0",
    "objects": [
        {
            "x_mitre_permissions_required": [
                "User"
            ],
            "x_mitre_data_sources": [
                "Process monitoring",
                "File monitoring",
                "Process command-line parameters"
            ],
            "name": "Scripting",
            "description": "Adversaries may use scripts to aid in operations and perform multiple actions that would otherwise be manual. Scripting is useful for speeding up operational tasks and reducing the time required to gain access to critical resources. Some scripting languages may be used to bypass process monitoring mechanisms by directly interacting with the operating system at an API level instead of calling other programs. Common scripting languages for Windows include VBScript and [PowerShell](https://attack.mitre.org/techniques/T1086) but could also be in the form of command-line batch scripts.\n\nScripts can be embedded inside Office documents as macros that can be set to execute when files used in [Spearphishing Attachment](https://attack.mitre.org/techniques/T1193) and other types of spearphishing are opened. Malicious embedded macros are an alternative means of execution than software exploitation through [Exploitation for Client Execution](https://attack.mitre.org/techniques/T1203), where adversaries will rely on macros being allowed or that the user will accept to activate them.\n\nMany popular offensive frameworks exist which use forms of scripting for security testers and adversaries alike. Metasploit (Citation: Metasploit_Ref), Veil (Citation: Veil_Ref), and PowerSploit (Citation: Powersploit) are three examples that are popular among penetration testers for exploit and post-compromise operations and include many features for evading defenses. Some adversaries are known to use PowerShell. (Citation: Alperovitch 2014)",
            "id": "attack-pattern--7fd87010-3a00-4da3-b905-410525e8ec44",
            "x_mitre_platforms": [
                "Linux",
                "macOS",
                "Windows"
            ],
            "object_marking_refs": [
                "marking-definition--fa42a846-8d90-4e51-bc29-71d5b4802168"
            ],
            "x_mitre_version": "1.0",
            "type": "attack-pattern",
            "x_mitre_detection": "Scripting may be common on admin, developer, or power user systems, depending on job function. If scripting is restricted for normal users, then any attempts to enable scripts running on a system would be considered suspicious. If scripts are not commonly used on a system, but enabled, scripts running out of cycle from patching or other administrator functions are suspicious. Scripts should be captured from the file system when possible to determine their actions and intent.\n\nScripts are likely to perform actions with various effects on a system that may generate events, depending on the types of monitoring used. Monitor processes and command-line arguments for script execution and subsequent behavior. Actions may be related to network and system information Discovery, Collection, or other scriptable post-compromise behaviors and could be used as indicators of detection leading back to the source script.\n\nAnalyze Office file attachments for potentially malicious macros. Execution of macros may create suspicious process trees depending on what the macro is designed to do. Office processes, such as winword.exe, spawning instances of cmd.exe, script application like wscript.exe or powershell.exe, or other suspicious processes may indicate malicious activity. (Citation: Uperesia Malicious Office Documents)",
            "created_by_ref": "identity--c78cb6e5-0c4b-4611-8297-d1b8b55e40b5",
            "modified": "2019-06-24T13:41:53.706Z",
            "created": "2017-05-31T21:30:51.733Z",
            "kill_chain_phases": [
                {
                    "kill_chain_name": "mitre-attack",
                    "phase_name": "defense-evasion"
                },
                {
                    "kill_chain_name": "mitre-attack",
                    "phase_name": "execution"
                }
            ],
            "external_references": [
                {
                    "external_id": "T1064",
                    "source_name": "mitre-attack",
                    "url": "https://attack.mitre.org/techniques/T1064"
                },
                {
                    "description": "Metasploit. (n.d.). Retrieved December 4, 2014.",
                    "source_name": "Metasploit_Ref",
                    "url": "http://www.metasploit.com"
                },
                {
                    "source_name": "Veil_Ref",
                    "description": "Veil Framework. (n.d.). Retrieved December 4, 2014.",
                    "url": "https://www.veil-framework.com/framework/"
                },
                {
                    "source_name": "Powersploit",
                    "description": "PowerSploit. (n.d.). Retrieved December 4, 2014.",
                    "url": "https://github.com/mattifestation/PowerSploit"
                },
                {
                    "description": "Alperovitch, D. (2014, July 7). Deep in Thought: Chinese Targeting of National Security Think Tanks. Retrieved November 12, 2014.",
                    "source_name": "Alperovitch 2014",
                    "url": "https://blog.crowdstrike.com/deep-thought-chinese-targeting-national-security-think-tanks/"
                },
                {
                    "source_name": "Uperesia Malicious Office Documents",
                    "description": "Felix. (2016, September). Analyzing Malicious Office Documents. Retrieved April 11, 2018.",
                    "url": "https://www.uperesia.com/analyzing-malicious-office-documents"
                }
            ],
            "x_mitre_defense_bypassed": [
                "Process whitelisting",
                "Data Execution Prevention",
                "Exploit Prevention"
            ]
        }
    ]
}